
&НаКлиенте
Процедура КонтактноеЛицоПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Контрагент", ПолучитьКонтрагента(Объект.Договор));
	
	ПараметрыВыбора1 = Новый Структура;
	ПараметрыВыбора1.Вставить("Отбор", ПараметрыОтбора); 
	ПараметрыВыбора1.Вставить("РежимВыбора",Истина);
	ПараметрыВыбора1.Вставить("МножественныйВыбор",Ложь);
	
	ОткрытьФорму("Справочник.КонтактныеЛица.ФормаВыбора", ПараметрыВыбора1, Элемент);
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Функция ПолучитьКонтрагента(Договор)
	Возврат Договор.Владелец;
КонецФункции
