
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗаголовкиКомандВЗависимостиОтОпций();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_НаборКонстант" Тогда 
		Прочитать();
		УстановитьЗаголовкиКомандВЗависимостиОтОпций();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьХранилищеШаблонов(Команда)
	ОткрытьФорму("Справочник.ХранилищеШаблонов.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьЗаголовкиКомандВЗависимостиОтОпций()
	
	Если НаборКонстант.ФункциональнаяОпцияИспользоватьПодсистемуРаботы Тогда
		ЗаголовокСостоянияСобытий = НСтр("ru='Состояния событий и заданий'");
	Иначе
		ЗаголовокСостоянияСобытий = НСтр("ru='Состояния событий'");
	КонецЕсли;
	Элементы.СправочникСостоянияСобытийОткрытьСписок.Заголовок = ЗаголовокСостоянияСобытий;
	Элементы.СправочникСостоянияСобытийОткрытьСписок1.Заголовок = ЗаголовокСостоянияСобытий;
	
	Если НаборКонстант.ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности Тогда
		ЗаголовокНаправленияДеятельности = НСтр("ru='Направления деятельности'");
	Иначе
		ЗаголовокНаправленияДеятельности = НСтр("ru='Направление деятельности'");
	КонецЕсли;
	Элементы.СправочникНаправленияДеятельностиОткрытьСписок.Заголовок = ЗаголовокНаправленияДеятельности;
	
КонецПроцедуры

#КонецОбласти