#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СборСтатистикиУНФ.ОтправитьСобытиеСДопДанными(НСтр("ru='Показана форма перехода в МК'"), "");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	
	НачалоРаботыСПрограммойСервер.УстановитьСтандартныйИнтерфейс();
	ОбновитьИнтерфейс();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Установить(Команда)
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ИнформацияПрограммыПросмотра = НРег(СистемнаяИнформация.ИнформацияПрограммыПросмотра);
	
	АдресСтраницы = "";
	
	Если СтрНайти(ИнформацияПрограммыПросмотра, "iphone") <> 0
		ИЛИ СтрНайти(ИнформацияПрограммыПросмотра, "ipod") <> 0 Тогда 
		АдресСтраницы = МобильныйКлиентУНФКлиентСервер.ПолучитьАдресПубликацииМобильногоКлиентаВAppStore();
	ИначеЕсли СтрНайти(ИнформацияПрограммыПросмотра, "android") <> 0 Тогда
		АдресСтраницы = МобильныйКлиентУНФКлиентСервер.ПолучитьАдресПубликацииМобильногоКлиентаВGooglePlay();
	КонецЕсли;
	
	ПерейтиПоНавигационнойСсылке(АдресСтраницы);
	
КонецПроцедуры

#КонецОбласти
