
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеПоляФайловДляМагазинаСоцСетей.Файл КАК Файл,
		|	ДополнительныеПоляФайловДляМагазинаСоцСетей.Высота КАК Высота,
		|	ДополнительныеПоляФайловДляМагазинаСоцСетей.Ширина КАК Ширина,
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	NULL КАК Характеристика
		|ИЗ
		|	РегистрСведений.ДополнительныеПоляФайловДляМагазинаСоцСетей КАК ДополнительныеПоляФайловДляМагазинаСоцСетей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО ДополнительныеПоляФайловДляМагазинаСоцСетей.Файл.ВладелецФайла = Номенклатура.Ссылка
		|ГДЕ
		|	(ДополнительныеПоляФайловДляМагазинаСоцСетей.Высота < 400
		|			ИЛИ ДополнительныеПоляФайловДляМагазинаСоцСетей.Ширина < 400)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДополнительныеПоляФайловДляМагазинаСоцСетей.Файл,
		|	ДополнительныеПоляФайловДляМагазинаСоцСетей.Высота,
		|	ДополнительныеПоляФайловДляМагазинаСоцСетей.Ширина,
		|	ХарактеристикиНоменклатуры.Владелец,
		|	ХарактеристикиНоменклатуры.Ссылка
		|ИЗ
		|	РегистрСведений.ДополнительныеПоляФайловДляМагазинаСоцСетей КАК ДополнительныеПоляФайловДляМагазинаСоцСетей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|		ПО ДополнительныеПоляФайловДляМагазинаСоцСетей.Файл.ВладелецФайла = ХарактеристикиНоменклатуры.Ссылка
		|ГДЕ
		|	(ДополнительныеПоляФайловДляМагазинаСоцСетей.Высота < 400
		|			ИЛИ ДополнительныеПоляФайловДляМагазинаСоцСетей.Ширина < 400)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаФайлов.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитовЭлементовФормы

&НаКлиенте
Процедура ТаблицаФайловПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФайловПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти
