
#Область ПрограммныйИнтерфейс

// Функция - Минимальные цены используются
// 
// Возвращаемое значение:
//  Булево - признак использования минимальных цен
//
Функция МинимальныеЦеныИспользуются() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьМинимальныеЦены");

КонецФункции

// Функция - Использовать минимальные цены на форме подбора
//
// Параметры:
//  ИмяФормыВладельца	 - Строка - Имя формы
//  ЭтоПодбор			 - Булево - признак использования подбора
// 
// Возвращаемое значение:
//  Булево - признак использования минимальных цен на форме подбора 
//
Функция ИспользоватьМинимальныеЦеныНаФормеПодбора(ИмяФормыВладельца, ЭтоПодбор) Экспорт
	
	МассивДоступныхДляМинимальныхЦенФорм = Новый Массив;
	МассивДоступныхДляМинимальныхЦенФорм.Добавить("Документ.ЗаказПокупателя.Форма.ФормаДокумента");
	МассивДоступныхДляМинимальныхЦенФорм.Добавить("Документ.АктВыполненныхРабот.Форма.ФормаДокумента");
	МассивДоступныхДляМинимальныхЦенФорм.Добавить("Документ.ЗаданиеНаРаботу.Форма.ФормаДокумента");
	МассивДоступныхДляМинимальныхЦенФорм.Добавить("Документ.КорректировкаРеализации.Форма.ФормаДокумента");
	МассивДоступныхДляМинимальныхЦенФорм.Добавить("Документ.ОтчетОПереработке.Форма.ФормаДокумента");
	МассивДоступныхДляМинимальныхЦенФорм.Добавить("Документ.ПереоценкаВРозницеСуммовойУчет.Форма.ФормаДокумента");
	МассивДоступныхДляМинимальныхЦенФорм.Добавить("Документ.ПереоценкаТоваровНаКомиссии.Форма.ФормаДокумента");
	МассивДоступныхДляМинимальныхЦенФорм.Добавить("Документ.ПланПродаж.Форма.ФормаДокумента");
	МассивДоступныхДляМинимальныхЦенФорм.Добавить("Документ.ОтчетКомиссионераОСписании.Форма.ФормаДокумента");
	МассивДоступныхДляМинимальныхЦенФорм.Добавить("Документ.СчетНаОплату.Форма.ФормаДокумента");
	МассивДоступныхДляМинимальныхЦенФорм.Добавить("Документ.ПередачаТоваровМеждуОрганизациями.Форма.ФормаДокумента");
	МассивДоступныхДляМинимальныхЦенФорм.Добавить("Документ.ЗаказПокупателя.Форма.ФормаЗаказНаряда");
	МассивДоступныхДляМинимальныхЦенФорм.Добавить("Документ.РасходнаяНакладная.Форма.ФормаДокумента");
	МассивДоступныхДляМинимальныхЦенФорм.Добавить("Документ.ЧекККМ.Форма.ФормаДокумента");
	МассивДоступныхДляМинимальныхЦенФорм.Добавить("Документ.ЧекККМ.Форма.ФормаДокумента_РМК");
	МассивДоступныхДляМинимальныхЦенФорм.Добавить("Документ.ЧекККМВозврат.Форма.ФормаДокумента");
	МассивДоступныхДляМинимальныхЦенФорм.Добавить("Документ.ОтчетОРозничныхПродажах.Форма.ФормаДокумента");
	
	Возврат ЭтоПодбор И (МассивДоступныхДляМинимальныхЦенФорм.Найти(ИмяФормыВладельца) <> Неопределено); 
	
КонецФункции

// Функция - Получить общий вид минимальных цен
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыЦен - вид цены используемый как общий
//
Функция ПолучитьОбщийВидМинимальныхЦен() Экспорт
	
	Запись = РегистрыСведений.ВидыМинимальныхЦенСтруктурныхЕдиниц.СоздатьМенеджерЗаписи();
	Запись.СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
	Запись.Прочитать();
	Возврат Запись.ВидМинимальныхЦен;
	
КонецФункции

// Функция - Получить вид минимальных цен
//
// Параметры:
//  СтруктурнаяЕдиница	 - СправочникСсылка.СтруктурнаяЕдиница - структурная единица, по которой требуется получить вид минимальных цен
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыЦен - вид минимальных цен по структурной единице из настроек, либо общий, если вид для структурной единицы не задан
//
Функция ПолучитьВидМинимальныхЦен(СтруктурнаяЕдиница) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыМинимальныхЦенСтруктурныхЕдиниц.ВидМинимальныхЦен КАК ВидМинимальныхЦен,
	               |	1 КАК Приоритет
	               |ПОМЕСТИТЬ ВидыМинимальныхЦен
	               |ИЗ
	               |	РегистрСведений.ВидыМинимальныхЦенСтруктурныхЕдиниц КАК ВидыМинимальныхЦенСтруктурныхЕдиниц
	               |ГДЕ
	               |	ВидыМинимальныхЦенСтруктурныхЕдиниц.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВидыМинимальныхЦенСтруктурныхЕдиниц.ВидМинимальныхЦен,
	               |	2
	               |ИЗ
	               |	РегистрСведений.ВидыМинимальныхЦенСтруктурныхЕдиниц КАК ВидыМинимальныхЦенСтруктурныхЕдиниц
	               |ГДЕ
	               |	ВидыМинимальныхЦенСтруктурныхЕдиниц.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ВидыМинимальныхЦен.ВидМинимальныхЦен КАК ВидМинимальныхЦен
	               |ИЗ
	               |	ВидыМинимальныхЦен КАК ВидыМинимальныхЦен
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВидыМинимальныхЦен.Приоритет";
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.ВидМинимальныхЦен;
	КонецЕсли;	
	
КонецФункции

#КонецОбласти