
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Элементы.ГруппаВебВитрина.Видимость = Ложь;
	Иначе
		ПоказыватьКомандуУстановитьРасширениеМаг1с = Константы.ПоказыватьКомандуУстановитьРасширениеМаг1с.Получить();
		Элементы.ОбщаяКомандаУстановитьРасширениеМаг1С.Видимость = ПоказыватьКомандуУстановитьРасширениеМаг1с;
		Элементы.ВебВитрина.Видимость = Не ПоказыватьКомандуУстановитьРасширениеМаг1с;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодробнееПроОнлайнПродажиНажатие(Элемент)
	СсылкаПодробнееПроОнлайнПродажи = "https://v8.1c.ru/small.biz/online-trading/";
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(СсылкаПодробнееПроОнлайнПродажи);
КонецПроцедуры

&НаКлиенте
Процедура ВебВитрина(Команда)
	
	ИмяФормыМастера = "Обработка.Маг1СНастройкаВебВитрины.Форма";
	ОткрытьФорму(ИмяФормыМастера);
	
КонецПроцедуры

#КонецОбласти
