
#Область ПрограммныйИнтерфейс

Процедура ОбработатьПроизвольноеДействиеСообщенияАссистента(ОписаниеСообщения) Экспорт
	ДанныеДляПерехода = ОписаниеСообщения.Данные;
	Если ОписаниеСообщения.ВыбранноеДействие = "ПерейтиКЗадачеПоНалогам" Тогда
		Если ТипЗнч(ДанныеДляПерехода) = Тип("Структура") Тогда
			ОткрытьФорму(ДанныеДляПерехода.ИмяФормыЗадачи, ДанныеДляПерехода.ПараметрыОткрытия);
			Возврат;
		КонецЕсли;
	ИначеЕсли ОписаниеСообщения.ВыбранноеДействие = "ПерейтиККУДиР" Тогда
		Если ТипЗнч(ДанныеДляПерехода) = Тип("Структура") Тогда
			ПараметрыФормы = Новый Структура("Организация", ДанныеДляПерехода.ПараметрыОткрытия.Организация);
			ОткрытьФорму("Документ.ЗаписиУСН.Форма.ФормаСпискаЗаписиПрочие", ПараметрыФормы);
		КонецЕсли;
	ИначеЕсли ОписаниеСообщения.ВыбранноеДействие = "ПерейтиКПоказателямПоЕНВД" Тогда
		Если ТипЗнч(ДанныеДляПерехода) = Тип("Структура") Тогда
			ОткрытьФорму("Документ.ПоказателиЕНВД.ФормаОбъекта", ДанныеДляПерехода.ПараметрыОткрытия);
		КонецЕсли;
	ИначеЕсли ОписаниеСообщения.ВыбранноеДействие = "ОткрытьРасчетПотребностейМинимальныеОстаткиЗапасов" Тогда
		ЗаголовокПодборкиСпискаНоменклатуры = СтрШаблон(НСтр("ru='Рекомендации Даши (%1)'"), ОписаниеСообщения.Данные.Номенклатура.Количество());
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СпособПополнения", "Закупки");
		ПараметрыФормы.Вставить("Организация", ОписаниеСообщения.Данные.Организация);
		ПараметрыФормы.Вставить("Склад", ОписаниеСообщения.Данные.СтруктурнаяЕдиница);
		ПараметрыФормы.Вставить("Номенклатура", ОписаниеСообщения.Данные.Номенклатура);
		ПараметрыФормы.Вставить("ЭтоНоменклатураПодборкаАссистента", Истина);
		ПараметрыФормы.Вставить("ЗаголовокПодборкиСпискаНоменклатуры", ЗаголовокПодборкиСпискаНоменклатуры);
		ОткрытьФорму("Обработка.РасчетПотребностей.Форма.Форма", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
