//ЗапасыСодержание Поле Пользовательская видимость = Истина

&НаСервере
&После("ПриСозданииНаСервере")
Процедура _ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	_ПериодЗакрытия.Вариант			= ВариантСтандартногоПериода.ПроизвольныйПериод;
	_ПериодЗакрытия.ДатаНачала		= Объект._ДатаНачала;
	_ПериодЗакрытия.ДатаОкончания	= Объект._ДатаОкончания;	
	
	ОбработкаОтображения();
	
КонецПроцедуры

&НаКлиенте
Процедура __ПериодЗакрытияПриИзмененииПосле(Элемент)
	
	Объект._ДатаНачала		= _ПериодЗакрытия.ДатаНачала;
	Объект._ДатаОкончания	= _ПериодЗакрытия.ДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура _Запасы_ЦенаПоПрайсуПриИзмененииПосле(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура _Запасы_СезонныйКоэффициентПриИзмененииПосле(Элемент)
	
	_РассчитатьЦену();
	ЗапасыЦенаПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура _Запасы_КоэффициентОпцийПриИзмененииПосле(Элемент)
	
	_РассчитатьЦену();
	ЗапасыЦенаПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура _Запасы_ПроцентКомиссииАгентстваПриИзмененииПосле(Элемент)
	ЗапасыПроцентСкидкиНаценкиПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура _Запасы_ПроцентВозвратнойКомиссииАгентстваПриИзмененииПосле(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда Возврат КонецЕсли;
	
	СтрокаТабличнойЧасти._СуммаВозвратнойКомиссииАгентства = Окр(СтрокаТабличнойЧасти.Сумма * СтрокаТабличнойЧасти._ПроцентВозвратнойКомиссииАгентства / 100, 2);
	
КонецПроцедуры


&НаКлиенте
Процедура _РассчитатьЦену(СтрокаТабличнойЧасти = Неопределено, ПараметрыРасчета = Неопределено)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда Возврат КонецЕсли;
	
	СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти._ЦенаПоПрайсу 
		* ?(СтрокаТабличнойЧасти._СезонныйКоэффициент > 0, СтрокаТабличнойЧасти._СезонныйКоэффициент, 1)
		* ?(СтрокаТабличнойЧасти._КоэффициентОпций > 0, СтрокаТабличнойЧасти._КоэффициентОпций, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура _Запасы_ПроцентСкидкиПриИзмененииПосле(Элемент)
	ЗапасыПроцентСкидкиНаценкиПриИзменении(Элемент);
КонецПроцедуры

&НаСервере
Процедура ОбработкаОтображения()
	
	Элементы.ЗапасыЦена.Заголовок = "Цена без НДС";
	Элементы.ЗапасыСумма.Заголовок = "Сумма без НДС";
	
КонецПроцедуры