#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если Не ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураЗаполнения = Новый Структура();
	СтруктураЗаполнения.Вставить("Договор", ПараметрКоманды);
	ПараметрыЗаполнения(СтруктураЗаполнения);
	
	Если СтруктураЗаполнения.ДоговорИнтеркампани Тогда
		ВызватьИсключение НСтр("ru = 'Нельзя ввести заказ-наряд по договору передачи товаров между организациями.'");
	КонецЕсли;
	Если СтруктураЗаполнения.ЭтоГруппа Тогда
		ВызватьИсключение НСтр("ru = 'Нельзя выбирать группу контрагентов.'");
	КонецЕсли;
	
	ОткрытьФорму("Документ.ЗаказПокупателя.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", СтруктураЗаполнения));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПараметрыЗаполнения(СтруктураЗаполнения)
	
	ЗаголовокПредставления = "";
	Если Константы.ДобавитьСловоДоговорВПредставлениеДоговораОснованияПечати.Получить() Тогда
		
		ЗаголовокПредставления = НСтр("ru = 'Договор: '");
		
	КонецЕсли;
	
	СтруктураЗаполнения.Вставить("Контрагент", СтруктураЗаполнения.Договор.Владелец);
	СтруктураЗаполнения.Вставить("Организация", СтруктураЗаполнения.Договор.Организация);
	СтруктураЗаполнения.Вставить("ОснованиеПечатиСсылка", СтруктураЗаполнения.Договор);
	СтруктураЗаполнения.Вставить("ОснованиеПечати", ЗаголовокПредставления + СтруктураЗаполнения.Договор.Наименование);
	СтруктураЗаполнения.Вставить("ВидОперации", Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд);
	СтруктураЗаполнения.Вставить("ДоговорИнтеркампани", СтруктураЗаполнения.Договор.ЭтоДоговорПередачиТоваровМеждуОрганизациями);
	Если СтруктураЗаполнения.ДоговорИнтеркампани Тогда
		СтруктураЗаполнения.Вставить("ЭтоГруппа", Ложь);
	Иначе
		СтруктураЗаполнения.Вставить("ЭтоГруппа", СтруктураЗаполнения.Контрагент.ЭтоГруппа);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
