#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Контрагент)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Определяет список команд заполнения.
//
// Параметры:
//   КомандыЗаполнения - ТаблицаЗначений - Таблица с командами заполнения. Для изменения.
//       См. описание 1 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения, Параметры) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ПРОВОДКИ

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческий(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ТаблицаУправленческий.НомерСтроки КАК НомерСтроки,
	|	ТаблицаУправленческий.Период КАК Период,
	|	ТаблицаУправленческий.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем.Валютный
	|			ТОГДА ТаблицаУправленческий.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВалДт,
	|	ТаблицаУправленческий.СчетУчетаПродажи КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	0 КАК СуммаВалКт,
	|	ТаблицаУправленческий.Сумма КАК Сумма,
	|	&ОтражениеВыручки КАК Содержание
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаУправленческий
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	1,
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаДокумента.СчетУчетаАвансовПокупателя,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетУчетаАвансовПокупателяВалютный
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетУчетаАвансовПокупателяВалютный
	|			ТОГДА ТаблицаДокумента.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетУчетаРасчетовСПокупателемВалютный
	|			ТОГДА ТаблицаДокумента.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СчетУчетаРасчетовСПокупателемВалютный
	|			ТОГДА ТаблицаДокумента.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаДокумента.Сумма,
	|	&ЗачетПредоплаты
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаДокумента.Период КАК Период,
	|		ТаблицаДокумента.Организация КАК Организация,
	|		ТаблицаДокумента.СчетУчетаАвансовПокупателя КАК СчетУчетаАвансовПокупателя,
	|		ТаблицаДокумента.СчетУчетаАвансовПокупателяВалютный КАК СчетУчетаАвансовПокупателяВалютный,
	|		ТаблицаДокумента.СчетУчетаРасчетовСПокупателем КАК СчетУчетаРасчетовСПокупателем,
	|		ТаблицаДокумента.СчетУчетаРасчетовСПокупателемВалютный КАК СчетУчетаРасчетовСПокупателемВалютный,
	|		ТаблицаДокумента.ВалютаРасчетов КАК ВалютаРасчетов,
	|		СУММА(ТаблицаДокумента.СуммаВал) КАК СуммаВал,
	|		СУММА(ТаблицаДокумента.Сумма) КАК Сумма
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ТаблицаДокумента.Период КАК Период,
	|			ТаблицаДокумента.Организация КАК Организация,
	|			ТаблицаДокумента.СчетУчетаАвансовПокупателя КАК СчетУчетаАвансовПокупателя,
	|			ТаблицаДокумента.СчетУчетаАвансовПокупателя.Валютный КАК СчетУчетаАвансовПокупателяВалютный,
	|			ТаблицаДокумента.СчетУчетаРасчетовСПокупателем КАК СчетУчетаРасчетовСПокупателем,
	|			ТаблицаДокумента.СчетУчетаРасчетовСПокупателем.Валютный КАК СчетУчетаРасчетовСПокупателемВалютный,
	|			ТаблицаДокумента.ВалютаРасчетов КАК ВалютаРасчетов,
	|			ТаблицаДокумента.СуммаВал КАК СуммаВал,
	|			ТаблицаДокумента.Сумма КАК Сумма
	|		ИЗ
	|			ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ТаблицаДокумента.Дата,
	|			ТаблицаДокумента.Организация,
	|			ТаблицаДокумента.Контрагент.СчетУчетаАвансовПокупателя,
	|			ТаблицаДокумента.Контрагент.СчетУчетаАвансовПокупателя.Валютный,
	|			ТаблицаДокумента.Контрагент.СчетУчетаРасчетовСПокупателем,
	|			ТаблицаДокумента.Контрагент.СчетУчетаРасчетовСПокупателем.Валютный,
	|			ТаблицаДокумента.Валюта,
	|			0,
	|			ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИЗ
	|			ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями КАК ТаблицаДокумента
	|		ГДЕ
	|			ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаДокумента
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаДокумента.Период,
	|		ТаблицаДокумента.Организация,
	|		ТаблицаДокумента.СчетУчетаАвансовПокупателя,
	|		ТаблицаДокумента.СчетУчетаАвансовПокупателяВалютный,
	|		ТаблицаДокумента.СчетУчетаРасчетовСПокупателем,
	|		ТаблицаДокумента.СчетУчетаРасчетовСПокупателемВалютный,
	|		ТаблицаДокумента.ВалютаРасчетов
	|	
	|	ИМЕЮЩИЕ
	|		(СУММА(ТаблицаДокумента.Сумма) >= 0.005
	|			ИЛИ СУММА(ТаблицаДокумента.Сумма) <= -0.005
	|			ИЛИ СУММА(ТаблицаДокумента.СуммаВал) >= 0.005
	|			ИЛИ СУММА(ТаблицаДокумента.СуммаВал) <= -0.005)) КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	1,
	|	ТаблицаУправленческий.Дата,
	|	ТаблицаУправленческий.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаУправленческий.СчетУчета
	|		ИНАЧЕ &ОтрицательнаяКурсоваяРазницаСчетУчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СуммаКурсовойРазницы > 0
	|				И ТаблицаУправленческий.СчетУчетаВалютный
	|			ТОГДА ТаблицаУправленческий.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПоложительнаяКурсоваяРазницаСчетУчета
	|		ИНАЧЕ ТаблицаУправленческий.СчетУчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СуммаКурсовойРазницы < 0
	|				И ТаблицаУправленческий.СчетУчетаВалютный
	|			ТОГДА ТаблицаУправленческий.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаУправленческий.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаУправленческий.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	&КурсоваяРазница
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.Дата КАК Дата,
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.Организация КАК Организация,
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.СчетУчета КАК СчетУчета,
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.СчетУчетаВалютный КАК СчетУчетаВалютный,
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.Валюта КАК Валюта,
	|		СУММА(ТаблицаКурсовыхРазницРасчетыСПокупателями.СуммаКурсовойРазницы) КАК СуммаКурсовойРазницы
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ТаблицаДокумента.Дата КАК Дата,
	|			ТаблицаДокумента.Организация КАК Организация,
	|			ТаблицаДокумента.СчетУчета КАК СчетУчета,
	|			ТаблицаДокумента.СчетУчета.Валютный КАК СчетУчетаВалютный,
	|			ТаблицаДокумента.Валюта КАК Валюта,
	|			ТаблицаДокумента.СуммаКурсовойРазницы КАК СуммаКурсовойРазницы
	|		ИЗ
	|			ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями КАК ТаблицаДокумента
	|		ГДЕ
	|			ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ТаблицаДокумента.Дата,
	|			ТаблицаДокумента.Организация,
	|			ТаблицаДокумента.СчетУчета,
	|			ТаблицаДокумента.СчетУчета.Валютный,
	|			ТаблицаДокумента.Валюта,
	|			ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИЗ
	|			ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями КАК ТаблицаДокумента
	|		ГДЕ
	|			ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаКурсовыхРазницРасчетыСПокупателями
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.Дата,
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.Организация,
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.СчетУчета,
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.СчетУчетаВалютный,
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.Валюта
	|	
	|	ИМЕЮЩИЕ
	|		(СУММА(ТаблицаКурсовыхРазницРасчетыСПокупателями.СуммаКурсовойРазницы) >= 0.005
	|			ИЛИ СУММА(ТаблицаКурсовыхРазницРасчетыСПокупателями.СуммаКурсовойРазницы) <= -0.005)) КАК ТаблицаУправленческий
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	ТаблицаУправленческий.НомерСтроки,
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаУправленческий.СчетУчетаЗатрат,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаЗатрат.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаЗатрат.Валютный
	|			ТОГДА ТаблицаУправленческий.СуммаВознагражденияВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком.Валютный
	|			ТОГДА ТаблицаУправленческий.СуммаВознагражденияВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаУправленческий.СуммаВознаграждения,
	|	&ПрочиеРасходы
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаУправленческий
	|ГДЕ
	|	НЕ ТаблицаУправленческий.ЭтоВозврат
	|	И &ИспользоватьНовуюСхемуДвижений
	|	И НЕ ТаблицаУправленческий.СуммаВознаграждения = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	ТаблицаУправленческий.НомерСтроки,
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком.Валютный
	|			ТОГДА ТаблицаУправленческий.СуммаВознагражденияВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем.Валютный
	|			ТОГДА ТаблицаУправленческий.СуммаВознагражденияВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаУправленческий.СуммаВознаграждения,
	|	&ПрочиеРасходы
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаУправленческий
	|ГДЕ
	|	НЕ ТаблицаУправленческий.ЭтоВозврат
	|	И ТаблицаУправленческий.УдержатьКомиссионноеВознаграждение
	|	И &ИспользоватьНовуюСхемуДвижений
	|	И НЕ ТаблицаУправленческий.СуммаВознаграждения = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	ТаблицаУправленческий.НомерСтроки,
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаУправленческий.СчетУчетаЗатрат,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаЗатрат.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаЗатрат.Валютный
	|			ТОГДА ТаблицаУправленческий.СуммаВознагражденияВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком.Валютный
	|			ТОГДА ТаблицаУправленческий.СуммаВознагражденияВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаУправленческий.СуммаВознаграждения,
	|	&ПрочиеРасходы
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаУправленческий
	|ГДЕ
	|	ТаблицаУправленческий.ЭтоВозврат
	|	И ТаблицаУправленческий.ИспользоватьНовуюСхемуДвиженийВОтчете
	|	И &ИспользоватьНовуюСхемуДвижений
	|	И НЕ ТаблицаУправленческий.СуммаВознаграждения = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	ТаблицаУправленческий.НомерСтроки,
	|	ТаблицаУправленческий.Период,
	|	ТаблицаУправленческий.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПоставщиком.Валютный
	|			ТОГДА ТаблицаУправленческий.СуммаВознагражденияВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем.Валютный
	|			ТОГДА ТаблицаУправленческий.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаУправленческий.СчетУчетаРасчетовСПокупателем.Валютный
	|			ТОГДА ТаблицаУправленческий.СуммаВознагражденияВал
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ТаблицаУправленческий.СуммаВознаграждения,
	|	&ПрочиеРасходы
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаУправленческий
	|ГДЕ
	|	ТаблицаУправленческий.ЭтоВозврат
	|	И ТаблицаУправленческий.ИспользоватьНовуюСхемуДвиженийВОтчете
	|	И ТаблицаУправленческий.ОтчетКомиссионераУдержатьКомиссионноеВознаграждение
	|	И &ИспользоватьНовуюСхемуДвижений
	|	И НЕ ТаблицаУправленческий.СуммаВознаграждения = 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ru='Курсовая разница'"));
	Запрос.УстановитьПараметр("ЗачетПредоплаты", НСтр("ru = 'Зачет предоплаты'"));
	Запрос.УстановитьПараметр("ОтражениеВыручки", НСтр("ru = 'Выручка от продажи'"));
	Запрос.УстановитьПараметр("ПрочиеРасходы", НСтр("ru = 'Отражение затрат'"));
	Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчета", ПланыСчетов.Управленческий.ПрочиеДоходы);
	Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчета", ПланыСчетов.Управленческий.ПрочиеРасходы);
	Запрос.УстановитьПараметр("ИспользоватьНовуюСхемуДвижений", СтруктураДополнительныеСвойства.ИспользоватьНовуюСхемуДвижений);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		НоваяПроводка = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяПроводка, Выборка);
	КонецЦикла;
	
КонецПроцедуры // СформироватьТаблицаУправленческий()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасы(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	ЭтоОперацияВозврат = Ложь;
	
	Если СтруктураДополнительныеСвойства.ВидОперации = Перечисления.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионера Тогда
		Запрос.Текст = ТекстЗапросаОтчетКомиссионераОПродажахЗапасы();
		
		ТаблицаДокументовОснования = Новый СписокЗначений;
		ТаблицаДокументовОснования.Добавить(ДокументСсылкаОтчетКомиссионера);
		СебестоимостьПоОстаткам = Истина;
		
	Иначе
		Запрос.Текст = ТекстЗапросаОтчетКомиссионераОВозвратахЗапасы();
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаОтчетКомиссионера);
		
		ЗапросОснования = Новый Запрос;
		ЗапросОснования.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		
		ЗапросОснования.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаПокупатели.ОтчетКомиссионера КАК ОтчетКомиссионера
		|ИЗ
		|	ВременнаяТаблицаПокупатели КАК ТаблицаПокупатели
		|ГДЕ
		|	НЕ ТаблицаПокупатели.ОтчетКомиссионера = ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка)
		|	И НЕ ТаблицаПокупатели.ОтчетКомиссионера = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПокупатели.ОтчетКомиссионера";
		
		ЗапросОснования.УстановитьПараметр("Ссылка", ДокументСсылкаОтчетКомиссионера);
		
		ТаблицаДокументовОснования = ЗапросОснования.Выполнить().Выгрузить();
		ЭтоОперацияВозврат = Истина;
		
		СебестоимостьПоОстаткам = ?(ДокументСсылкаОтчетКомиссионера.Покупатели.Найти(Документы.ОтчетКомиссионера.ПустаяСсылка()) = Неопределено, Ложь, Истина);
		
	КонецЕсли;
	
	РезервированиеЗапасов = ПолучитьФункциональнуюОпцию("РезервированиеЗапасов");
	Запрос.УстановитьПараметр("РезервированиеЗапасов", РезервированиеЗапасов);
	
	Запрос.УстановитьПараметр("ОтчетОтКомиссионера", НСтр("ru = 'Отчет комиссионера'"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасы", РезультатЗапроса.Выгрузить());
	
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	// Установка исключительной блокировки контролируемых остатков запасов.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ТаблицаЗапасы.ЗаказПокупателя КАК ЗаказПокупателя
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.ЗаказПокупателя";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Запасы");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	// Получение остатков запасов по стоимости.
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Запасы.Период КАК ДатаОстатка,
	|	Запасы.Регистратор КАК Регистратор,
	|	Запасы.Организация КАК Организация,
	|	Запасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Запасы.СчетУчета КАК СчетУчета,
	|	Запасы.Номенклатура КАК Номенклатура,
	|	Запасы.Характеристика КАК Характеристика,
	|	Запасы.Партия КАК Партия,
	|	Запасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	Запасы.Количество КАК КоличествоОстаток,
	|	Запасы.Сумма КАК СуммаОстаток
	|ПОМЕСТИТЬ ДвиженияПоОснованиям
	|ИЗ
	|	РегистрНакопления.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.ДокументПродажи В(&ТаблицаДокументовОснования)
	|	И ВЫБОР
	|			КОГДА &ЭтоОперацияВозврат
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодКонтроля КАК ДатаОстатка,
	|	ЗапасыОстатки.Организация КАК Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ЗапасыОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	&ТекущийДокумент КАК Регистратор
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗапасыОстатки.Организация КАК Организация,
	|		ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|		ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|		ЗапасыОстатки.Характеристика КАК Характеристика,
	|		ЗапасыОстатки.Партия КАК Партия,
	|		ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|		СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|		СУММА(ЗапасыОстатки.СуммаОстаток) КАК СуммаОстаток
	|	ИЗ
	|		РегистрНакопления.Запасы.Остатки(
	|				&МоментКонтроля,
	|				&СебестоимостьПоОстаткам
	|					И (Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В
	|						(ВЫБРАТЬ
	|							ТаблицаЗапасы.Организация,
	|							ТаблицаЗапасы.СтруктурнаяЕдиница,
	|							ТаблицаЗапасы.СчетУчета,
	|							ТаблицаЗапасы.Номенклатура,
	|							ТаблицаЗапасы.Характеристика,
	|							ТаблицаЗапасы.Партия,
	|							ТаблицаЗапасы.ЗаказПокупателя
	|						ИЗ
	|							ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы)) КАК ЗапасыОстатки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЗапасыОстатки.Организация,
	|		ЗапасыОстатки.СтруктурнаяЕдиница,
	|		ЗапасыОстатки.СчетУчета,
	|		ЗапасыОстатки.Номенклатура,
	|		ЗапасыОстатки.Характеристика,
	|		ЗапасыОстатки.Партия,
	|		ЗапасыОстатки.ЗаказПокупателя
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаЗапасы.Организация,
	|		ДвиженияДокументаЗапасы.СтруктурнаяЕдиница,
	|		ДвиженияДокументаЗапасы.СчетУчета,
	|		ДвиженияДокументаЗапасы.Номенклатура,
	|		ДвиженияДокументаЗапасы.Характеристика,
	|		ДвиженияДокументаЗапасы.Партия,
	|		ДвиженияДокументаЗапасы.ЗаказПокупателя,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗапасы.Сумма, 0)
	|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗапасы.Сумма, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.Запасы КАК ДвиженияДокументаЗапасы
	|	ГДЕ
	|		ДвиженияДокументаЗапасы.Регистратор = &ТекущийДокумент
	|		И ВЫБОР
	|				КОГДА &СебестоимостьПоОстаткам
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ) КАК ЗапасыОстатки
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &СебестоимостьПоОстаткам
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыОстатки.Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета,
	|	ЗапасыОстатки.Номенклатура,
	|	ЗапасыОстатки.Характеристика,
	|	ЗапасыОстатки.Партия,
	|	ЗапасыОстатки.ЗаказПокупателя
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДвиженияПоОснованиям.ДатаОстатка,
	|	ДвиженияПоОснованиям.Организация,
	|	ДвиженияПоОснованиям.СтруктурнаяЕдиница,
	|	ДвиженияПоОснованиям.СчетУчета,
	|	ДвиженияПоОснованиям.Номенклатура,
	|	ДвиженияПоОснованиям.Характеристика,
	|	ДвиженияПоОснованиям.Партия,
	|	ДвиженияПоОснованиям.ЗаказПокупателя,
	|	ДвиженияПоОснованиям.КоличествоОстаток,
	|	ДвиженияПоОснованиям.СуммаОстаток,
	|	ДвиженияПоОснованиям.Регистратор
	|ИЗ
	|	ДвиженияПоОснованиям КАК ДвиженияПоОснованиям";
	
	ПериодКонтроля = СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата;
	Запрос.УстановитьПараметр("ПериодКонтроля", ПериодКонтроля);
	Запрос.УстановитьПараметр("ТаблицаДокументовОснования", ТаблицаДокументовОснования);
	Запрос.УстановитьПараметр("СебестоимостьПоОстаткам", СебестоимостьПоОстаткам);
	Запрос.УстановитьПараметр("ЭтоОперацияВозврат", ЭтоОперацияВозврат);
	Запрос.УстановитьПараметр("ТекущийДокумент", ДокументСсылкаОтчетКомиссионера);
	Запрос.УстановитьПараметр("МоментКонтроля", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаЗапасыОстатки = РезультатЗапроса.Выгрузить();
	ТаблицаЗапасыОстатки.Индексы.Добавить("Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя, Регистратор");
	
	ВременнаяТаблицаЗапасы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.СкопироватьКолонки();
	
	Если СтруктураДополнительныеСвойства.ИспользоватьНовуюСхемуДвижений Тогда
		ЗначениеКолонкиСтруктурнаяЕдиница = ВременнаяТаблицаЗапасы.ВыгрузитьКолонку("СтруктурнаяЕдиница");
		ВременнаяТаблицаЗапасы.Колонки.Удалить("СтруктурнаяЕдиница");
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("Null"));
		МассивТипов.Добавить(Тип("СправочникСсылка.Контрагенты"));
		МассивТипов.Добавить(Тип("СправочникСсылка.СтруктурныеЕдиницы"));
		ОписаниеТиповКолонки = Новый ОписаниеТипов(МассивТипов);
		
		НоваяКолонка = ВременнаяТаблицаЗапасы.Колонки.Добавить("СтруктурнаяЕдиница", ОписаниеТиповКолонки);
		
		ВременнаяТаблицаЗапасы.ЗагрузитьКолонку(ЗначениеКолонкиСтруктурнаяЕдиница, "СтруктурнаяЕдиница");
	КонецЕсли;

	Для н = 0 По СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.Количество() - 1 Цикл
		
		СтрокаТаблицаЗапасы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы[н];
		
		СтруктураДляПоиска = Новый Структура;
		СтруктураДляПоиска.Вставить("Регистратор", СтрокаТаблицаЗапасы.Документ);
		СтруктураДляПоиска.Вставить("Организация", СтрокаТаблицаЗапасы.Организация);
		СтруктураДляПоиска.Вставить("СтруктурнаяЕдиница", СтрокаТаблицаЗапасы.СтруктурнаяЕдиница);
		СтруктураДляПоиска.Вставить("СчетУчета", СтрокаТаблицаЗапасы.СчетУчета);
		СтруктураДляПоиска.Вставить("Номенклатура", СтрокаТаблицаЗапасы.Номенклатура);
		СтруктураДляПоиска.Вставить("Характеристика", СтрокаТаблицаЗапасы.Характеристика);
		СтруктураДляПоиска.Вставить("Партия", СтрокаТаблицаЗапасы.Партия);
		СтруктураДляПоиска.Вставить("ЗаказПокупателя", СтрокаТаблицаЗапасы.ЗаказПокупателя);
		
		КоличествоТребуется = ?(ЭтоОперацияВозврат, -СтрокаТаблицаЗапасы.Количество, СтрокаТаблицаЗапасы.Количество);
		
		Если КоличествоТребуется > 0  Тогда
			
			МесяцПродажиИВозвратаСовпадает = Истина;
			
			Если ЭтоОперацияВозврат И СтрокаТаблицаЗапасы.РучнаяСебестоимость > 0 Тогда
				
				// Себестоимость указана явно в документе
				СуммаКСписанию = СтрокаТаблицаЗапасы.РучнаяСебестоимость;
				
			Иначе
				
				МассивСтрокОстатков = ТаблицаЗапасыОстатки.НайтиСтроки(СтруктураДляПоиска);
				
				КоличествоОстаток = 0;
				СуммаОстаток = 0;
				
				Если МассивСтрокОстатков.Количество() > 0 Тогда
					КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток;
					СуммаОстаток = МассивСтрокОстатков[0].СуммаОстаток;
				КонецЕсли;
				
				Если ЭтоОперацияВозврат И МассивСтрокОстатков.Количество() > 0 Тогда
					МесяцПродажиИВозвратаСовпадает = (НачалоМесяца(ПериодКонтроля) = НачалоМесяца(МассивСтрокОстатков[0].ДатаОстатка));
				КонецЕсли; 
				
				Если КоличествоОстаток > 0 И КоличествоОстаток > КоличествоТребуется Тогда
					
					СуммаКСписанию = Окр(СуммаОстаток * КоличествоТребуется / КоличествоОстаток , 2, 1);
					
					МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоТребуется;
					МассивСтрокОстатков[0].СуммаОстаток = МассивСтрокОстатков[0].СуммаОстаток - СуммаКСписанию;
					
				ИначеЕсли КоличествоОстаток = КоличествоТребуется Тогда
					
					СуммаКСписанию = СуммаОстаток;
					
					МассивСтрокОстатков[0].КоличествоОстаток = 0;
					МассивСтрокОстатков[0].СуммаОстаток = 0;
					
				Иначе
					СуммаКСписанию = 0;
				КонецЕсли;
				
			КонецЕсли;
			
			// Добавим строку по заказу.
			СтрокаТаблицыРасход = ВременнаяТаблицаЗапасы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасход, СтрокаТаблицаЗапасы);
			
			СтрокаТаблицыРасход.Сумма = ?(ЭтоОперацияВозврат, -СуммаКСписанию, СуммаКСписанию);
			СтрокаТаблицыРасход.Количество = ?(ЭтоОперацияВозврат, -КоличествоТребуется, КоличествоТребуется);
			
			Если ЭтоОперацияВозврат И НЕ МесяцПродажиИВозвратаСовпадает Тогда
				СтрокаТаблицыРасход.ФиксированнаяСтоимость = Истина;
			КонецЕсли; 
			
			Если Окр(СуммаКСписанию, 2, 1) <> 0 Тогда
				
				// Сформируем проводки.
				СтрокаТаблицаУправленческий = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицаУправленческий, СтрокаТаблицаЗапасы);
				СтрокаТаблицаУправленческий.Содержание = ?(ЭтоОперацияВозврат, НСтр("ru = 'Сторнирование себестоимости'"), НСтр("ru='Себестоимость продажи'"));
				СтрокаТаблицаУправленческий.Сумма = ?(ЭтоОперацияВозврат, -СуммаКСписанию, СуммаКСписанию);
				
				Если НЕ СтруктураДополнительныеСвойства.ИспользоватьНовуюСхемуДвижений И СтрокаТаблицаЗапасы.УдержатьКомиссионноеВознаграждение Тогда
					
					СтрокаТаблицаУправленческий = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТаблицаУправленческий, СтрокаТаблицаЗапасы);
					СтрокаТаблицаУправленческий.СчетКт = ПланыСчетов.Управленческий.РасчетыСПокупателями;
					СтрокаТаблицаУправленческий.Содержание = ?(ЭтоОперацияВозврат, НСтр("ru = 'Сторнирование комиссионное вознаграждение'"), НСтр("ru='Комиссионное вознаграждение'"));
					СтрокаТаблицаУправленческий.Сумма = СтрокаТаблицаЗапасы.СуммаВознаграждения;
					СтрокаТаблицаУправленческий.СуммаВалКт = СтрокаТаблицаЗапасы.СуммаВознаграждения;
					СтрокаТаблицаУправленческий.ВалютаКт = ДокументСсылкаОтчетКомиссионера.Договор.ВалютаРасчетов;
					
				КонецЕсли;
				
				// Продвигаем себестоимость продаж.
				СтрокаТаблицаПродажи = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПродажи.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицаПродажи, СтрокаТаблицаЗапасы);
				
				СтрокаТаблицаПродажи.Количество = 0;
				СтрокаТаблицаПродажи.Сумма = 0;
				СтрокаТаблицаПродажи.СуммаНДС = 0;
				СтрокаТаблицаПродажи.Себестоимость = ?(ЭтоОперацияВозврат, -СуммаКСписанию, СуммаКСписанию);
				
				Если СтрокаТаблицаЗапасы.УдержатьКомиссионноеВознаграждение Тогда
					
					// Нужно увеличить себестоимость продажи на сумму вознаграждения.
					НоваяСтрока	= СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПродажи.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицаЗапасы);
					
					НоваяСтрока.Количество		= 0;
					НоваяСтрока.Сумма			= 0;
					НоваяСтрока.СуммаНДС		= 0;
					НоваяСтрока.Себестоимость	= СтрокаТаблицаЗапасы.СуммаВознаграждения;
					
				КонецЕсли;
				
				// Продвигаем доходы и расходы.
				СтрокаДоходыИРасходы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДоходыИРасходы, СтрокаТаблицаЗапасы);
				
				СтрокаДоходыИРасходы.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.ПодразделениеПродажи;
				СтрокаДоходыИРасходы.СчетУчета = СтрокаТаблицаЗапасы.СчетУчетаСебестоимость;
				СтрокаДоходыИРасходы.СуммаДоходов = 0;
				СтрокаДоходыИРасходы.СуммаРасходов = ?(ЭтоОперацияВозврат, -СуммаКСписанию, СуммаКСписанию);
				СтрокаДоходыИРасходы.Сумма = ?(ЭтоОперацияВозврат, -СуммаКСписанию, СуммаКСписанию);
				СтрокаДоходыИРасходы.СодержаниеПроводки = ?(ЭтоОперацияВозврат, НСтр("ru = 'Сторнирование расходов'"), НСтр("ru='Отражение расходов'"));
				
				Если ЗначениеЗаполнено(ДокументСсылкаОтчетКомиссионера.Проект) Тогда
					СтрокаДоходыИРасходы.Проект = ДокументСсылкаОтчетКомиссионера.Проект;
				КонецЕсли;
				
				Если СтрокаТаблицаЗапасы.УдержатьКомиссионноеВознаграждение Тогда
					
					// Нужно увеличить себестоимость продажи на сумму вознаграждения.
					НоваяСтрока= СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицаЗапасы);
					
					НоваяСтрока.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.ПодразделениеПродажи;
					НоваяСтрока.СчетУчета = СтрокаТаблицаЗапасы.СчетУчетаСебестоимость;
					НоваяСтрока.СуммаДоходов = 0;
					НоваяСтрока.СуммаРасходов = СтрокаТаблицаЗапасы.СуммаВознаграждения;
					НоваяСтрока.Сумма = СтрокаТаблицаЗапасы.СуммаВознаграждения;
					НоваяСтрока.СодержаниеПроводки = ?(ЭтоОперацияВозврат, НСтр("ru = 'Сторнирование расходов'"), НСтр("ru='Отражение расходов'"));
					
					Если ЗначениеЗаполнено(ДокументСсылкаОтчетКомиссионера.Проект) Тогда
						СтрокаДоходыИРасходы.Проект = ДокументСсылкаОтчетКомиссионера.Проект;
					КонецЕсли;
				
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы = ВременнаяТаблицаЗапасы;
	
	Если СтруктураДополнительныеСвойства.ИспользоватьНовуюСхемуДвижений Тогда
		СформироватьТаблицаЗапасыРасходы(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства);
	КонецЕсли;
	
КонецПроцедуры // СформироватьТаблицаЗапасы()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыРасходы(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗапасы.НомерСтроки КАК НомерСтроки,
	|	ТаблицаЗапасы.ВидДвижения КАК ВидДвижения,
	|	ТаблицаЗапасы.ВидОперации КАК ВидОперации,
	|	ТаблицаЗапасы.ТипСчета КАК ТипСчета,
	|	ТаблицаЗапасы.ВключатьРасходыВСебестоимость КАК ВключатьРасходыВСебестоимость,
	|	ТаблицаЗапасы.Период КАК Период,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ТаблицаЗапасы.ЗаказПоставщику КАК ИсточникОбеспечения,
	|	ВЫБОР
	|		КОГДА ФункциональнаяОпцияРезервированиеЗапасов.Значение
	|			ТОГДА ТаблицаЗапасы.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК ЗаказПокупателя,
	|	ТаблицаЗапасы.Заказ КАК ЗаказРазмещения,
	|	ТаблицаЗапасы.Количество КАК Количество,
	|	ТаблицаЗапасы.Сумма КАК Сумма,
	|	ИСТИНА КАК ФиксированнаяСтоимость,
	|	&ПрочиеРасходы КАК СодержаниеПроводки,
	|	ВЫБОР
	|		КОГДА ФункциональнаяОпцияРезервированиеЗапасов.Значение
	|				И ТИПЗНАЧЕНИЯ(ТаблицаЗапасы.Заказ) = ТИП(Документ.ЗаказПокупателя)
	|				И ТаблицаЗапасы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Порядок
	|ИЗ
	|	ВременнаяТаблицаРасходы КАК ТаблицаЗапасы,
	|	Константа.ФункциональнаяОпцияРезервированиеЗапасов КАК ФункциональнаяОпцияРезервированиеЗапасов
	|ГДЕ
	|	ТаблицаЗапасы.Сумма > 0
	|	И НЕ ТаблицаЗапасы.УдержатьКомиссионноеВознаграждение
	|	И НЕ ТаблицаЗапасы.ЭтоВозврат
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.ЗаказПоставщику,
	|	ТаблицаЗапасы.Заказ,
	|	ВЫБОР
	|		КОГДА ФункциональнаяОпцияРезервированиеЗапасов.Значение
	|			ТОГДА ТаблицаЗапасы.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаЗапасы.ВидДвижения,
	|	ТаблицаЗапасы.ВидОперации,
	|	ТаблицаЗапасы.ТипСчета,
	|	ТаблицаЗапасы.ВключатьРасходыВСебестоимость,
	|	ВЫБОР
	|		КОГДА ФункциональнаяОпцияРезервированиеЗапасов.Значение
	|				И ТИПЗНАЧЕНИЯ(ТаблицаЗапасы.Заказ) = ТИП(Документ.ЗаказПокупателя)
	|				И ТаблицаЗапасы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ,
	|	ТаблицаЗапасы.НомерСтроки,
	|	ТаблицаЗапасы.Количество,
	|	ТаблицаЗапасы.Сумма
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаЗапасы.НомерСтроки,
	|	ТаблицаЗапасы.ВидДвижения,
	|	ТаблицаЗапасы.ВидОперации,
	|	ТаблицаЗапасы.ТипСчета,
	|	ТаблицаЗапасы.ВключатьРасходыВСебестоимость,
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.ЗаказПоставщику,
	|	ВЫБОР
	|		КОГДА ФункциональнаяОпцияРезервированиеЗапасов.Значение
	|			ТОГДА ТаблицаЗапасы.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаЗапасы.Заказ,
	|	-ТаблицаЗапасы.Количество,
	|	ТаблицаЗапасы.Сумма,
	|	ИСТИНА,
	|	&ПрочиеРасходы,
	|	ВЫБОР
	|		КОГДА ФункциональнаяОпцияРезервированиеЗапасов.Значение
	|				И ТИПЗНАЧЕНИЯ(ТаблицаЗапасы.Заказ) = ТИП(Документ.ЗаказПокупателя)
	|				И ТаблицаЗапасы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ
	|ИЗ
	|	ВременнаяТаблицаРасходы КАК ТаблицаЗапасы,
	|	Константа.ФункциональнаяОпцияРезервированиеЗапасов КАК ФункциональнаяОпцияРезервированиеЗапасов
	|ГДЕ
	|	ТаблицаЗапасы.Сумма > 0
	|	И НЕ ТаблицаЗапасы.ОтчетКомиссионераУдержатьКомиссионноеВознаграждение
	|	И ТаблицаЗапасы.ЭтоВозврат
	|	И ТаблицаЗапасы.ИспользоватьНовуюСхемуДвижений
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.ЗаказПоставщику,
	|	ТаблицаЗапасы.Заказ,
	|	ВЫБОР
	|		КОГДА ФункциональнаяОпцияРезервированиеЗапасов.Значение
	|			ТОГДА ТаблицаЗапасы.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаЗапасы.ВидДвижения,
	|	ТаблицаЗапасы.ВидОперации,
	|	ТаблицаЗапасы.ТипСчета,
	|	ТаблицаЗапасы.ВключатьРасходыВСебестоимость,
	|	ВЫБОР
	|		КОГДА ФункциональнаяОпцияРезервированиеЗапасов.Значение
	|				И ТИПЗНАЧЕНИЯ(ТаблицаЗапасы.Заказ) = ТИП(Документ.ЗаказПокупателя)
	|				И ТаблицаЗапасы.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ,
	|	ТаблицаЗапасы.НомерСтроки,
	|	-ТаблицаЗапасы.Количество,
	|	ТаблицаЗапасы.Сумма
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("ПрочиеРасходы", НСтр("ru = 'Отражение затрат'"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ТипСчета <> Перечисления.ТипыСчетов.НезавершенноеПроизводство
			И Выборка.ТипСчета <> Перечисления.ТипыСчетов.КосвенныеЗатраты Тогда
			Продолжить
		КонецЕсли;
		ДобавитьСтрокиЗапасыПоРазмещению(СтруктураДополнительныеСвойства, СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы, Выборка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСтрокиЗапасыПоРазмещению(СтруктураДополнительныеСвойства, ТаблицаЗапасы, ИсточникЗаполнения)
	
	СтрокаТаблицаЗапасы = ТаблицаЗапасы.Добавить();
	СтрокаТаблицаЗапасы.СтруктурнаяЕдиница = ИсточникЗаполнения.СтруктурнаяЕдиница;
	ЗаполнитьЗначенияСвойств(СтрокаТаблицаЗапасы, ИсточникЗаполнения);
	
	СтрокаТаблицаЗапасы.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	СтрокаТаблицаЗапасы.Количество = 0;

КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПродажи(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Если СтруктураДополнительныеСвойства.ВидОперации = Перечисления.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионера Тогда
		Запрос.Текст = ТекстЗапросаОтчетКомиссионераОПродажах();
	Иначе
		Запрос.Текст = ТекстЗапросаОтчетКомиссионераОВозвратах();
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаОтчетКомиссионера);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПродажи", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаПродажи()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗакупки(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидОперации", СтруктураДополнительныеСвойства.ВидОперации);
	Запрос.УстановитьПараметр("ИспользоватьНовуюСхемуДвижений", СтруктураДополнительныеСвойства.ИспользоватьНовуюСхемуДвижений);
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗакупки.Период КАК Период,
	|	ТаблицаЗакупки.Организация КАК Организация,
	|	ТаблицаЗакупки.УслугаКомиссионногоВознаграждения КАК Номенклатура,
	|	НЕОПРЕДЕЛЕНО КАК Характеристика,
	|	НЕОПРЕДЕЛЕНО КАК Партия,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка) КАК ЗаказПоставщику,
	|	ТаблицаЗакупки.Документ КАК Документ,
	|	ТаблицаЗакупки.СтавкаНДСВознаграждения КАК СтавкаНДС,
	|	1 КАК Количество,
	|	СУММА(ТаблицаЗакупки.СуммаНДСВознагражденияДляУслуги) КАК СуммаНДС,
	|	СУММА(ТаблицаЗакупки.СуммаВознаграждения) КАК Сумма,
	|	ТаблицаЗакупки.ИспользоватьНовуюСхемуДвиженийВОтчете КАК ИспользоватьНовуюСхемуДвиженийВОтчете
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗакупки
	|ГДЕ
	|	&ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионера)
	|	И &ИспользоватьНовуюСхемуДвижений
	|	И НЕ ТаблицаЗакупки.СуммаВознаграждения = 0
	|	И НЕ ТаблицаЗакупки.УдержатьКомиссионноеВознаграждение
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗакупки.Период,
	|	ТаблицаЗакупки.Организация,
	|	ТаблицаЗакупки.УслугаКомиссионногоВознаграждения,
	|	ТаблицаЗакупки.Документ,
	|	ТаблицаЗакупки.СтавкаНДСВознаграждения,
	|	ТаблицаЗакупки.ИспользоватьНовуюСхемуДвиженийВОтчете
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаЗакупки.Период,
	|	ТаблицаЗакупки.Организация,
	|	ТаблицаЗакупки.УслугаКомиссионногоВознаграждения,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка),
	|	ТаблицаЗакупки.ОтчетКомиссионера,
	|	ТаблицаЗакупки.СтавкаНДСВознаграждения,
	|	-1,
	|	СУММА(ТаблицаЗакупки.СуммаНДСВознагражденияДляУслуги),
	|	СУММА(ТаблицаЗакупки.СуммаВознаграждения),
	|	ТаблицаЗакупки.ИспользоватьНовуюСхемуДвиженийВОтчете
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗакупки
	|ГДЕ
	|	&ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах)
	|	И ТаблицаЗакупки.ИспользоватьНовуюСхемуДвиженийВОтчете
	|	И НЕ ТаблицаЗакупки.СуммаВознаграждения = 0
	|	И НЕ ТаблицаЗакупки.ОтчетКомиссионераУдержатьКомиссионноеВознаграждение
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗакупки.Период,
	|	ТаблицаЗакупки.Организация,
	|	ТаблицаЗакупки.УслугаКомиссионногоВознаграждения,
	|	ТаблицаЗакупки.ОтчетКомиссионера,
	|	ТаблицаЗакупки.СтавкаНДСВознаграждения,
	|	ТаблицаЗакупки.ИспользоватьНовуюСхемуДвиженийВОтчете";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗакупки", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЗакупки()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыПереданные(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасыПереданные.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗапасыПереданные.Период КАК Период,
	|	ТаблицаЗапасыПереданные.Организация КАК Организация,
	|	ТаблицаЗапасыПереданные.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасыПереданные.Характеристика КАК Характеристика,
	|	ТаблицаЗапасыПереданные.Контрагент КАК Контрагент,
	|	ТаблицаЗапасыПереданные.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасыПереданные.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА ТаблицаЗапасыПереданные.ЗаказПокупателя
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Заказ,
	|	ТаблицаЗапасыПереданные.Партия КАК Партия,
	|	ТаблицаЗапасыПереданные.ТипПриемаПередачи КАК ТипПриемаПередачи,
	|	СУММА(ТаблицаЗапасыПереданные.Количество) КАК Количество,
	|	СУММА(ТаблицаЗапасыПереданные.СуммаРасчетовПринятыеПереданные) КАК СуммаРасчетов
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасыПереданные
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасыПереданные.Период,
	|	ТаблицаЗапасыПереданные.Организация,
	|	ТаблицаЗапасыПереданные.Номенклатура,
	|	ТаблицаЗапасыПереданные.Характеристика,
	|	ТаблицаЗапасыПереданные.Партия,
	|	ТаблицаЗапасыПереданные.Контрагент,
	|	ТаблицаЗапасыПереданные.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасыПереданные.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА ТаблицаЗапасыПереданные.ЗаказПокупателя
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаЗапасыПереданные.ТипПриемаПередачи";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыПереданные", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЗапасыПереданные()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходы(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	МАКСИМУМ(ТаблицаДоходыИРасходы.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаДоходыИРасходы.Период КАК Период,
	|	ТаблицаДоходыИРасходы.Организация КАК Организация,
	|	ТаблицаДоходыИРасходы.ПодразделениеПродажи КАК СтруктурнаяЕдиница,
	|	ТаблицаДоходыИРасходы.Проект КАК Проект,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи КАК НаправлениеДеятельности,
	|	ТаблицаДоходыИРасходы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаДоходыИРасходы.СчетУчетаПродажи КАК СчетУчета,
	|	НЕОПРЕДЕЛЕНО КАК Аналитика,
	|	ВЫРАЗИТЬ(&ОтражениеДоходов КАК СТРОКА(100)) КАК СодержаниеПроводки,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаДоходыИРасходы.УдержатьКомиссионноеВознаграждение
	|				ТОГДА ТаблицаДоходыИРасходы.Сумма - ТаблицаДоходыИРасходы.СуммаВознаграждения
	|			ИНАЧЕ ТаблицаДоходыИРасходы.Сумма
	|		КОНЕЦ) КАК СуммаДоходов,
	|	0 КАК СуммаРасходов,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаДоходыИРасходы.УдержатьКомиссионноеВознаграждение
	|				ТОГДА ТаблицаДоходыИРасходы.Сумма - ТаблицаДоходыИРасходы.СуммаВознаграждения
	|			ИНАЧЕ ТаблицаДоходыИРасходы.Сумма
	|		КОНЕЦ) КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДоходыИРасходы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.ПодразделениеПродажи,
	|	ТаблицаДоходыИРасходы.Проект,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ТаблицаДоходыИРасходы.ЗаказПокупателя,
	|	ТаблицаДоходыИРасходы.СчетУчетаПродажи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	1,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПоложительнаяКурсоваяРазницаСчетУчета
	|		ИНАЧЕ &ОтрицательнаяКурсоваяРазницаСчетУчета
	|	КОНЕЦ,
	|	ТаблицаДокумента.Валюта,
	|	ВЫРАЗИТЬ(&КурсоваяРазница КАК СТРОКА(100)),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.Дата КАК Дата,
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.Организация КАК Организация,
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.Валюта КАК Валюта,
	|		СУММА(ТаблицаКурсовыхРазницРасчетыСПокупателями.СуммаКурсовойРазницы) КАК СуммаКурсовойРазницы
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ТаблицаДокумента.Дата КАК Дата,
	|			ТаблицаДокумента.Организация КАК Организация,
	|			ТаблицаДокумента.Валюта КАК Валюта,
	|			ТаблицаДокумента.СуммаКурсовойРазницы КАК СуммаКурсовойРазницы
	|		ИЗ
	|			ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями КАК ТаблицаДокумента
	|		ГДЕ
	|			ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ТаблицаДокумента.Дата,
	|			ТаблицаДокумента.Организация,
	|			ТаблицаДокумента.Валюта,
	|			ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИЗ
	|			ВременнаяТаблицаКурсовыхРазницРасчетыСПокупателями КАК ТаблицаДокумента
	|		ГДЕ
	|			ТаблицаДокумента.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)) КАК ТаблицаКурсовыхРазницРасчетыСПокупателями
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.Дата,
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.Организация,
	|		ТаблицаКурсовыхРазницРасчетыСПокупателями.Валюта
	|	
	|	ИМЕЮЩИЕ
	|		(СУММА(ТаблицаКурсовыхРазницРасчетыСПокупателями.СуммаКурсовойРазницы) >= 0.005
	|			ИЛИ СУММА(ТаблицаКурсовыхРазницРасчетыСПокупателями.СуммаКурсовойРазницы) <= -0.005)) КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	1,
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.ПодразделениеПродажи,
	|	ТаблицаДоходыИРасходы.Проект,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	НЕОПРЕДЕЛЕНО,
	|	ТаблицаДоходыИРасходы.СчетУчетаЗатрат,
	|	ТаблицаДоходыИРасходы.УслугаКомиссионногоВознаграждения,
	|	ВЫРАЗИТЬ(&ПрочиеРасходы КАК СТРОКА(100)),
	|	0,
	|	СУММА(ТаблицаДоходыИРасходы.СуммаВознаграждения),
	|	СУММА(ТаблицаДоходыИРасходы.СуммаВознаграждения)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДоходыИРасходы
	|ГДЕ
	|	(ТаблицаДоходыИРасходы.СчетУчетаЗатратТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|			ИЛИ ТаблицаДоходыИРасходы.СчетУчетаЗатратТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы))
	|	И НЕ ТаблицаДоходыИРасходы.УдержатьКомиссионноеВознаграждение
	|	И &ИспользоватьНовуюСхемуДвижений
	|	И НЕ ТаблицаДоходыИРасходы.ЭтоВозврат
	|	И НЕ ТаблицаДоходыИРасходы.СуммаВознаграждения = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.ПодразделениеПродажи,
	|	ТаблицаДоходыИРасходы.Проект,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ТаблицаДоходыИРасходы.СчетУчетаЗатрат,
	|	ТаблицаДоходыИРасходы.УслугаКомиссионногоВознаграждения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	1,
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.ПодразделениеПродажи,
	|	ТаблицаДоходыИРасходы.Проект,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	НЕОПРЕДЕЛЕНО,
	|	ТаблицаДоходыИРасходы.СчетУчетаЗатрат,
	|	ТаблицаДоходыИРасходы.УслугаКомиссионногоВознаграждения,
	|	ВЫРАЗИТЬ(&ПрочиеРасходы КАК СТРОКА(100)),
	|	0,
	|	СУММА(ТаблицаДоходыИРасходы.СуммаВознаграждения),
	|	СУММА(ТаблицаДоходыИРасходы.СуммаВознаграждения)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДоходыИРасходы
	|ГДЕ
	|	(ТаблицаДоходыИРасходы.СчетУчетаЗатратТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|			ИЛИ ТаблицаДоходыИРасходы.СчетУчетаЗатратТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы))
	|	И ТаблицаДоходыИРасходы.ИспользоватьНовуюСхемуДвиженийВОтчете
	|	И НЕ ТаблицаДоходыИРасходы.ОтчетКомиссионераУдержатьКомиссионноеВознаграждение
	|	И &ИспользоватьНовуюСхемуДвижений
	|	И ТаблицаДоходыИРасходы.ЭтоВозврат
	|	И НЕ ТаблицаДоходыИРасходы.СуммаВознаграждения = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДоходыИРасходы.Период,
	|	ТаблицаДоходыИРасходы.Организация,
	|	ТаблицаДоходыИРасходы.ПодразделениеПродажи,
	|	ТаблицаДоходыИРасходы.Проект,
	|	ТаблицаДоходыИРасходы.НаправлениеДеятельностиПродажи,
	|	ТаблицаДоходыИРасходы.СчетУчетаЗатрат,
	|	ТаблицаДоходыИРасходы.УслугаКомиссионногоВознаграждения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	ЭтоОперацияВозврат = ?(СтруктураДополнительныеСвойства.ВидОперации = Перечисления.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах, Истина, Ложь);
	
	Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчета", ПланыСчетов.Управленческий.ПрочиеДоходы);
	Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчета", ПланыСчетов.Управленческий.ПрочиеРасходы);
	Запрос.УстановитьПараметр("ОтражениеДоходов", ?(ЭтоОперацияВозврат, НСтр("ru = 'Сторнирование доходов'"), НСтр("ru='Отражение доходов'")));
	Запрос.УстановитьПараметр("ПрочиеРасходы", НСтр("ru = 'Отражение затрат'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", ?(ЭтоОперацияВозврат, НСтр("ru = 'Сторнирование курсовой разницы'"), НСтр("ru='Курсовая разница'")));
	Запрос.УстановитьПараметр("ИспользоватьНовуюСхемуДвижений", СтруктураДополнительныеСвойства.ИспользоватьНовуюСхемуДвижений);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходы()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыСПокупателями(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства)
	
	ВидОперацииВозврат = СтруктураДополнительныеСвойства.ВидОперации = Перечисления.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаОтчетКомиссионера);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ВозникновениеОбязательствПокупателя", ?(ВидОперацииВозврат, НСтр("ru='Сторнирование обязательств покупателя'"), НСтр("ru='Возникновение обязательств покупателя'")));
	Запрос.УстановитьПараметр("ЗачетАванса", НСтр("ru='Зачет предоплаты'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ru='Курсовая разница'"));
	Запрос.УстановитьПараметр("УчетВалютныхОпераций", СтруктураДополнительныеСвойства.УчетВалютныхОпераций);
	Запрос.УстановитьПараметр("ИспользоватьНовуюСхемуДвижений", СтруктураДополнительныеСвойства.ИспользоватьНовуюСхемуДвижений);
	
	Если Не ВидОперацииВозврат Тогда
		Запрос.Текст = ТекстЗапросаОтчетКомиссионераОПродажахРасчетыСПокупателями();
	Иначе
		Запрос.Текст = ТекстЗапросаОтчетКомиссионераОВозвратахРасчетыСПокупателями();
	КонецЕсли;
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с контрагентами.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасчетыСПокупателями.Организация КАК Организация,
	|	ВременнаяТаблицаРасчетыСПокупателями.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасчетыСПокупателями.Договор КАК Договор,
	|	ВременнаяТаблицаРасчетыСПокупателями.Документ КАК Документ,
	|	ВременнаяТаблицаРасчетыСПокупателями.Заказ КАК Заказ,
	|	ВременнаяТаблицаРасчетыСПокупателями.ТипРасчетов КАК ТипРасчетов
	|ИЗ
	|	ВременнаяТаблицаРасчетыСПокупателями";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПокупателями");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	Если Не ВидОперацииВозврат Тогда
		РасчетыПроведениеДокументов.ПодготовитьТаблицуВзаиморасчетовСУчетомАвансов(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства, Ложь);
	КонецЕсли;
	
	НомерЗапроса = 0;
	Запрос.Текст = КурсовыеРазницыУНФ.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателями(Запрос.МенеджерВременныхТаблиц, Истина, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПокупателями", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаРасчетыСПокупателями()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыСПоставщиками(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаОтчетКомиссионера);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ВозникновениеОбязательствПередПоставщиком", НСтр("ru = 'Возникновение обязательств перед поставщиком'"));
	Запрос.УстановитьПараметр("ЗачетАванса", НСтр("ru='Зачет предоплаты'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ru='Курсовая разница'"));
	Запрос.УстановитьПараметр("УчетВалютныхОпераций", СтруктураДополнительныеСвойства.УчетВалютныхОпераций);
	Запрос.УстановитьПараметр("ИспользоватьНовуюСхемуДвижений", СтруктураДополнительныеСвойства.ИспользоватьНовуюСхемуДвижений);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаДокумента.Период КАК Дата,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком КАК СчетУчета,
	|	ТаблицаДокумента.ДоговорДоговорУслугиКомиссионногоВознаграждения КАК Договор,
	|	ТаблицаДокумента.ЭтоВозврат КАК ЭтоВозврат,
	|	ТаблицаДокумента.ИспользоватьНовуюСхемуДвиженийВОтчете КАК ИспользоватьНовуюСхемуДвиженийВОтчете,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка) КАК Заказ,
	|	ТаблицаДокумента.ВалютаРасчетов КАК Валюта,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг) КАК ТипРасчетов,
	|	СУММА(ТаблицаДокумента.СуммаВознаграждения) КАК Сумма,
	|	СУММА(ТаблицаДокумента.СуммаВознагражденияВал) КАК СуммаВал,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ &УчетВалютныхОпераций
	|				ТОГДА 0
	|			ИНАЧЕ ТаблицаДокумента.СуммаВознагражденияРег
	|		КОНЕЦ) КАК СуммаРег,
	|	СУММА(ТаблицаДокумента.СуммаВознаграждения) КАК СуммаДляОстатка,
	|	СУММА(ТаблицаДокумента.СуммаВознагражденияВал) КАК СуммаВалДляОстатка,
	|	ВЫРАЗИТЬ(&ВозникновениеОбязательствПередПоставщиком КАК СТРОКА(100)) КАК СодержаниеПроводки
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПоставщиками
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|ГДЕ
	|	НЕ ТаблицаДокумента.СуммаВознаграждения = 0
	|	И НЕ ТаблицаДокумента.ЭтоВозврат
	|	И &ИспользоватьНовуюСхемуДвижений
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.ДоговорДоговорУслугиКомиссионногоВознаграждения,
	|	ТаблицаДокумента.ЭтоВозврат,
	|	ТаблицаДокумента.ИспользоватьНовуюСхемуДвиженийВОтчете,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.ДоговорДоговорУслугиКомиссионногоВознаграждения,
	|	ТаблицаДокумента.ЭтоВозврат,
	|	ТаблицаДокумента.ИспользоватьНовуюСхемуДвиженийВОтчете,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.ОтчетКомиссионера
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка),
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
	|	СУММА(ТаблицаДокумента.СуммаВознаграждения),
	|	СУММА(ТаблицаДокумента.СуммаВознагражденияВал),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ &УчетВалютныхОпераций
	|				ТОГДА 0
	|			ИНАЧЕ ТаблицаДокумента.СуммаВознагражденияРег
	|		КОНЕЦ),
	|	СУММА(ТаблицаДокумента.СуммаВознаграждения),
	|	СУММА(ТаблицаДокумента.СуммаВознагражденияВал),
	|	ВЫРАЗИТЬ(&ВозникновениеОбязательствПередПоставщиком КАК СТРОКА(100))
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|ГДЕ
	|	НЕ ТаблицаДокумента.СуммаВознаграждения = 0
	|	И ТаблицаДокумента.ИспользоватьНовуюСхемуДвиженийВОтчете
	|	И ТаблицаДокумента.ЭтоВозврат
	|	И &ИспользоватьНовуюСхемуДвижений
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.ДоговорДоговорУслугиКомиссионногоВознаграждения,
	|	ТаблицаДокумента.ЭтоВозврат,
	|	ТаблицаДокумента.ИспользоватьНовуюСхемуДвиженийВОтчете,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.ОтчетКомиссионера
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.ДоговорДоговорУслугиКомиссионногоВознаграждения,
	|	ТаблицаДокумента.ЭтоВозврат,
	|	ТаблицаДокумента.ИспользоватьНовуюСхемуДвиженийВОтчете,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка),
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
	|	СУММА(ТаблицаДокумента.СуммаВознаграждения),
	|	СУММА(ТаблицаДокумента.СуммаВознагражденияВал),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ &УчетВалютныхОпераций
	|				ТОГДА 0
	|			ИНАЧЕ ТаблицаДокумента.СуммаВознагражденияРег
	|		КОНЕЦ),
	|	СУММА(ТаблицаДокумента.СуммаВознаграждения),
	|	СУММА(ТаблицаДокумента.СуммаВознагражденияВал),
	|	ВЫРАЗИТЬ(&ВозникновениеОбязательствПередПоставщиком КАК СТРОКА(100))
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|ГДЕ
	|	НЕ ТаблицаДокумента.СуммаВознаграждения = 0
	|	И ТаблицаДокумента.УдержатьКомиссионноеВознаграждение
	|	И НЕ ТаблицаДокумента.ЭтоВозврат
	|	И &ИспользоватьНовуюСхемуДвижений
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.ДоговорДоговорУслугиКомиссионногоВознаграждения,
	|	ТаблицаДокумента.ЭтоВозврат,
	|	ТаблицаДокумента.ИспользоватьНовуюСхемуДвиженийВОтчете,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.ДоговорДоговорУслугиКомиссионногоВознаграждения,
	|	ТаблицаДокумента.ЭтоВозврат,
	|	ТаблицаДокумента.ИспользоватьНовуюСхемуДвиженийВОтчете,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.ОтчетКомиссионера
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка),
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
	|	СУММА(ТаблицаДокумента.СуммаВознаграждения),
	|	СУММА(ТаблицаДокумента.СуммаВознагражденияВал),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ &УчетВалютныхОпераций
	|				ТОГДА 0
	|			ИНАЧЕ -ТаблицаДокумента.СуммаВознагражденияРег
	|		КОНЕЦ),
	|	СУММА(ТаблицаДокумента.СуммаВознаграждения),
	|	СУММА(ТаблицаДокумента.СуммаВознагражденияВал),
	|	ВЫРАЗИТЬ(&ВозникновениеОбязательствПередПоставщиком КАК СТРОКА(100))
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|ГДЕ
	|	НЕ ТаблицаДокумента.СуммаВознаграждения = 0
	|	И ТаблицаДокумента.ОтчетКомиссионераУдержатьКомиссионноеВознаграждение
	|	И ТаблицаДокумента.ИспользоватьНовуюСхемуДвиженийВОтчете
	|	И ТаблицаДокумента.ЭтоВозврат
	|	И &ИспользоватьНовуюСхемуДвижений
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.ДоговорДоговорУслугиКомиссионногоВознаграждения,
	|	ТаблицаДокумента.ЭтоВозврат,
	|	ТаблицаДокумента.ИспользоватьНовуюСхемуДвиженийВОтчете,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.ОтчетКомиссионера
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	Договор,
	|	Валюта,
	|	Документ,
	|	Заказ,
	|	ТипРасчетов,
	|	СчетУчета";
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с контрагентами.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасчетыСПоставщиками.Организация КАК Организация,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Договор КАК Договор,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Документ КАК Документ,
	|	ВременнаяТаблицаРасчетыСПоставщиками.Заказ КАК Заказ,
	|	ВременнаяТаблицаРасчетыСПоставщиками.ТипРасчетов КАК ТипРасчетов
	|ИЗ
	|	ВременнаяТаблицаРасчетыСПоставщиками";

	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПоставщиками");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	РасчетыПроведениеДокументов.ПодготовитьТаблицуВзаиморасчетовСУчетомАвансов(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства, Истина);
	
	НомерЗапроса = 0;
	Запрос.Текст = КурсовыеРазницыУНФ.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПоставщиками(Запрос.МенеджерВременныхТаблиц, Истина, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПоставщиками", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходыОтложенные(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Если СтруктураДополнительныеСвойства.ВидОперации = Перечисления.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионера Тогда
		Запрос.Текст = ТекстЗапросаОтчетКомиссионераОПродажахДоходыИРасходыОтложенные();
	Иначе
		Запрос.Текст = ТекстЗапросаОтчетКомиссионераОВозвратахДоходыИРасходыОтложенные();
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаОтчетКомиссионера);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("КассовыйМетодУчетаДоходовИРасходов", СтруктураДополнительныеСвойства.УчетнаяПолитика.КассовыйМетодУчетаДоходовИРасходов);
	Запрос.УстановитьПараметр("ИспользоватьНовуюСхемуДвижений", СтруктураДополнительныеСвойства.ИспользоватьНовуюСхемуДвижений);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТаблицаЗапасыДоходыИРасходыОтложенные = МассивРезультатов[0].Выгрузить();
	ВыборкаРезультатаЗапроса = МассивРезультатов[1].Выбрать();

	ТаблицаПредоплатаДоходыИРасходыОтложенные = ТаблицаЗапасыДоходыИРасходыОтложенные.Скопировать();
	ТаблицаПредоплатаДоходыИРасходыОтложенные.Очистить();
	
	Если ВыборкаРезультатаЗапроса.Следующий() Тогда
		СуммаКСписанию = ВыборкаРезультатаЗапроса.СуммаКСписанию;
		Для каждого СтрокаЗапасыДоходыИРасходыОтложенные Из ТаблицаЗапасыДоходыИРасходыОтложенные Цикл
			
			Если СуммаКСписанию = 0 Тогда
				Продолжить
			Иначе
				
				Если СтруктураДополнительныеСвойства.ВидОперации = Перечисления.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионера Тогда
					
					Если СтрокаЗапасыДоходыИРасходыОтложенные.СуммаДоходов <= СуммаКСписанию Тогда
						СтрокаПредоплатаДоходыИРасходыОтложенные = ТаблицаПредоплатаДоходыИРасходыОтложенные.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаПредоплатаДоходыИРасходыОтложенные, СтрокаЗапасыДоходыИРасходыОтложенные);
						СуммаКСписанию = СуммаКСписанию - СтрокаЗапасыДоходыИРасходыОтложенные.СуммаДоходов;
					ИначеЕсли СтрокаЗапасыДоходыИРасходыОтложенные.СуммаДоходов > СуммаКСписанию Тогда
						СтрокаПредоплатаДоходыИРасходыОтложенные = ТаблицаПредоплатаДоходыИРасходыОтложенные.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаПредоплатаДоходыИРасходыОтложенные, СтрокаЗапасыДоходыИРасходыОтложенные);
						СтрокаПредоплатаДоходыИРасходыОтложенные.СуммаДоходов = СуммаКСписанию;
						СуммаКСписанию = 0;
					КонецЕсли;
					
				Иначе
					
					Если СтрокаЗапасыДоходыИРасходыОтложенные.СуммаДоходов > СуммаКСписанию Тогда
						СтрокаПредоплатаДоходыИРасходыОтложенные = ТаблицаПредоплатаДоходыИРасходыОтложенные.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаПредоплатаДоходыИРасходыОтложенные, СтрокаЗапасыДоходыИРасходыОтложенные);
						СуммаКСписанию = СуммаКСписанию - СтрокаЗапасыДоходыИРасходыОтложенные.СуммаДоходов;
					ИначеЕсли СтрокаЗапасыДоходыИРасходыОтложенные.СуммаДоходов <= СуммаКСписанию Тогда
						СтрокаПредоплатаДоходыИРасходыОтложенные = ТаблицаПредоплатаДоходыИРасходыОтложенные.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаПредоплатаДоходыИРасходыОтложенные, СтрокаЗапасыДоходыИРасходыОтложенные);
						СтрокаПредоплатаДоходыИРасходыОтложенные.СуммаДоходов = СуммаКСписанию;
						СуммаКСписанию = 0;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Для каждого СтрокаПредоплатаДоходыИРасходыОтложенные Из ТаблицаПредоплатаДоходыИРасходыОтложенные Цикл
		СтрокаЗапасыДоходыИРасходыОтложенные = ТаблицаЗапасыДоходыИРасходыОтложенные.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЗапасыДоходыИРасходыОтложенные, СтрокаПредоплатаДоходыИРасходыОтложенные);
		СтрокаЗапасыДоходыИРасходыОтложенные.ВидДвижения = ВидДвиженияНакопления.Расход;
	КонецЦикла;
	
	ВыборкаРезультатаЗапроса = МассивРезультатов[2].Выбрать();
	
	Если ВыборкаРезультатаЗапроса.Следующий() Тогда
		Статья = ВыборкаРезультатаЗапроса.Статья;
	Иначе
		Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей;
	КонецЕсли;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Период КАК Период,
	|	Таблица.Организация КАК Организация,
	|	Таблица.Документ КАК Документ,
	|	&Статья КАК Статья,
	|	Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Таблица.СуммаДоходов КАК СуммаДоходов
	|ПОМЕСТИТЬ ВременнаяТаблицаПредоплатаДоходыИРасходыОтложенные
	|ИЗ
	|	&Таблица КАК Таблица";
	Запрос.УстановитьПараметр("Таблица", ТаблицаПредоплатаДоходыИРасходыОтложенные);
	Запрос.УстановитьПараметр("Статья", Статья);
	
	Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходыОтложенные", ТаблицаЗапасыДоходыИРасходыОтложенные);
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходыОтложенные()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходыНераспределенные(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("КассовыйМетодУчетаДоходовИРасходов", СтруктураДополнительныеСвойства.УчетнаяПолитика.КассовыйМетодУчетаДоходовИРасходов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ТаблицаДокумента.Статья КАК Статья,
	|	ТаблицаДокумента.Сумма КАК СуммаДоходов
	|ИЗ
	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента,
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И НЕ ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходыНераспределенные", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходыНераспределенные()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходыКассовыйМетод(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаОтчетКомиссионера);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КассовыйМетодУчетаДоходовИРасходов", СтруктураДополнительныеСвойства.УчетнаяПолитика.КассовыйМетодУчетаДоходовИРасходов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.ДокументДата КАК Период,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	ТаблицаДокумента.Статья КАК Статья,
	|	-ТаблицаДокумента.Сумма КАК СуммаДоходов
	|ИЗ
	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента,
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И НЕ ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Таблица.Период,
	|	Таблица.Организация,
	|	Таблица.НаправлениеДеятельности,
	|	Таблица.Статья,
	|	Таблица.СуммаДоходов
	|ИЗ
	|	ВременнаяТаблицаПредоплатаДоходыИРасходыОтложенные КАК Таблица";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходыКассовыйМетод", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходыКассовыйМетод()

// Формирует таблицу значений, содержащую данные для проведения по регистру "ОплатаДокументов".
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаОплатаДокументов(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	МассивДоступныхОпераций = Неопределено;
	РасчетыПроведениеДокументов.СформироватьТаблицаОплатаДокументовНакладные(ДокументСсылка, СтруктураДополнительныеСвойства, МассивДоступныхОпераций);
	
КонецПроцедуры

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионера.Договор.ЭтоДоговорОбслуживания
	|				И ОтчетКомиссионера.Договор.ДоговорОбслуживанияНаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВестиУчетРасходовПоДоговорамОбслуживания,
	|	ОтчетКомиссионера.Договор.ДоговорОбслуживанияНаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ОтчетКомиссионера.Контрагент КАК Контрагент,
	|	ОтчетКомиссионера.Дата КАК Дата,
	|	ОтчетКомиссионера.Договор КАК Договор,
	|	ОтчетКомиссионера.УдержатьКомиссионноеВознаграждение КАК УдержатьКомиссионноеВознаграждение,
	|	ОтчетКомиссионера.Подразделение КАК Подразделение,
	|	ОтчетКомиссионера.Ответственный КАК Ответственный,
	|	ОтчетКомиссионера.НДСВключатьВСтоимость КАК НДСВключатьВСтоимость,
	|	ОтчетКомиссионера.ВалютаДокумента КАК ВалютаДокумента,
	|	ОтчетКомиссионера.Курс КАК Курс,
	|	ОтчетКомиссионера.Кратность КАК Кратность,
	|	ОтчетКомиссионера.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ОтчетКомиссионера.Проект КАК Проект,
	|	ОтчетКомиссионера.ВидОперации КАК ВидОперации,
	|	ОтчетКомиссионера.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионера.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах)
	|				И ОтчетКомиссионера.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионера
	|				И ОтчетКомиссионера.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка)
	|			ТОГДА ОтчетКомиссионера.ДокументОснование
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КорректируемыйДокумент,
	|	ОтчетКомиссионера.Договор.УслугаКомиссионногоВознаграждения КАК УслугаКомиссионногоВознаграждения,
	|	ОтчетКомиссионера.СтавкаНДСВознаграждения КАК СтавкаНДСВознаграждения,
	|	ОтчетКомиссионера.СуммаВознаграждения КАК СуммаВознаграждения,
	|	ОтчетКомиссионера.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ОтчетКомиссионера.Договор.ДоговорУслугиКомиссионногоВознаграждения КАК ДоговорДоговорУслугиКомиссионногоВознаграждения,
	|	ОтчетКомиссионера.Номер КАК Номер
	|ПОМЕСТИТЬ ВременнаяТаблицаШапка
	|ИЗ
	|	Документ.ОтчетКомиссионера КАК ОтчетКомиссионера
	|ГДЕ
	|	ОтчетКомиссионера.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Ссылка КАК Ссылка,
	|	ОтчетКомиссионераЗапасы.НомерСтроки КАК НомерСтроки,
	|	ОтчетКомиссионераЗапасы.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах)
	|			ТОГДА ОтчетКомиссионераЗапасы.Количество * -1
	|		ИНАЧЕ ОтчетКомиссионераЗапасы.Количество
	|	КОНЕЦ КАК Количество,
	|	ОтчетКомиссионераЗапасы.Характеристика КАК Характеристика,
	|	ОтчетКомиссионераЗапасы.СерииНоменклатуры КАК СерииНоменклатуры,
	|	ОтчетКомиссионераЗапасы.Цена КАК Цена,
	|	ВЫБОР
	|		КОГДА &ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах)
	|			ТОГДА ОтчетКомиссионераЗапасы.Сумма * -1
	|		ИНАЧЕ ОтчетКомиссионераЗапасы.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ОтчетКомиссионераЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА &ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах)
	|			ТОГДА ОтчетКомиссионераЗапасы.СуммаНДС * -1
	|		ИНАЧЕ ОтчетКомиссионераЗапасы.СуммаНДС
	|	КОНЕЦ КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА &ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах)
	|			ТОГДА ОтчетКомиссионераЗапасы.Всего * -1
	|		ИНАЧЕ ОтчетКомиссионераЗапасы.Всего
	|	КОНЕЦ КАК Всего,
	|	ОтчетКомиссионераЗапасы.ЦенаПередачи КАК ЦенаПередачи,
	|	ВЫБОР
	|		КОГДА &ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах)
	|			ТОГДА ОтчетКомиссионераЗапасы.СуммаПередачи * -1
	|		ИНАЧЕ ОтчетКомиссионераЗапасы.СуммаПередачи
	|	КОНЕЦ КАК СуммаПередачи,
	|	ВЫБОР
	|		КОГДА &ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах)
	|			ТОГДА ОтчетКомиссионераЗапасы.СуммаНДСПередачи * -1
	|		ИНАЧЕ ОтчетКомиссионераЗапасы.СуммаНДСПередачи
	|	КОНЕЦ КАК СуммаНДСПередачи,
	|	ВЫБОР
	|		КОГДА &ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах)
	|			ТОГДА ОтчетКомиссионераЗапасы.СуммаВознаграждения * -1
	|		ИНАЧЕ ОтчетКомиссионераЗапасы.СуммаВознаграждения
	|	КОНЕЦ КАК СуммаВознаграждения,
	|	ВЫБОР
	|		КОГДА &ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах)
	|			ТОГДА ОтчетКомиссионераЗапасы.СуммаНДСВознаграждения * -1
	|		ИНАЧЕ ОтчетКомиссионераЗапасы.СуммаНДСВознаграждения
	|	КОНЕЦ КАК СуммаНДСВознаграждения,
	|	ОтчетКомиссионераЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ОтчетКомиссионераЗапасы.Партия КАК Партия,
	|	ОтчетКомиссионераЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ОтчетКомиссионераЗапасы.КлючСвязи КАК КлючСвязи,
	|	ОтчетКомиссионераЗапасы.Себестоимость КАК Себестоимость,
	|	ОтчетКомиссионераЗапасы.КлючСвязиСерииНоменклатуры КАК КлючСвязиСерииНоменклатуры,
	|	ОтчетКомиссионераЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ОтчетКомиссионераЗапасы.НомерГТД КАК НомерГТД,
	|	ОтчетКомиссионераЗапасы.ПрямоеСписаниеГТД КАК ПрямоеСписаниеГТД,
	|	ОтчетКомиссионераЗапасы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ОтчетКомиссионераЗапасы.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	ОтчетКомиссионераЗапасы.КодТНВЭД КАК КодТНВЭД
	|ПОМЕСТИТЬ ОтчетКомиссионераЗапасы
	|ИЗ
	|	&ОтчетКомиссионераЗапасыРазвернутая КАК ОтчетКомиссионераЗапасы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетКомиссионераЗапасы.НомерСтроки КАК НомерСтроки,
	|	ОтчетКомиссионераЗапасы.КлючСвязи КАК КлючСвязи,
	|	ОтчетКомиссионераЗапасы.КлючСвязиСерииНоменклатуры КАК КлючСвязиСерииНоменклатуры,
	|	ОтчетКомиссионераЗапасы.Ссылка КАК Документ,
	|	ВременнаяТаблицаШапка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ВременнаяТаблицаШапка.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаШапка.Контрагент.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
	|	ВременнаяТаблицаШапка.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ВременнаяТаблицаШапка.Контрагент.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
	|	ВременнаяТаблицаШапка.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам,
	|	ВременнаяТаблицаШапка.Контрагент.СчетУчетаРасчетовСПокупателем КАК СчетУчетаРасчетовСПокупателем,
	|	ВременнаяТаблицаШапка.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
	|	ВременнаяТаблицаШапка.Договор КАК Договор,
	|	ВременнаяТаблицаШапка.Контрагент КАК СтруктурнаяЕдиница,
	|	ВременнаяТаблицаШапка.УдержатьКомиссионноеВознаграждение КАК УдержатьКомиссионноеВознаграждение,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПриемаПередачиТоваров.ПередачаКомиссионеру) КАК ТипПриемаПередачи,
	|	ВременнаяТаблицаШапка.Подразделение КАК ПодразделениеПродажи,
	|	ВременнаяТаблицаШапка.Ответственный КАК Ответственный,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности
	|		ИНАЧЕ НоменклатураЗапасов.НаправлениеДеятельности
	|	КОНЕЦ КАК НаправлениеДеятельностиПродажи,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж
	|		ИНАЧЕ НоменклатураЗапасов.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж
	|	КОНЕЦ КАК СчетУчетаПродажи,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|			ТОГДА ВременнаяТаблицаШапка.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж
	|		ИНАЧЕ НоменклатураЗапасов.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж
	|	КОНЕЦ КАК СчетУчетаСебестоимость,
	|	НоменклатураЗапасов.СчетУчетаЗапасов КАК СчетУчета,
	|	ОтчетКомиссионераЗапасы.Номенклатура КАК Номенклатура,
	|	ОтчетКомиссионераЗапасы.НомерГТД КАК НомерГТД,
	|	ОтчетКомиссионераЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА ОтчетКомиссионераЗапасы.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Характеристика,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА ОтчетКомиссионераЗапасы.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ОтчетКомиссионераЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ОтчетКомиссионераЗапасы.Количество
	|		ИНАЧЕ ОтчетКомиссионераЗапасы.Количество * ЕдиницыИзмерения.Коэффициент
	|	КОНЕЦ КАК Количество,
	|	ОтчетКомиссионераЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВременнаяТаблицаШапка.НДСВключатьВСтоимость
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВременнаяТаблицаШапка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|						ТОГДА ОтчетКомиссионераЗапасы.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|					ИНАЧЕ ОтчетКомиссионераЗапасы.СуммаНДС * ВременнаяТаблицаШапка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ВременнаяТаблицаШапка.Кратность)
	|				КОНЕЦ
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВременнаяТаблицаШапка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|				ТОГДА ОтчетКомиссионераЗапасы.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ОтчетКомиссионераЗапасы.СуммаНДС * ВременнаяТаблицаШапка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ВременнаяТаблицаШапка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДСПродажи,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВременнаяТаблицаШапка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|				ТОГДА ОтчетКомиссионераЗапасы.Всего * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ОтчетКомиссионераЗапасы.Всего * ВременнаяТаблицаШапка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ВременнаяТаблицаШапка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВременнаяТаблицаШапка.НДСВключатьВСтоимость
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВременнаяТаблицаШапка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|						ТОГДА ОтчетКомиссионераЗапасы.СуммаНДС * КурсыРегВалюты.Курс * ВременнаяТаблицаШапка.Кратность / (ВременнаяТаблицаШапка.Курс * КурсыРегВалюты.Кратность)
	|					ИНАЧЕ ОтчетКомиссионераЗапасы.СуммаНДС
	|				КОНЕЦ
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДСВал,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВременнаяТаблицаШапка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|				ТОГДА ОтчетКомиссионераЗапасы.Всего * КурсыРегВалюты.Курс * ВременнаяТаблицаШапка.Кратность / (ВременнаяТаблицаШапка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ОтчетКомиссионераЗапасы.Всего
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаВал,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВременнаяТаблицаШапка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|				ТОГДА ОтчетКомиссионераЗапасы.Всего
	|			ИНАЧЕ ОтчетКомиссионераЗапасы.Всего * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаРег,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВременнаяТаблицаШапка.НДСВключатьВСтоимость
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВременнаяТаблицаШапка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|						ТОГДА ОтчетКомиссионераЗапасы.СуммаНДСПередачи * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|					ИНАЧЕ ОтчетКомиссионераЗапасы.СуммаНДСПередачи * ВременнаяТаблицаШапка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ВременнаяТаблицаШапка.Кратность)
	|				КОНЕЦ
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СебестоимостьНДС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВременнаяТаблицаШапка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|				ТОГДА ОтчетКомиссионераЗапасы.СуммаНДСПередачи * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ОтчетКомиссионераЗапасы.СуммаНДСПередачи * ВременнаяТаблицаШапка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ВременнаяТаблицаШапка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДСРег,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВременнаяТаблицаШапка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|				ТОГДА ВЫБОР
	|						КОГДА ВременнаяТаблицаШапка.СуммаВключаетНДС
	|							ТОГДА ОтчетКомиссионераЗапасы.СуммаПередачи * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|						ИНАЧЕ (ОтчетКомиссионераЗапасы.СуммаПередачи + ОтчетКомиссионераЗапасы.СуммаНДСПередачи) * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВременнаяТаблицаШапка.СуммаВключаетНДС
	|						ТОГДА ОтчетКомиссионераЗапасы.СуммаПередачи * ВременнаяТаблицаШапка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ВременнаяТаблицаШапка.Кратность)
	|					ИНАЧЕ (ОтчетКомиссионераЗапасы.СуммаПередачи + ОтчетКомиссионераЗапасы.СуммаНДСПередачи) * ВременнаяТаблицаШапка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ВременнаяТаблицаШапка.Кратность)
	|				КОНЕЦ
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Себестоимость,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВременнаяТаблицаШапка.НДСВключатьВСтоимость
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВременнаяТаблицаШапка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|						ТОГДА ОтчетКомиссионераЗапасы.СуммаНДСВознаграждения * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|					ИНАЧЕ ОтчетКомиссионераЗапасы.СуммаНДСВознаграждения * ВременнаяТаблицаШапка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ВременнаяТаблицаШапка.Кратность)
	|				КОНЕЦ
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДСВознаграждения,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВременнаяТаблицаШапка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|				ТОГДА ВЫБОР
	|						КОГДА ВременнаяТаблицаШапка.СуммаВключаетНДС
	|							ТОГДА ОтчетКомиссионераЗапасы.СуммаВознаграждения * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|						ИНАЧЕ (ОтчетКомиссионераЗапасы.СуммаВознаграждения + ОтчетКомиссионераЗапасы.СуммаНДСВознаграждения) * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВременнаяТаблицаШапка.СуммаВключаетНДС
	|						ТОГДА ОтчетКомиссионераЗапасы.СуммаВознаграждения * ВременнаяТаблицаШапка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ВременнаяТаблицаШапка.Кратность)
	|					ИНАЧЕ (ОтчетКомиссионераЗапасы.СуммаВознаграждения + ОтчетКомиссионераЗапасы.СуммаНДСВознаграждения) * ВременнаяТаблицаШапка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ВременнаяТаблицаШапка.Кратность)
	|				КОНЕЦ
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаВознаграждения,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВременнаяТаблицаШапка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|				ТОГДА ВЫБОР
	|						КОГДА ВременнаяТаблицаШапка.СуммаВключаетНДС
	|							ТОГДА ОтчетКомиссионераЗапасы.СуммаВознаграждения * КурсыРегВалюты.Курс * ВременнаяТаблицаШапка.Кратность / (ВременнаяТаблицаШапка.Курс * КурсыРегВалюты.Кратность)
	|						ИНАЧЕ (ОтчетКомиссионераЗапасы.СуммаВознаграждения + ОтчетКомиссионераЗапасы.СуммаНДСВознаграждения) * КурсыРегВалюты.Курс * ВременнаяТаблицаШапка.Кратность / (ВременнаяТаблицаШапка.Курс * КурсыРегВалюты.Кратность)
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВременнаяТаблицаШапка.СуммаВключаетНДС
	|						ТОГДА ОтчетКомиссионераЗапасы.СуммаВознаграждения
	|					ИНАЧЕ ОтчетКомиссионераЗапасы.СуммаВознаграждения + ОтчетКомиссионераЗапасы.СуммаНДСВознаграждения
	|				КОНЕЦ
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаВознагражденияВал,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВременнаяТаблицаШапка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|				ТОГДА ВЫБОР
	|						КОГДА ВременнаяТаблицаШапка.СуммаВключаетНДС
	|							ТОГДА ОтчетКомиссионераЗапасы.СуммаВознаграждения
	|						ИНАЧЕ ОтчетКомиссионераЗапасы.СуммаВознаграждения + ОтчетКомиссионераЗапасы.СуммаНДСВознаграждения
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВременнаяТаблицаШапка.СуммаВключаетНДС
	|						ТОГДА ОтчетКомиссионераЗапасы.СуммаВознаграждения * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
	|					ИНАЧЕ (ОтчетКомиссионераЗапасы.СуммаВознаграждения + ОтчетКомиссионераЗапасы.СуммаНДСВознаграждения) * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
	|				КОНЕЦ
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаВознагражденияРег,
	|	ОтчетКомиссионераЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВременнаяТаблицаШапка.СуммаВключаетНДС
	|				ТОГДА ОтчетКомиссионераЗапасы.СуммаПередачи
	|			ИНАЧЕ ОтчетКомиссионераЗапасы.СуммаПередачи + ОтчетКомиссионераЗапасы.СуммаНДСПередачи
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаРасчетовПринятыеПереданные,
	|	ОтчетКомиссионераЗапасы.ПрямоеСписаниеГТД КАК ПрямоеСписаниеГТД,
	|	ОтчетКомиссионераЗапасы.Себестоимость КАК РучнаяСебестоимость,
	|	ВременнаяТаблицаШапка.Проект КАК Проект,
	|	ОтчетКомиссионераЗапасы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ОтчетКомиссионераЗапасы.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	ОтчетКомиссионераЗапасы.КодТНВЭД КАК КодТНВЭД,
	|	ВЫБОР
	|		КОГДА &ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах)
	|			ТОГДА ОтчетКомиссионераПокупатели.ОтчетКомиссионера
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК КорректируемыйДокумент,
	|	ОтчетКомиссионераПокупатели.ОтчетКомиссионера КАК ОтчетКомиссионера,
	|	ЕСТЬNULL(ОтчетКомиссионераПокупатели.ОтчетКомиссионера.ИспользоватьНовуюСхемуДвижений, ЛОЖЬ) КАК ИспользоватьНовуюСхемуДвиженийВОтчете,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионераПокупатели.ОтчетКомиссионера.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах)
	|			ТОГДА ОтчетКомиссионераПокупатели.ОтчетКомиссионера.Договор.УслугаКомиссионногоВознаграждения
	|		ИНАЧЕ ВременнаяТаблицаШапка.УслугаКомиссионногоВознаграждения
	|	КОНЕЦ КАК УслугаКомиссионногоВознаграждения,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионераПокупатели.ОтчетКомиссионера.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах)
	|			ТОГДА ОтчетКомиссионераПокупатели.ОтчетКомиссионера.СтавкаНДСВознаграждения
	|		ИНАЧЕ ВременнаяТаблицаШапка.СтавкаНДСВознаграждения
	|	КОНЕЦ КАК СтавкаНДСВознаграждения,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВременнаяТаблицаШапка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|				ТОГДА ОтчетКомиссионераЗапасы.СуммаНДСВознаграждения * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ОтчетКомиссионераЗапасы.СуммаНДСВознаграждения * ВременнаяТаблицаШапка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ВременнаяТаблицаШапка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДСВознагражденияДляУслуги,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионера)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоВозврат,
	|	ВременнаяТаблицаШапка.Контрагент.СчетУчетаРасчетовСПоставщиком КАК СчетУчетаРасчетовСПоставщиком,
	|	ВременнаяТаблицаШапка.ДоговорДоговорУслугиКомиссионногоВознаграждения КАК ДоговорДоговорУслугиКомиссионногоВознаграждения,
	|	ВременнаяТаблицаШапка.УслугаКомиссионногоВознаграждения.СчетУчетаЗатрат КАК СчетУчетаЗатрат,
	|	ОтчетКомиссионераПокупатели.ОтчетКомиссионера.УдержатьКомиссионноеВознаграждение КАК ОтчетКомиссионераУдержатьКомиссионноеВознаграждение,
	|	ВременнаяТаблицаШапка.УслугаКомиссионногоВознаграждения.СчетУчетаЗатрат.ТипСчета КАК СчетУчетаЗатратТипСчета
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	ОтчетКомиссионераЗапасы КАК ОтчетКомиссионераЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						КонстантаВалютаУчета.Значение
	|					ИЗ
	|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыУпрВалюты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						КонстантаНациональнаяВалюта.Значение
	|					ИЗ
	|						Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта)) КАК КурсыРегВалюты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураЗапасов
	|		ПО ОтчетКомиссионераЗапасы.Номенклатура = НоменклатураЗапасов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ОтчетКомиссионераЗапасы.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионера.Покупатели КАК ОтчетКомиссионераПокупатели
	|		ПО ОтчетКомиссионераЗапасы.КлючСвязи = ОтчетКомиссионераПокупатели.КлючСвязи,
	|	Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта,
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|ГДЕ
	|	ОтчетКомиссионераПокупатели.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВременнаяТаблицаШапка.Дата КАК Период,
	|	ВременнаяТаблицаШапка.Ссылка КАК Документ,
	|	ВременнаяТаблицаШапка.ВидОперации КАК ВидОперации,
	|	&Организация КАК Организация,
	|	ВременнаяТаблицаШапка.Подразделение КАК СтруктурнаяЕдиница,
	|	ВременнаяТаблицаШапка.ВалютаДокумента КАК Валюта,
	|	ВременнаяТаблицаШапка.УслугаКомиссионногоВознаграждения.СчетУчетаЗатрат КАК СчетУчета,
	|	ВременнаяТаблицаШапка.УслугаКомиссионногоВознаграждения КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК ЗапасыНоменклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка) КАК Партия,
	|	НЕОПРЕДЕЛЕНО КАК Заказ,
	|	НЕОПРЕДЕЛЕНО КАК ЗаказПоставщику,
	|	1 КАК Количество,
	|	ВременнаяТаблицаШапка.СтавкаНДСВознаграждения КАК СтавкаНДС,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ВременнаяТаблицаШапка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|					ТОГДА ОтчетКомиссионераЗапасы.СуммаВознаграждения * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|				ИНАЧЕ ОтчетКомиссионераЗапасы.СуммаВознаграждения * ВременнаяТаблицаШапка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ВременнаяТаблицаШапка.Кратность)
	|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК Сумма,
	|	ЛОЖЬ КАК ВключатьРасходыВСебестоимость,
	|	ВременнаяТаблицаШапка.УслугаКомиссионногоВознаграждения.СчетУчетаЗатрат.ТипСчета КАК ТипСчета,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ВременнаяТаблицаШапка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|					ТОГДА ОтчетКомиссионераЗапасы.Всего * КурсыРегВалюты.Курс * ВременнаяТаблицаШапка.Кратность / (ВременнаяТаблицаШапка.Курс * КурсыРегВалюты.Кратность)
	|				ИНАЧЕ ОтчетКомиссионераЗапасы.Всего
	|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаВал,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ВременнаяТаблицаШапка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|					ТОГДА ОтчетКомиссионераЗапасы.Всего
	|				ИНАЧЕ ОтчетКомиссионераЗапасы.Всего * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
	|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаРег,
	|	ВременнаяТаблицаШапка.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ВременнаяТаблицаШапка.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаШапка.Дата КАК Дата,
	|	ОтчетКомиссионераПокупатели.ОтчетКомиссионера КАК ОтчетКомиссионера,
	|	ВременнаяТаблицаШапка.УдержатьКомиссионноеВознаграждение КАК УдержатьКомиссионноеВознаграждение,
	|	ОтчетКомиссионераПокупатели.ОтчетКомиссионера.УдержатьКомиссионноеВознаграждение КАК ОтчетКомиссионераУдержатьКомиссионноеВознаграждение,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионера)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоВозврат,
	|	ОтчетКомиссионераПокупатели.ОтчетКомиссионера.ИспользоватьНовуюСхемуДвижений КАК ИспользоватьНовуюСхемуДвижений
	|ПОМЕСТИТЬ ВременнаяТаблицаРасходы
	|ИЗ
	|	Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта,
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка,
	|	ОтчетКомиссионераЗапасы КАК ОтчетКомиссионераЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						КонстантаВалютаУчета.Значение
	|					ИЗ
	|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыУпрВалюты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						КонстантаНациональнаяВалюта.Значение
	|					ИЗ
	|						Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта)) КАК КурсыРегВалюты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионера.Покупатели КАК ОтчетКомиссионераПокупатели
	|		ПО ОтчетКомиссионераЗапасы.КлючСвязи = ОтчетКомиссионераПокупатели.КлючСвязи
	|ГДЕ
	|	ОтчетКомиссионераПокупатели.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаШапка.ВидОперации,
	|	ВременнаяТаблицаШапка.УслугаКомиссионногоВознаграждения,
	|	ВременнаяТаблицаШапка.Дата,
	|	ВременнаяТаблицаШапка.Ссылка,
	|	ВременнаяТаблицаШапка.Подразделение,
	|	ВременнаяТаблицаШапка.ВалютаДокумента,
	|	ВременнаяТаблицаШапка.СтавкаНДСВознаграждения,
	|	ВременнаяТаблицаШапка.УслугаКомиссионногоВознаграждения.СчетУчетаЗатрат,
	|	ВременнаяТаблицаШапка.УслугаКомиссионногоВознаграждения.СчетУчетаЗатрат.ТипСчета,
	|	ВременнаяТаблицаШапка.ВестиРасчетыПоДокументам,
	|	ВременнаяТаблицаШапка.Контрагент,
	|	ОтчетКомиссионераПокупатели.ОтчетКомиссионера,
	|	ВременнаяТаблицаШапка.УдержатьКомиссионноеВознаграждение,
	|	ОтчетКомиссионераПокупатели.ОтчетКомиссионера.УдержатьКомиссионноеВознаграждение,
	|	ОтчетКомиссионераПокупатели.ОтчетКомиссионера.ИспользоватьНовуюСхемуДвижений,
	|	ВременнаяТаблицаШапка.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОтчетКомиссионераЗапасы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.Ссылка.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем КАК СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателя КАК СчетУчетаАвансовПокупателя,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком КАК СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику КАК СчетУчетаАвансовПоставщику,
	|	ТаблицаДокумента.Ссылка.Договор КАК Договор,
	|	ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				ИЛИ ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.Взаимозачет)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
	|		ИНАЧЕ ТаблицаДокумента.Документ.Статья
	|	КОНЕЦ КАК Статья,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ.Дата
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Дата
	|	КОНЕЦ КАК ДокументДата,
	|	ТаблицаДокумента.Заказ КАК Заказ,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельностиПродажи,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс) КАК ТипРасчетов,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг) КАК ТипРасчетовКуда,
	|	&Ссылка КАК ДокументКуда,
	|	ТаблицаДокумента.Документ КАК Документ,
	|	СУММА(ВЫБОР
	|			КОГДА &ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах)
	|				ТОГДА -1 * (ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаДокумента.Кратность) КАК ЧИСЛО(15, 2)))
	|			ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаДокумента.Кратность) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА &ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах)
	|				ТОГДА ТаблицаДокумента.СуммаРасчетов * -1
	|			ИНАЧЕ ТаблицаДокумента.СуммаРасчетов
	|		КОНЕЦ) КАК СуммаВал,
	|	СУММА(ВЫБОР
	|			КОГДА &ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах)
	|				ТОГДА ВЫБОР
	|						КОГДА ТаблицаДокумента.Ссылка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|							ТОГДА ТаблицаДокумента.СуммаРасчетов * -1
	|						ИНАЧЕ -1 * (ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.Курс / ТаблицаДокумента.Кратность КАК ЧИСЛО(15, 2)))
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ТаблицаДокумента.Ссылка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
	|						ТОГДА ТаблицаДокумента.СуммаРасчетов
	|					ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.Курс / ТаблицаДокумента.Кратность КАК ЧИСЛО(15, 2))
	|				КОНЕЦ
	|		КОНЕЦ) КАК СуммаРег,
	|	ТаблицаДокумента.ОтчетКомиссионера КАК ОтчетКомиссионера
	|ПОМЕСТИТЬ ВременнаяТаблицаПредоплата
	|ИЗ
	|	Документ.ОтчетКомиссионера.Предоплата КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						КонстантаВалютаУчета.Значение
	|					ИЗ
	|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА),
	|	Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	ТаблицаДокумента.Ссылка.Контрагент,
	|	ТаблицаДокумента.Ссылка.Договор,
	|	ТаблицаДокумента.Заказ,
	|	ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателя,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				ИЛИ ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.Взаимозачет)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей)
	|		ИНАЧЕ ТаблицаДокумента.Документ.Статья
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ.Дата
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Дата
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.ОтчетКомиссионера
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетКомиссионераСерииНоменклатуры.КлючСвязи КАК КлючСвязи,
	|	ОтчетКомиссионераСерииНоменклатуры.Серия КАК Серия,
	|	ОтчетКомиссионераСерииНоменклатуры.Количество КАК Количество
	|ПОМЕСТИТЬ ВременнаяТаблицаСерииНоменклатуры
	|ИЗ
	|	Документ.ОтчетКомиссионера.СерииНоменклатуры КАК ОтчетКомиссионераСерииНоменклатуры
	|ГДЕ
	|	ОтчетКомиссионераСерииНоменклатуры.Ссылка = &Ссылка
	|	И &ИспользоватьСерииНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетКомиссионераПокупатели.Ссылка КАК Ссылка,
	|	ОтчетКомиссионераПокупатели.НомерСтроки КАК НомерСтроки,
	|	ОтчетКомиссионераПокупатели.Покупатель КАК Покупатель,
	|	ОтчетКомиссионераПокупатели.Всего КАК Всего,
	|	ОтчетКомиссионераПокупатели.ВыставленСФ КАК ВыставленСФ,
	|	ОтчетКомиссионераПокупатели.ДатаСФ КАК ДатаСФ,
	|	ОтчетКомиссионераПокупатели.СчетФактура КАК СчетФактура,
	|	ОтчетКомиссионераПокупатели.КлючСвязи КАК КлючСвязи,
	|	ОтчетКомиссионераПокупатели.ОтчетКомиссионера КАК ОтчетКомиссионера
	|ПОМЕСТИТЬ ВременнаяТаблицаПокупатели
	|ИЗ
	|	Документ.ОтчетКомиссионера.Покупатели КАК ОтчетКомиссионераПокупатели
	|ГДЕ
	|	ОтчетКомиссионераПокупатели.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА НЕ ОтчетКомиссионераПокупатели.ОтчетКомиссионера = ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка)
	|				И ОтчетКомиссионераПокупатели.ОтчетКомиссионера.Проведен
	|			ТОГДА ОтчетКомиссионераПокупатели.ОтчетКомиссионера
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка)
	|	КОНЕЦ КАК ОтчетКомиссионера
	|ПОМЕСТИТЬ ВременнаяТаблицаПокупателиДокументыВозврата
	|ИЗ
	|	Документ.ОтчетКомиссионера.Покупатели КАК ОтчетКомиссионераПокупатели
	|ГДЕ
	|	ОтчетКомиссионераПокупатели.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ОтчетКомиссионераСведенияПрослеживаемости.НомерСтроки КАК НомерСтроки,
	|	ОтчетКомиссионераСведенияПрослеживаемости.РНПТ КАК РНПТ,
	|	ВЫБОР
	|		КОГДА &ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах)
	|			ТОГДА -ОтчетКомиссионераСведенияПрослеживаемости.Количество
	|		ИНАЧЕ ОтчетКомиссионераСведенияПрослеживаемости.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА &ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах)
	|			ТОГДА -ОтчетКомиссионераСведенияПрослеживаемости.КоличествоПрослеживаемости
	|		ИНАЧЕ ОтчетКомиссионераСведенияПрослеживаемости.КоличествоПрослеживаемости
	|	КОНЕЦ КАК КоличествоПрослеживаемости,
	|	ОтчетКомиссионераСведенияПрослеживаемости.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВременнаяТаблицаСведенияПрослеживаемости
	|ИЗ
	|	Документ.ОтчетКомиссионера.СведенияПрослеживаемости КАК ОтчетКомиссионераСведенияПрослеживаемости
	|ГДЕ
	|	&ВестиУчетПрослеживаемыхТоваров
	|	И ОтчетКомиссионераСведенияПрослеживаемости.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаОтчетКомиссионера);
	Запрос.УстановитьПараметр("ВидОперации", СтруктураДополнительныеСвойства.ВидОперации);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ИспользоватьХарактеристики", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьХарактеристики);
	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
	// Прослеживаемость
	Запрос.УстановитьПараметр("ВестиУчетПрослеживаемыхТоваров", СтруктураДополнительныеСвойства.УчетнаяПолитика.ВестиУчетПрослеживаемыхТоваров);
	
	ОтчетКомиссионераЗапасы = РаспределеннаяТаблицаЗапасы(ДокументСсылкаОтчетКомиссионера);
	
	Запрос.УстановитьПараметр("ОтчетКомиссионераЗапасыРазвернутая", ОтчетКомиссионераЗапасы);
	Запрос.УстановитьПараметр("ИспользоватьСерииНоменклатуры", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьСерииНоменклатуры);
	
	Запрос.ВыполнитьПакет(); 
	
	// Формирование проводок документа.
	ПроведениеДокументовУНФ.СформироватьТаблицуПроводок(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаРасчетыСПокупателями(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПоставщиками(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПродажи(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗакупки(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыПереданные(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаДоходыИРасходы(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыОтложенные(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыНераспределенные(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходыКассовыйМетод(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаЗапасы(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыВРазрезеГТД(СтруктураДополнительныеСвойства);
	
	// Прослеживаемость
	ПрослеживаемостьУНФ.СформироватьДвиженияРеализацияТоваров(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства);
	// Конец Прослеживаемость
	
	// Серии номенклатуры
	СформироватьТаблицаСерииНоменклатуры(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаОплатаДокументов(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаУправленческий(ДокументСсылкаОтчетКомиссионера, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента() 

Функция РаспределеннаяТаблицаЗапасы(ДокументСсылкаОтчетКомиссионера) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаОтчетКомиссионера);
	
	ЭтоВозврат = ?(ДокументСсылкаОтчетКомиссионера.ВидОперации = Перечисления.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах, Истина, Ложь);
	
	Если Не ЭтоВозврат Тогда
		
		Запрос.УстановитьПараметр("Организация", ДокументСсылкаОтчетКомиссионера.Организация);
		Запрос.УстановитьПараметр("Контрагент", ДокументСсылкаОтчетКомиссионера.Контрагент);
		Запрос.УстановитьПараметр("Договор", ДокументСсылкаОтчетКомиссионера.Договор);
		Запрос.УстановитьПараметр("МоментВремени", Новый Граница(ДокументСсылкаОтчетКомиссионера.МоментВремени(), ВидГраницы.Включая));
		
		Запрос.Текст = ТекстЗапросаРаспределениеОтчетКомиссионераОПродажах();
		ИндексОперации = 0;
		
	Иначе
		Запрос.Текст = ТекстЗапросаРаспределениеОтчетКомиссионераОВозвратах();
		ИндексОперации = 2;
	КонецЕсли;
	
	ВыборкаПакет = Запрос.ВыполнитьПакет();
	
	ТаблицаКРаспределению = ВыборкаПакет[0 + ИндексОперации].Выгрузить();
	ТаблицаРаспределенная = ВыборкаПакет[1 + ИндексОперации].Выгрузить();
	ОстаткиУКомиссионера  = ВыборкаПакет[3 + ИндексОперации].Выгрузить();
	
	ОтчетКомиссионераЗапасы = ДокументСсылкаОтчетКомиссионера.Запасы.Выгрузить();
	
	Если Не ТаблицаКРаспределению.Количество() Тогда
		Возврат ОтчетКомиссионераЗапасы;
	КонецЕсли;
	
	ИспользоватьСерииНоменклатурыОстатки = СерииНоменклатурыУНФ.ИспользоватьСерииНоменклатурыОстатки();
	
	Если ЭтоВозврат Тогда
		ПараметрыОтбораОстатки = Новый Структура("Номенклатура, Характеристика, Партия, ОтчетКомиссионера, КлючСвязи");
		ПараметрыОтбораЗапасы = Новый Структура("Номенклатура, Характеристика, Партия, КлючСвязи");
	Иначе
		ПараметрыОтбораОстатки = Новый Структура("Номенклатура, Характеристика, Партия");
		ПараметрыОтбораЗапасы = Новый Структура("Номенклатура, Характеристика, Партия");
	КонецЕсли;
	
	СтрокиКУдалению = Новый СписокЗначений;
	
	Для Каждого СтрокаКРаспределению Из ТаблицаКРаспределению Цикл
		
		ПараметрыОтбораОстатки.Номенклатура = СтрокаКРаспределению.Номенклатура;
		ПараметрыОтбораОстатки.Характеристика = СтрокаКРаспределению.Характеристика;
		ПараметрыОтбораОстатки.Партия = СтрокаКРаспределению.Партия;
		
		ПараметрыОтбораЗапасы.Номенклатура = СтрокаКРаспределению.Номенклатура;
		ПараметрыОтбораЗапасы.Характеристика = СтрокаКРаспределению.Характеристика;
		ПараметрыОтбораЗапасы.Партия = СтрокаКРаспределению.Партия;
		
		Если ЭтоВозврат Тогда
			ПараметрыОтбораОстатки.ОтчетКомиссионера = СтрокаКРаспределению.ОтчетКомиссионера;
			ПараметрыОтбораОстатки.КлючСвязи = СтрокаКРаспределению.КлючСвязи;
			
			ПараметрыОтбораЗапасы.КлючСвязи = СтрокаКРаспределению.КлючСвязи;
		КонецЕсли;
		
		// Если по комбинации есть строки с выбранным Заказом, значит пользователь сознательно
		// оставил эту строку без заказа.
		ЕстьРаспределение = ТаблицаРаспределенная.НайтиСтроки(ПараметрыОтбораОстатки);
		Если ЕстьРаспределение.Количество() > 0 Тогда Продолжить КонецЕсли;
		
		// Если нет доступных остатков в разрезе Заказов, тогда оставляем без изменения
		ДоступныеОстаткиПоНоменклатуре = ОстаткиУКомиссионера.НайтиСтроки(ПараметрыОтбораОстатки);
		Если Не ДоступныеОстаткиПоНоменклатуре.Количество() Тогда Продолжить КонецЕсли;
		
		СтрокиТаблицаЗапасы = ОтчетКомиссионераЗапасы.НайтиСтроки(ПараметрыОтбораЗапасы);
		
		Для Каждого СтрокаТаблицыЗапасы Из СтрокиТаблицаЗапасы Цикл
			
			Коэффициент = ?(ТипЗнч(СтрокаТаблицыЗапасы.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерения"), СтрокаТаблицыЗапасы.ЕдиницаИзмерения.Коэффициент, 1);
			РаспределяемоеКоличествоСтроки = СтрокаТаблицыЗапасы.Количество*Коэффициент;
			РаспределяемоеКоличествоСебестоимость = СтрокаТаблицыЗапасы.Себестоимость;
			РаспределяемаяСуммаПередачи = СтрокаТаблицыЗапасы.СуммаПередачи;
			
			СтавкаНДС = ?(ЗначениеЗаполнено(СтрокаТаблицыЗапасы.СтавкаНДС), СтрокаТаблицыЗапасы.СтавкаНДС.Ставка, 0);
			
			ИндексСтрокиОстатка = 0;
			
			Для Каждого СтрокаОстатка Из ДоступныеОстаткиПоНоменклатуре Цикл
				
				Если РаспределяемоеКоличествоСтроки <= СтрокаОстатка.Количество Тогда
					
					СтрокаТаблицыЗапасы.ЗаказПокупателя = СтрокаОстатка.ЗаказПокупателя;
					СтрокаТаблицыЗапасы.ЦенаПередачи = Окр(СтрокаОстатка.СуммаРасчетов/СтрокаОстатка.Количество, 2, РежимОкругления.Окр15как20);
					СтрокаОстатка.Количество = СтрокаОстатка.Количество - РаспределяемоеКоличествоСтроки;
					
					СтрокаТаблицыЗапасы.СуммаПередачи = Окр(СтрокаТаблицыЗапасы.ЦенаПередачи * СтрокаТаблицыЗапасы.Количество, 2, РежимОкругления.Окр15как20);
					РаспределяемаяСуммаПередачи = РаспределяемаяСуммаПередачи - СтрокаТаблицыЗапасы.СуммаПередачи;
					
					СтрокаОстатка.СуммаРасчетов = СтрокаОстатка.СуммаРасчетов - СтрокаТаблицыЗапасы.СуммаПередачи;
					
					Если СтрокаОстатка.Количество = 0 Тогда СтрокиКУдалению.Добавить(ИндексСтрокиОстатка) КонецЕсли;
					
					Прервать;
					
				КонецЕсли;
				
				Если Не СтрокаОстатка.Количество > 0 Тогда
					Продолжить
				КонецЕсли;
				
				НоваяСтрока = ОтчетКомиссионераЗапасы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыЗапасы);
				
				ЕдиницаСебестоимости = ?(РаспределяемоеКоличествоСебестоимость <= 0, 0, РаспределяемоеКоличествоСебестоимость / НоваяСтрока.Количество);
				
				НоваяСтрока.Количество = СтрокаОстатка.Количество;
				
				НоваяСтрока.Себестоимость = ЕдиницаСебестоимости * НоваяСтрока.Количество;
				РаспределяемоеКоличествоСебестоимость = РаспределяемоеКоличествоСебестоимость - НоваяСтрока.Себестоимость;
				
				СтрокиКУдалению.Добавить(ИндексСтрокиОстатка);
				НоваяСтрока.ЗаказПокупателя = СтрокаОстатка.ЗаказПокупателя;
				
				РаспределяемоеКоличествоСтроки = РаспределяемоеКоличествоСтроки - НоваяСтрока.Количество*Коэффициент;
				
				СтрокаТаблицыЗапасы.Количество = РаспределяемоеКоличествоСтроки/Коэффициент;
				
				РаботаСКомиссионерамиКомитентамиСервер.РассчитатьСуммуВСтрокеТабличнойЧастиЗапасыОтчетКомиссионера(ДокументСсылкаОтчетКомиссионера, ИспользоватьСерииНоменклатурыОстатки, СтрокаТаблицыЗапасы);
				РаботаСКомиссионерамиКомитентамиСервер.РассчитатьСуммуВСтрокеТабличнойЧастиЗапасыОтчетКомиссионера(ДокументСсылкаОтчетКомиссионера, ИспользоватьСерииНоменклатурыОстатки, НоваяСтрока);
				
				СтрокаТаблицыЗапасы.ЦенаПередачи = Окр(СтрокаОстатка.СуммаРасчетов/СтрокаОстатка.Количество, 2, РежимОкругления.Окр15как20);
				СтрокаТаблицыЗапасы.СуммаПередачи = Окр(СтрокаТаблицыЗапасы.ЦенаПередачи * СтрокаТаблицыЗапасы.Количество, 2, РежимОкругления.Окр15как20);
				
				СтрокаОстатка.Количество = 0;
				
				СтрокаТаблицыЗапасы.СуммаНДСПередачи = ?(
				ДокументСсылкаОтчетКомиссионера.СуммаВключаетНДС,
				СтрокаТаблицыЗапасы.СуммаПередачи - (СтрокаТаблицыЗапасы.СуммаПередачи) / ((СтавкаНДС + 100) / 100),
				СтрокаТаблицыЗапасы.СуммаПередачи * СтавкаНДС / 100
				);
				
				СуммаПередачи = Окр(НоваяСтрока.ЦенаПередачи * НоваяСтрока.Количество, 2, РежимОкругления.Окр15как20);
				НоваяСтрока.СуммаПередачи = ?(СуммаПередачи > СтрокаОстатка.СуммаРасчетов, СтрокаОстатка.СуммаРасчетов, СуммаПередачи);
				
				РаспределяемаяСуммаПередачи = РаспределяемаяСуммаПередачи - НоваяСтрока.СуммаПередачи;
				
				НоваяСтрока.СуммаНДСПередачи = ?(
				ДокументСсылкаОтчетКомиссионера.СуммаВключаетНДС,
				НоваяСтрока.СуммаПередачи - (НоваяСтрока.СуммаПередачи) / ((СтавкаНДС + 100) / 100),
				НоваяСтрока.СуммаПередачи * СтавкаНДС / 100
				);
				
				РаботаСКомиссионерамиКомитентамиСервер.РассчитатьКомиссионноеВознаграждениеЗапасыОтчетКомиссионера(ДокументСсылкаОтчетКомиссионера, СтрокаТаблицыЗапасы);
				
				НоваяСтрока.СуммаВознаграждения = 0;
				РаботаСКомиссионерамиКомитентамиСервер.РассчитатьКомиссионноеВознаграждениеЗапасыОтчетКомиссионера(ДокументСсылкаОтчетКомиссионера, НоваяСтрока);
				
				ИндексСтрокиОстатка = ИндексСтрокиОстатка + 1;
				
			КонецЦикла;
			
			Если РаспределяемаяСуммаПередачи > 0 Тогда
				СтрокаТаблицыЗапасы.СуммаПередачи = СтрокаТаблицыЗапасы.СуммаПередачи + РаспределяемаяСуммаПередачи;
				
				СтрокаТаблицыЗапасы.СуммаНДСПередачи = ?(ДокументСсылкаОтчетКомиссионера.СуммаВключаетНДС,
				СтрокаТаблицыЗапасы.СуммаПередачи - (СтрокаТаблицыЗапасы.СуммаПередачи) / ((СтавкаНДС + 100) / 100),
				СтрокаТаблицыЗапасы.СуммаПередачи * СтавкаНДС / 100);
				
				РаспределяемаяСуммаПередачи = 0;
			КонецЕсли;
			
			СтрокиКУдалению.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
			
			Если СтрокиКУдалению.Количество() Тогда
				Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
					ДоступныеОстаткиПоНоменклатуре.Удалить(СтрокаКУдалению.Значение)
				КонецЦикла;
				СтрокиКУдалению.Очистить();
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ОтчетКомиссионераЗапасы;
	
КонецФункции

Функция ТекстЗапросаРаспределениеОтчетКомиссионераОПродажах()
	
	ЗапросТекст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтчетКомиссионераЗапасы.Номенклатура КАК Номенклатура,
	|	ОтчетКомиссионераЗапасы.Характеристика КАК Характеристика,
	|	ОтчетКомиссионераЗапасы.Партия КАК Партия,
	|	ОтчетКомиссионераЗапасы.Себестоимость КАК Себестоимость
	|ИЗ
	|	Документ.ОтчетКомиссионера.Запасы КАК ОтчетКомиссионераЗапасы
	|ГДЕ
	|	ОтчетКомиссионераЗапасы.Ссылка = &Ссылка
	|	И ОтчетКомиссионераЗапасы.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	И НЕ ОтчетКомиссионераЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетКомиссионераЗапасы.Номенклатура КАК Номенклатура,
	|	ОтчетКомиссионераЗапасы.Характеристика КАК Характеристика,
	|	ОтчетКомиссионераЗапасы.Партия КАК Партия,
	|	ОтчетКомиссионераЗапасы.ЗаказПокупателя КАК Заказ,
	|	ОтчетКомиссионераЗапасы.Себестоимость КАК Себестоимость
	|ИЗ
	|	Документ.ОтчетКомиссионера.Запасы КАК ОтчетКомиссионераЗапасы
	|ГДЕ
	|	ОтчетКомиссионераЗапасы.Ссылка = &Ссылка
	|	И НЕ ОтчетКомиссионераЗапасы.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	И НЕ ОтчетКомиссионераЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗапасыПереданныеОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыПереданныеОстатки.Характеристика КАК Характеристика,
	|	ЗапасыПереданныеОстатки.Партия КАК Партия,
	|	ЗапасыПереданныеОстатки.Заказ КАК ЗаказПокупателя,
	|	ЗапасыПереданныеОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ЗапасыПереданныеОстатки.Заказ.ДатаОтгрузки ЕСТЬ NULL
	|			ТОГДА ДАТАВРЕМЯ(2099, 12, 31, 23, 59, 59)
	|		КОГДА ЗапасыПереданныеОстатки.Заказ.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ЗапасыПереданныеОстатки.Заказ.Дата
	|		ИНАЧЕ ЗапасыПереданныеОстатки.Заказ.ДатаОтгрузки
	|	КОНЕЦ КАК Дата,
	|	ЗапасыПереданныеОстатки.КоличествоОстаток КАК Количество,
	|	ЗапасыПереданныеОстатки.СуммаРасчетовОстаток КАК СуммаРасчетов,
	|	ЗапасыПереданныеОстатки.Заказ.Дата КАК ЗаказДата
	|ПОМЕСТИТЬ ВтОстатки
	|ИЗ
	|	РегистрНакопления.ЗапасыПереданные.Остатки(
	|			&МоментВремени,
	|			Организация = &Организация
	|				И Контрагент = &Контрагент
	|				И Договор = &Договор
	|				И НЕ Заказ = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|				И ТипПриемаПередачи = ЗНАЧЕНИЕ(Перечисление.ТипыПриемаПередачиТоваров.ПередачаКомиссионеру)
	|				И НЕ (Номенклатура, Характеристика, Партия, Заказ) В
	|						(ВЫБРАТЬ
	|							ОтчетКомиссионераЗапасы.Номенклатура КАК Номенклатура,
	|							ОтчетКомиссионераЗапасы.Характеристика КАК Характеристика,
	|							ОтчетКомиссионераЗапасы.Партия КАК Партия,
	|							ОтчетКомиссионераЗапасы.ЗаказПокупателя КАК Заказ
	|						ИЗ
	|							Документ.ОтчетКомиссионера.Запасы КАК ОтчетКомиссионераЗапасы
	|						ГДЕ
	|							ОтчетКомиссионераЗапасы.Ссылка = &Ссылка
	|							И НЕ ОтчетКомиссионераЗапасы.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))) КАК ЗапасыПереданныеОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыПереданныеОстатки.Заказ,
	|	ЗапасыПереданныеОстатки.Номенклатура,
	|	ЗапасыПереданныеОстатки.Характеристика,
	|	ЗапасыПереданныеОстатки.Партия,
	|	ВЫБОР
	|		КОГДА ЗапасыПереданныеОстатки.Заказ.ДатаОтгрузки ЕСТЬ NULL
	|			ТОГДА ДАТАВРЕМЯ(2099, 12, 31, 23, 59, 59)
	|		КОГДА ЗапасыПереданныеОстатки.Заказ.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ЗапасыПереданныеОстатки.Заказ.Дата
	|		ИНАЧЕ ЗапасыПереданныеОстатки.Заказ.ДатаОтгрузки
	|	КОНЕЦ,
	|	ЗапасыПереданныеОстатки.Номенклатура.ЕдиницаИзмерения,
	|	ЗапасыПереданныеОстатки.КоличествоОстаток,
	|	ЗапасыПереданныеОстатки.СуммаРасчетовОстаток,
	|	ЗапасыПереданныеОстатки.Заказ.Дата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗапасыПереданные.Номенклатура,
	|	ЗапасыПереданные.Характеристика,
	|	ЗапасыПереданные.Партия,
	|	ЗапасыПереданные.Заказ,
	|	ЗапасыПереданные.Номенклатура.ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ЗапасыПереданные.Заказ.ДатаОтгрузки ЕСТЬ NULL
	|			ТОГДА ДАТАВРЕМЯ(2099, 12, 31, 23, 59, 59)
	|		КОГДА ЗапасыПереданные.Заказ.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ЗапасыПереданные.Заказ.Дата
	|		ИНАЧЕ ЗапасыПереданные.Заказ.ДатаОтгрузки
	|	КОНЕЦ,
	|	ЗапасыПереданные.Количество,
	|	ЗапасыПереданные.СуммаРасчетов,
	|	ЗапасыПереданные.Заказ.Дата
	|ИЗ
	|	РегистрНакопления.ЗапасыПереданные КАК ЗапасыПереданные
	|ГДЕ
	|	ЗапасыПереданные.Регистратор = &Ссылка
	|	И ЗапасыПереданные.ТипПриемаПередачи = ЗНАЧЕНИЕ(Перечисление.ТипыПриемаПередачиТоваров.ПередачаКомиссионеру)
	|	И ЗапасыПереданные.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтОстатки.Номенклатура КАК Номенклатура,
	|	ВтОстатки.Характеристика КАК Характеристика,
	|	ВтОстатки.Партия КАК Партия,
	|	ВтОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВтОстатки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВтОстатки.Дата КАК Дата,
	|	СУММА(ВтОстатки.Количество) КАК Количество,
	|	СУММА(ВтОстатки.СуммаРасчетов) КАК СуммаРасчетов,
	|	ЕСТЬNULL(ВтОстатки.ЗаказДата, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ЗаказДата
	|ИЗ
	|	ВтОстатки КАК ВтОстатки
	|ГДЕ
	|	ВтОстатки.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтОстатки.Характеристика,
	|	ВтОстатки.Номенклатура,
	|	ВтОстатки.ЕдиницаИзмерения,
	|	ВтОстатки.Дата,
	|	ВтОстатки.Партия,
	|	ВтОстатки.ЗаказПокупателя,
	|	ЕСТЬNULL(ВтОстатки.ЗаказДата, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказДата";
	
	Возврат ЗапросТекст;
	
КонецФункции

Функция ТекстЗапросаРаспределениеОтчетКомиссионераОВозвратах()
	
	ЗапросТекст = 
	"ВЫБРАТЬ
	|	ОтчетКомиссионераПокупатели.ОтчетКомиссионера КАК ОтчетКомиссионера,
	|	ОтчетКомиссионераПокупатели.КлючСвязи КАК КлючСвязи
	|ПОМЕСТИТЬ ВТОтчетыКомиссионера
	|ИЗ
	|	Документ.ОтчетКомиссионера.Покупатели КАК ОтчетКомиссионераПокупатели
	|ГДЕ
	|	ОтчетКомиссионераПокупатели.Ссылка = &Ссылка
	|	И НЕ ОтчетКомиссионераПокупатели.ОтчетКомиссионера = ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтчетКомиссионераЗапасы.Номенклатура КАК Номенклатура,
	|	ОтчетКомиссионераЗапасы.Характеристика КАК Характеристика,
	|	ОтчетКомиссионераЗапасы.Партия КАК Партия,
	|	ОтчетКомиссионераЗапасы.Себестоимость КАК Себестоимость,
	|	ВТОтчетыКомиссионера.ОтчетКомиссионера КАК ОтчетКомиссионера,
	|	ОтчетКомиссионераЗапасы.КлючСвязи КАК КлючСвязи
	|ПОМЕСТИТЬ КРаспределению
	|ИЗ
	|	Документ.ОтчетКомиссионера.Запасы КАК ОтчетКомиссионераЗапасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтчетыКомиссионера КАК ВТОтчетыКомиссионера
	|		ПО ОтчетКомиссионераЗапасы.КлючСвязи = ВТОтчетыКомиссионера.КлючСвязи
	|ГДЕ
	|	ОтчетКомиссионераЗапасы.Ссылка = &Ссылка
	|	И ОтчетКомиссионераЗапасы.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	И ОтчетКомиссионераЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КРаспределению.Номенклатура КАК Номенклатура,
	|	КРаспределению.Характеристика КАК Характеристика,
	|	КРаспределению.Партия КАК Партия,
	|	КРаспределению.Себестоимость КАК Себестоимость,
	|	КРаспределению.ОтчетКомиссионера КАК ОтчетКомиссионера,
	|	КРаспределению.КлючСвязи КАК КлючСвязи
	|ИЗ
	|	КРаспределению КАК КРаспределению
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетКомиссионераЗапасы.Номенклатура КАК Номенклатура,
	|	ОтчетКомиссионераЗапасы.Характеристика КАК Характеристика,
	|	ОтчетКомиссионераЗапасы.Партия КАК Партия,
	|	ОтчетКомиссионераЗапасы.ЗаказПокупателя КАК Заказ,
	|	ОтчетКомиссионераЗапасы.Себестоимость КАК Себестоимость,
	|	ВТОтчетыКомиссионера.ОтчетКомиссионера КАК ОтчетКомиссионера,
	|	ОтчетКомиссионераЗапасы.КлючСвязи КАК КлючСвязи
	|ИЗ
	|	Документ.ОтчетКомиссионера.Запасы КАК ОтчетКомиссионераЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтчетыКомиссионера КАК ВТОтчетыКомиссионера
	|		ПО ОтчетКомиссионераЗапасы.КлючСвязи = ВТОтчетыКомиссионера.КлючСвязи
	|ГДЕ
	|	ОтчетКомиссионераЗапасы.Ссылка = &Ссылка
	|	И НЕ ОтчетКомиссионераЗапасы.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	И ОтчетКомиссионераЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтчетКомиссионера
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Продажи.Номенклатура КАК Номенклатура,
	|	Продажи.Характеристика КАК Характеристика,
	|	Продажи.Партия КАК Партия,
	|	Продажи.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(Продажи.Количество) КАК Количество,
	|	СУММА(Продажи.Сумма) КАК СуммаРасчетов,
	|	КРаспределению.ОтчетКомиссионера КАК ОтчетКомиссионера,
	|	Продажи.ЗаказПокупателя КАК ЗаказПокупателя,
	|	КРаспределению.КлючСвязи КАК КлючСвязи
	|ПОМЕСТИТЬ ВтОстатки
	|ИЗ
	|	КРаспределению КАК КРаспределению
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи КАК Продажи
	|		ПО КРаспределению.ОтчетКомиссионера = Продажи.Документ
	|			И КРаспределению.Номенклатура = Продажи.Номенклатура
	|			И КРаспределению.Характеристика = Продажи.Характеристика
	|			И КРаспределению.Партия = Продажи.Партия
	|ГДЕ
	|	НЕ Продажи.Регистратор = &Ссылка
	|	И НЕ Продажи.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	И Продажи.Документ В
	|			(ВЫБРАТЬ
	|				ОтчетКомиссионераПокупатели.ОтчетКомиссионера КАК Документ
	|			ИЗ
	|				Документ.ОтчетКомиссионера.Покупатели КАК ОтчетКомиссионераПокупатели
	|			ГДЕ
	|				ОтчетКомиссионераПокупатели.Ссылка = &Ссылка
	|				И НЕ ОтчетКомиссионераПокупатели.ОтчетКомиссионера = ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Характеристика,
	|	Продажи.Партия,
	|	Продажи.ЗаказПокупателя,
	|	Продажи.Номенклатура,
	|	КРаспределению.ОтчетКомиссионера,
	|	Продажи.Номенклатура.ЕдиницаИзмерения,
	|	КРаспределению.КлючСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтОстатки.Номенклатура КАК Номенклатура,
	|	ВтОстатки.Характеристика КАК Характеристика,
	|	ВтОстатки.Партия КАК Партия,
	|	ВтОстатки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(ВтОстатки.Количество) КАК Количество,
	|	СУММА(ВтОстатки.СуммаРасчетов) КАК СуммаРасчетов,
	|	ВтОстатки.ОтчетКомиссионера КАК ОтчетКомиссионера,
	|	ВтОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВтОстатки.КлючСвязи КАК КлючСвязи
	|ИЗ
	|	ВтОстатки КАК ВтОстатки
	|ГДЕ
	|	ВтОстатки.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтОстатки.Партия,
	|	ВтОстатки.ЕдиницаИзмерения,
	|	ВтОстатки.Характеристика,
	|	ВтОстатки.ЗаказПокупателя,
	|	ВтОстатки.Номенклатура,
	|	ВтОстатки.ОтчетКомиссионера,
	|	ВтОстатки.КлючСвязи";
	
	Возврат ЗапросТекст;
	
КонецФункции

Функция ТекстЗапросаОтчетКомиссионераОПродажах()
	
	ЗапросТекст =
	"ВЫБРАТЬ
	|	ТаблицаПродажи.Период КАК Период,
	|	ТаблицаПродажи.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) КАК Склад,
	|	ТаблицаПродажи.Номенклатура КАК Номенклатура,
	|	ТаблицаПродажи.Характеристика КАК Характеристика,
	|	ТаблицаПродажи.Партия КАК Партия,
	|	ТаблицаПродажи.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаПродажи.Документ КАК Документ,
	|	ТаблицаПродажи.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаПродажи.ПодразделениеПродажи КАК Подразделение,
	|	ТаблицаПродажи.Проект КАК Проект,
	|	ТаблицаПродажи.Ответственный КАК Ответственный,
	|	СУММА(ТаблицаПродажи.Количество) КАК Количество,
	|	СУММА(ТаблицаПродажи.СуммаНДСПродажи) КАК СуммаНДС,
	|	СУММА(ТаблицаПродажи.Сумма) КАК Сумма,
	|	0 КАК Себестоимость,
	|	СУММА(ТаблицаПродажи.Сумма) КАК СуммаБезСкидки
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаПродажи
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПродажи.Период,
	|	ТаблицаПродажи.Организация,
	|	ТаблицаПродажи.Номенклатура,
	|	ТаблицаПродажи.Характеристика,
	|	ТаблицаПродажи.Партия,
	|	ТаблицаПродажи.ЗаказПокупателя,
	|	ТаблицаПродажи.Документ,
	|	ТаблицаПродажи.СтавкаНДС,
	|	ТаблицаПродажи.ПодразделениеПродажи,
	|	ТаблицаПродажи.Проект,
	|	ТаблицаПродажи.Ответственный";
	
	Возврат ЗапросТекст;
	
КонецФункции

Функция ТекстЗапросаОтчетКомиссионераОВозвратах()
	
	ЗапросТекст =
	"ВЫБРАТЬ
	|	ТаблицаПродажи.Период КАК Период,
	|	ТаблицаПродажи.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) КАК Склад,
	|	ТаблицаПродажи.Номенклатура КАК Номенклатура,
	|	ТаблицаПродажи.Характеристика КАК Характеристика,
	|	ТаблицаПродажи.Партия КАК Партия,
	|	ТаблицаПродажи.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА НЕ ОтчетКомиссионераПокупатели.ОтчетКомиссионера = ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка)
	|				И ОтчетКомиссионераПокупатели.ОтчетКомиссионера.Проведен
	|			ТОГДА ОтчетКомиссионераПокупатели.ОтчетКомиссионера
	|		ИНАЧЕ ТаблицаПродажи.Документ
	|	КОНЕЦ КАК Документ,
	|	ТаблицаПродажи.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаПродажи.ПодразделениеПродажи КАК Подразделение,
	|	ТаблицаПродажи.Проект КАК Проект,
	|	ТаблицаПродажи.Ответственный КАК Ответственный,
	|	СУММА(ТаблицаПродажи.Количество) КАК Количество,
	|	СУММА(ТаблицаПродажи.СуммаНДСПродажи) КАК СуммаНДС,
	|	СУММА(ТаблицаПродажи.Сумма) КАК Сумма,
	|	0 КАК Себестоимость,
	|	СУММА(ТаблицаПродажи.Сумма) КАК СуммаБезСкидки
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаПродажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионера.Покупатели КАК ОтчетКомиссионераПокупатели
	|		ПО ТаблицаПродажи.КлючСвязи = ОтчетКомиссионераПокупатели.КлючСвязи
	|ГДЕ
	|	ОтчетКомиссионераПокупатели.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПродажи.Период,
	|	ТаблицаПродажи.Организация,
	|	ТаблицаПродажи.Номенклатура,
	|	ТаблицаПродажи.Характеристика,
	|	ТаблицаПродажи.Партия,
	|	ТаблицаПродажи.ЗаказПокупателя,
	|	ТаблицаПродажи.СтавкаНДС,
	|	ТаблицаПродажи.ПодразделениеПродажи,
	|	ТаблицаПродажи.Проект,
	|	ТаблицаПродажи.Ответственный,
	|	ВЫБОР
	|		КОГДА НЕ ОтчетКомиссионераПокупатели.ОтчетКомиссионера = ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка)
	|				И ОтчетКомиссионераПокупатели.ОтчетКомиссионера.Проведен
	|			ТОГДА ОтчетКомиссионераПокупатели.ОтчетКомиссионера
	|		ИНАЧЕ ТаблицаПродажи.Документ
	|	КОНЕЦ";
	
	Возврат ЗапросТекст;
	
КонецФункции

Функция ТекстЗапросаОтчетКомиссионераОПродажахЗапасы()
	
	ЗапросТекст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасы.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаЗапасы.Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ТаблицаЗапасы.Документ КАК Документ,
	|	ТаблицаЗапасы.Документ КАК ДокументПродажи,
	|	ТаблицаЗапасы.ЗаказПокупателя КАК ЗаказПродажи,
	|	ТаблицаЗапасы.ПодразделениеПродажи КАК Подразделение,
	|	ТаблицаЗапасы.Ответственный КАК Ответственный,
	|	ТаблицаЗапасы.НаправлениеДеятельностиПродажи КАК НаправлениеДеятельности,
	|	ТаблицаЗапасы.СчетУчетаСебестоимость КАК СчетУчетаСебестоимость,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.ПодразделениеПродажи КАК ПодразделениеПродажи,
	|	ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ВЫБОР
	|		КОГДА &РезервированиеЗапасов
	|			ТОГДА ТаблицаЗапасы.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК ЗаказПокупателя,
	|	ТаблицаЗапасы.УдержатьКомиссионноеВознаграждение КАК УдержатьКомиссионноеВознаграждение,
	|	ТаблицаЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ТаблицаЗапасы.Количество) КАК Количество,
	|	СУММА(ТаблицаЗапасы.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ТаблицаЗапасы.Сумма) КАК Сумма,
	|	СУММА(ТаблицаЗапасы.СуммаВознаграждения) КАК СуммаВознаграждения,
	|	ЛОЖЬ КАК ФиксированнаяСтоимость,
	|	ТаблицаЗапасы.СчетУчетаСебестоимость КАК СчетДт,
	|	ТаблицаЗапасы.СчетУчета КАК СчетКт,
	|	&ОтчетОтКомиссионера КАК Содержание,
	|	&ОтчетОтКомиссионера КАК СодержаниеПроводки
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Документ,
	|	ТаблицаЗапасы.НаправлениеДеятельностиПродажи,
	|	ТаблицаЗапасы.СчетУчетаСебестоимость,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.ПодразделениеПродажи,
	|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.ЗаказПокупателя,
	|	ТаблицаЗапасы.СтавкаНДС,
	|	ТаблицаЗапасы.УдержатьКомиссионноеВознаграждение,
	|	ТаблицаЗапасы.Ответственный,
	|	ТаблицаЗапасы.Документ,
	|	ТаблицаЗапасы.ПодразделениеПродажи,
	|	ТаблицаЗапасы.СчетУчетаСебестоимость,
	|	ТаблицаЗапасы.СчетУчета";
	
	Возврат ЗапросТекст;
	
КонецФункции

Функция ТекстЗапросаОтчетКомиссионераОВозвратахЗапасы()
	
	ЗапросТекст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасы.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаЗапасы.Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА НЕ ОтчетКомиссионераПокупатели.ОтчетКомиссионера = ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка)
	|				И ОтчетКомиссионераПокупатели.ОтчетКомиссионера.Проведен
	|			ТОГДА ОтчетКомиссионераПокупатели.ОтчетКомиссионера
	|		ИНАЧЕ ТаблицаЗапасы.Документ
	|	КОНЕЦ КАК Документ,
	|	ВЫБОР
	|		КОГДА НЕ ОтчетКомиссионераПокупатели.ОтчетКомиссионера = ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка)
	|				И ОтчетКомиссионераПокупатели.ОтчетКомиссионера.Проведен
	|			ТОГДА ОтчетКомиссионераПокупатели.ОтчетКомиссионера
	|		ИНАЧЕ ТаблицаЗапасы.Документ
	|	КОНЕЦ КАК ДокументПродажи,
	|	ТаблицаЗапасы.ЗаказПокупателя КАК ЗаказПродажи,
	|	ТаблицаЗапасы.ПодразделениеПродажи КАК Подразделение,
	|	ТаблицаЗапасы.Ответственный КАК Ответственный,
	|	ТаблицаЗапасы.НаправлениеДеятельностиПродажи КАК НаправлениеДеятельности,
	|	ТаблицаЗапасы.СчетУчетаСебестоимость КАК СчетУчетаСебестоимость,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.ПодразделениеПродажи КАК ПодразделениеПродажи,
	|	ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ВЫБОР
	|		КОГДА &РезервированиеЗапасов
	|			ТОГДА ТаблицаЗапасы.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК ЗаказПокупателя,
	|	ТаблицаЗапасы.ОтчетКомиссионераУдержатьКомиссионноеВознаграждение КАК УдержатьКомиссионноеВознаграждение,
	|	ТаблицаЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ТаблицаЗапасы.Количество) КАК Количество,
	|	СУММА(ТаблицаЗапасы.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ТаблицаЗапасы.Сумма) КАК Сумма,
	|	СУММА(ТаблицаЗапасы.СуммаВознаграждения) КАК СуммаВознаграждения,
	|	ЛОЖЬ КАК ФиксированнаяСтоимость,
	|	ТаблицаЗапасы.СчетУчетаСебестоимость КАК СчетДт,
	|	ТаблицаЗапасы.СчетУчета КАК СчетКт,
	|	СУММА(ТаблицаЗапасы.РучнаяСебестоимость) КАК РучнаяСебестоимость,
	|	&ОтчетОтКомиссионера КАК Содержание,
	|	&ОтчетОтКомиссионера КАК СодержаниеПроводки
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионера.Покупатели КАК ОтчетКомиссионераПокупатели
	|		ПО ТаблицаЗапасы.КлючСвязи = ОтчетКомиссионераПокупатели.КлючСвязи
	|ГДЕ
	|	ОтчетКомиссионераПокупатели.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.НаправлениеДеятельностиПродажи,
	|	ТаблицаЗапасы.СчетУчетаСебестоимость,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.ПодразделениеПродажи,
	|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.ЗаказПокупателя,
	|	ТаблицаЗапасы.СтавкаНДС,
	|	ТаблицаЗапасы.ОтчетКомиссионераУдержатьКомиссионноеВознаграждение,
	|	ТаблицаЗапасы.Ответственный,
	|	ВЫБОР
	|		КОГДА НЕ ОтчетКомиссионераПокупатели.ОтчетКомиссионера = ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка)
	|				И ОтчетКомиссионераПокупатели.ОтчетКомиссионера.Проведен
	|			ТОГДА ОтчетКомиссионераПокупатели.ОтчетКомиссионера
	|		ИНАЧЕ ТаблицаЗапасы.Документ
	|	КОНЕЦ,
	|	ТаблицаЗапасы.ПодразделениеПродажи,
	|	ТаблицаЗапасы.СчетУчетаСебестоимость,
	|	ТаблицаЗапасы.СчетУчета,
	|	ВЫБОР
	|		КОГДА НЕ ОтчетКомиссионераПокупатели.ОтчетКомиссионера = ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка)
	|				И ОтчетКомиссионераПокупатели.ОтчетКомиссионера.Проведен
	|			ТОГДА ОтчетКомиссионераПокупатели.ОтчетКомиссионера
	|		ИНАЧЕ ТаблицаЗапасы.Документ
	|	КОНЕЦ";
	
	Возврат ЗапросТекст;
	
КонецФункции

Функция ТекстЗапросаОтчетКомиссионераОПродажахРасчетыСПокупателями()
	
	ЗапросТекст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаДокумента.Период КАК Дата,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем КАК СчетУчета,
	|	ТаблицаДокумента.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ТаблицаДокумента.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК Заказ,
	|	ТаблицаДокумента.ВалютаРасчетов КАК Валюта,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг) КАК ТипРасчетов,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ &ИспользоватьНовуюСхемуДвижений
	|				ТОГДА ВЫБОР
	|						КОГДА ТаблицаДокумента.УдержатьКомиссионноеВознаграждение
	|							ТОГДА ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаВознаграждения
	|						ИНАЧЕ ТаблицаДокумента.Сумма
	|					КОНЕЦ
	|			ИНАЧЕ ТаблицаДокумента.Сумма
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ &ИспользоватьНовуюСхемуДвижений
	|				ТОГДА ВЫБОР
	|						КОГДА ТаблицаДокумента.УдержатьКомиссионноеВознаграждение
	|							ТОГДА ТаблицаДокумента.СуммаВал - ТаблицаДокумента.СуммаВознагражденияВал
	|						ИНАЧЕ ТаблицаДокумента.СуммаВал
	|					КОНЕЦ
	|			ИНАЧЕ ТаблицаДокумента.СуммаВал
	|		КОНЕЦ) КАК СуммаВал,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ &УчетВалютныхОпераций
	|				ТОГДА 0
	|			КОГДА НЕ &ИспользоватьНовуюСхемуДвижений
	|				ТОГДА ВЫБОР
	|						КОГДА ТаблицаДокумента.УдержатьКомиссионноеВознаграждение
	|							ТОГДА ТаблицаДокумента.СуммаРег - ТаблицаДокумента.СуммаВознагражденияРег
	|						ИНАЧЕ ТаблицаДокумента.СуммаРег
	|					КОНЕЦ
	|			ИНАЧЕ ТаблицаДокумента.СуммаРег
	|		КОНЕЦ) КАК СуммаРег,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ &ИспользоватьНовуюСхемуДвижений
	|				ТОГДА ВЫБОР
	|						КОГДА ТаблицаДокумента.УдержатьКомиссионноеВознаграждение
	|							ТОГДА ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаВознаграждения
	|						ИНАЧЕ ТаблицаДокумента.Сумма
	|					КОНЕЦ
	|			ИНАЧЕ ТаблицаДокумента.Сумма
	|		КОНЕЦ) КАК СуммаДляОстатка,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ &ИспользоватьНовуюСхемуДвижений
	|				ТОГДА ВЫБОР
	|						КОГДА ТаблицаДокумента.УдержатьКомиссионноеВознаграждение
	|							ТОГДА ТаблицаДокумента.СуммаВал - ТаблицаДокумента.СуммаВознагражденияВал
	|						ИНАЧЕ ТаблицаДокумента.СуммаВал
	|					КОНЕЦ
	|			ИНАЧЕ ТаблицаДокумента.СуммаВал
	|		КОНЕЦ) КАК СуммаВалДляОстатка,
	|	ВЫРАЗИТЬ(&ВозникновениеОбязательствПокупателя КАК СТРОКА(100)) КАК СодержаниеПроводки
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПокупателями
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ТаблицаДокумента.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки),
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ТаблицаДокумента.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
	|	СУММА(-ТаблицаДокумента.СуммаВознаграждения),
	|	СУММА(-ТаблицаДокумента.СуммаВознагражденияВал),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ &УчетВалютныхОпераций
	|				ТОГДА 0
	|			ИНАЧЕ -ТаблицаДокумента.СуммаВознагражденияРег
	|		КОНЕЦ),
	|	СУММА(-ТаблицаДокумента.СуммаВознаграждения),
	|	СУММА(-ТаблицаДокумента.СуммаВознагражденияВал),
	|	ВЫРАЗИТЬ(&ВозникновениеОбязательствПокупателя КАК СТРОКА(100))
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.УдержатьКомиссионноеВознаграждение
	|	И &ИспользоватьНовуюСхемуДвижений
	|	И НЕ ТаблицаДокумента.СуммаВознаграждения = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ТаблицаДокумента.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки),
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.СчетУчетаАвансовПокупателя,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ТаблицаДокумента.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.ТипРасчетов,
	|	СУММА(ТаблицаДокумента.Сумма),
	|	СУММА(ТаблицаДокумента.СуммаВал),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ &УчетВалютныхОпераций
	|				ТОГДА 0
	|			ИНАЧЕ ТаблицаДокумента.СуммаРег
	|		КОНЕЦ),
	|	СУММА(ТаблицаДокумента.Сумма),
	|	СУММА(ТаблицаДокумента.СуммаВал),
	|	ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
	|ИЗ
	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ТаблицаДокумента.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаДокумента.ТипРасчетов,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.СчетУчетаАвансовПокупателя
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки),
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.ДокументКуда
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ТаблицаДокумента.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.ТипРасчетовКуда,
	|	СУММА(ТаблицаДокумента.Сумма),
	|	СУММА(ТаблицаДокумента.СуммаВал),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ &УчетВалютныхОпераций
	|				ТОГДА 0
	|			ИНАЧЕ ТаблицаДокумента.СуммаРег
	|		КОНЕЦ),
	|	-СУММА(ТаблицаДокумента.Сумма),
	|	-СУММА(ТаблицаДокумента.СуммаВал),
	|	ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
	|ИЗ
	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.ДокументКуда
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ТаблицаДокумента.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.ТипРасчетовКуда
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	Договор,
	|	Валюта,
	|	Документ,
	|	Заказ,
	|	ТипРасчетов,
	|	СчетУчета";
	
	Возврат ЗапросТекст;
	
КонецФункции

Функция ТекстЗапросаОтчетКомиссионераОВозвратахРасчетыСПокупателями()
	
	ЗапросТекст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаДокумента.Период КАК Дата,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем КАК СчетУчета,
	|	ТаблицаДокумента.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ТаблицаПокупатели.ОтчетКомиссионера = ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка)
	|						ТОГДА ТаблицаПокупатели.ОтчетКомиссионера
	|					ИНАЧЕ ТаблицаДокумента.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ТаблицаДокумента.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК Заказ,
	|	ТаблицаДокумента.ВалютаРасчетов КАК Валюта,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг) КАК ТипРасчетов,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ &ИспользоватьНовуюСхемуДвижений
	|				ТОГДА ВЫБОР
	|						КОГДА ТаблицаДокумента.УдержатьКомиссионноеВознаграждение
	|							ТОГДА ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаВознаграждения
	|						ИНАЧЕ ТаблицаДокумента.Сумма
	|					КОНЕЦ
	|			ИНАЧЕ ТаблицаДокумента.Сумма
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ &ИспользоватьНовуюСхемуДвижений
	|				ТОГДА ВЫБОР
	|						КОГДА ТаблицаДокумента.УдержатьКомиссионноеВознаграждение
	|							ТОГДА ТаблицаДокумента.СуммаВал - ТаблицаДокумента.СуммаВознагражденияВал
	|						ИНАЧЕ ТаблицаДокумента.СуммаВал
	|					КОНЕЦ
	|			ИНАЧЕ ТаблицаДокумента.СуммаВал
	|		КОНЕЦ) КАК СуммаВал,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ &УчетВалютныхОпераций
	|				ТОГДА 0
	|			КОГДА НЕ &ИспользоватьНовуюСхемуДвижений
	|				ТОГДА ВЫБОР
	|						КОГДА ТаблицаДокумента.УдержатьКомиссионноеВознаграждение
	|							ТОГДА ТаблицаДокумента.СуммаРег - ТаблицаДокумента.СуммаВознагражденияРег
	|						ИНАЧЕ ТаблицаДокумента.СуммаРег
	|					КОНЕЦ
	|			ИНАЧЕ ТаблицаДокумента.СуммаРег
	|		КОНЕЦ) КАК СуммаРег,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ &ИспользоватьНовуюСхемуДвижений
	|				ТОГДА ВЫБОР
	|						КОГДА ТаблицаДокумента.УдержатьКомиссионноеВознаграждение
	|							ТОГДА ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаВознаграждения
	|						ИНАЧЕ ТаблицаДокумента.Сумма
	|					КОНЕЦ
	|			ИНАЧЕ ТаблицаДокумента.Сумма
	|		КОНЕЦ) КАК СуммаДляОстатка,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ &ИспользоватьНовуюСхемуДвижений
	|				ТОГДА ВЫБОР
	|						КОГДА ТаблицаДокумента.УдержатьКомиссионноеВознаграждение
	|							ТОГДА ТаблицаДокумента.СуммаВал - ТаблицаДокумента.СуммаВознагражденияВал
	|						ИНАЧЕ ТаблицаДокумента.СуммаВал
	|					КОНЕЦ
	|			ИНАЧЕ ТаблицаДокумента.СуммаВал
	|		КОНЕЦ) КАК СуммаВалДляОстатка,
	|	ВЫРАЗИТЬ(&ВозникновениеОбязательствПокупателя КАК СТРОКА(100)) КАК СодержаниеПроводки
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПокупателями
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПокупатели КАК ТаблицаПокупатели
	|		ПО ТаблицаДокумента.КлючСвязи = ТаблицаПокупатели.КлючСвязи
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ТаблицаДокумента.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ТаблицаПокупатели.ОтчетКомиссионера = ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка)
	|						ТОГДА ТаблицаПокупатели.ОтчетКомиссионера
	|					ИНАЧЕ ТаблицаДокумента.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки),
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ТаблицаПокупатели.ОтчетКомиссионера = ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка)
	|						ТОГДА ТаблицаПокупатели.ОтчетКомиссионера
	|					ИНАЧЕ ТаблицаДокумента.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ТаблицаДокумента.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг),
	|	СУММА(-ТаблицаДокумента.СуммаВознаграждения),
	|	СУММА(-ТаблицаДокумента.СуммаВознагражденияВал),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ &УчетВалютныхОпераций
	|				ТОГДА 0
	|			ИНАЧЕ -ТаблицаДокумента.СуммаВознагражденияРег
	|		КОНЕЦ),
	|	СУММА(-ТаблицаДокумента.СуммаВознаграждения),
	|	СУММА(-ТаблицаДокумента.СуммаВознагражденияВал),
	|	ВЫРАЗИТЬ(&ВозникновениеОбязательствПокупателя КАК СТРОКА(100))
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПокупатели КАК ТаблицаПокупатели
	|		ПО ТаблицаДокумента.КлючСвязи = ТаблицаПокупатели.КлючСвязи
	|ГДЕ
	|	ТаблицаДокумента.ОтчетКомиссионераУдержатьКомиссионноеВознаграждение
	|	И ТаблицаДокумента.ИспользоватьНовуюСхемуДвиженийВОтчете
	|	И НЕ ТаблицаДокумента.СуммаВознаграждения = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ТаблицаДокумента.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ТаблицаПокупатели.ОтчетКомиссионера = ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка)
	|						ТОГДА ТаблицаПокупатели.ОтчетКомиссионера
	|					ИНАЧЕ ТаблицаДокумента.Документ
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки),
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.СчетУчетаАвансовПокупателя,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ТаблицаДокумента.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.ТипРасчетов,
	|	СУММА(ТаблицаДокумента.Сумма),
	|	СУММА(ТаблицаДокумента.СуммаВал),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ &УчетВалютныхОпераций
	|				ТОГДА 0
	|			ИНАЧЕ ТаблицаДокумента.СуммаРег
	|		КОНЕЦ),
	|	СУММА(ТаблицаДокумента.Сумма),
	|	СУММА(ТаблицаДокумента.СуммаВал),
	|	ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
	|ИЗ
	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ТаблицаДокумента.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаДокумента.ТипРасчетов,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.СчетУчетаАвансовПокупателя,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки),
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ТаблицаПокупатели.ОтчетКомиссионера = ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка)
	|						ТОГДА ТаблицаПокупатели.ОтчетКомиссионера
	|					ИНАЧЕ ТаблицаДокумента.ДокументКуда
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ТаблицаДокумента.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.ТипРасчетовКуда,
	|	СУММА(ТаблицаДокумента.Сумма),
	|	СУММА(ТаблицаДокумента.СуммаВал),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ &УчетВалютныхОпераций
	|				ТОГДА 0
	|			ИНАЧЕ ТаблицаДокумента.СуммаРег
	|		КОНЕЦ),
	|	-СУММА(ТаблицаДокумента.Сумма),
	|	-СУММА(ТаблицаДокумента.СуммаВал),
	|	ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
	|ИЗ
	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПокупателиДокументыВозврата КАК ТаблицаПокупатели
	|		ПО ТаблицаДокумента.ОтчетКомиссионера = ТаблицаПокупатели.ОтчетКомиссионера
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ТаблицаДокумента.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.ТипРасчетовКуда,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ТаблицаПокупатели.ОтчетКомиссионера = ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка)
	|						ТОГДА ТаблицаПокупатели.ОтчетКомиссионера
	|					ИНАЧЕ ТаблицаДокумента.ДокументКуда
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	Договор,
	|	Валюта,
	|	Документ,
	|	Заказ,
	|	ТипРасчетов,
	|	СчетУчета";
	
	Возврат ЗапросТекст;
	
КонецФункции

Функция ТекстЗапросаОтчетКомиссионераОВозвратахДоходыИРасходыОтложенные()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.КлючСвязи КАК КлючСвязи,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ОтчетКомиссионераПокупатели.ОтчетКомиссионера = ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка)
	|						ТОГДА ОтчетКомиссионераПокупатели.ОтчетКомиссионера
	|					ИНАЧЕ &Ссылка
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ТаблицаДокумента.НаправлениеДеятельностиПродажи КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА &ИспользоватьНовуюСхемуДвижений
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.УдержатьКомиссионноеВознаграждение
	|						ТОГДА ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаВознаграждения
	|					ИНАЧЕ ТаблицаДокумента.Сумма
	|				КОНЕЦ
	|		ИНАЧЕ ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаВознаграждения
	|	КОНЕЦ КАК СуммаДоходов,
	|	ТаблицаДокумента.СуммаВознаграждения КАК СуммаВознаграждения,
	|	0 КАК СуммаРасходов
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионера.Покупатели КАК ОтчетКомиссионераПокупатели
	|		ПО ТаблицаДокумента.КлючСвязи = ОтчетКомиссионераПокупатели.КлючСвязи,
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И НЕ ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|	И ОтчетКомиссионераПокупатели.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	1,
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.КлючСвязи,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ОтчетКомиссионераПокупатели.ОтчетКомиссионера = ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка)
	|						ТОГДА ОтчетКомиссионераПокупатели.ОтчетКомиссионера
	|					ИНАЧЕ &Ссылка
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.НаправлениеДеятельностиПродажи,
	|	0,
	|	СУММА(ТаблицаДокумента.СуммаВознаграждения),
	|	СУММА(ТаблицаДокумента.СуммаВознаграждения)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионера.Покупатели КАК ОтчетКомиссионераПокупатели
	|		ПО ТаблицаДокумента.КлючСвязи = ОтчетКомиссионераПокупатели.КлючСвязи,
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И НЕ ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|	И ОтчетКомиссионераПокупатели.Ссылка = &Ссылка
	|	И НЕ ТаблицаДокумента.УдержатьКомиссионноеВознаграждение
	|	И НЕ ТаблицаДокумента.ЭтоВозврат
	|	И НЕ ТаблицаДокумента.СуммаВознаграждения = 0
	|	И &ИспользоватьНовуюСхемуДвижений
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.КлючСвязи,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ОтчетКомиссионераПокупатели.ОтчетКомиссионера = ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка)
	|						ТОГДА ОтчетКомиссионераПокупатели.ОтчетКомиссионера
	|					ИНАЧЕ &Ссылка
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.НаправлениеДеятельностиПродажи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	1,
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.КлючСвязи,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ОтчетКомиссионераПокупатели.ОтчетКомиссионера = ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка)
	|						ТОГДА ОтчетКомиссионераПокупатели.ОтчетКомиссионера
	|					ИНАЧЕ &Ссылка
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.НаправлениеДеятельностиПродажи,
	|	0,
	|	СУММА(ТаблицаДокумента.СуммаВознаграждения),
	|	СУММА(ТаблицаДокумента.СуммаВознаграждения)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионера.Покупатели КАК ОтчетКомиссионераПокупатели
	|		ПО ТаблицаДокумента.КлючСвязи = ОтчетКомиссионераПокупатели.КлючСвязи,
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И НЕ ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|	И ОтчетКомиссионераПокупатели.Ссылка = &Ссылка
	|	И НЕ ТаблицаДокумента.ОтчетКомиссионераУдержатьКомиссионноеВознаграждение
	|	И ТаблицаДокумента.ЭтоВозврат
	|	И НЕ ТаблицаДокумента.СуммаВознаграждения = 0
	|	И &ИспользоватьНовуюСхемуДвижений
	|	И ТаблицаДокумента.ИспользоватьНовуюСхемуДвиженийВОтчете
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.КлючСвязи,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ОтчетКомиссионераПокупатели.ОтчетКомиссионера = ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка)
	|						ТОГДА ОтчетКомиссионераПокупатели.ОтчетКомиссионера
	|					ИНАЧЕ &Ссылка
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.НаправлениеДеятельностиПродажи
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Организация КАК Организация,
	|	СУММА(ТаблицаДокумента.Сумма) КАК СуммаКСписанию
	|ИЗ
	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента,
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И НЕ ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Статья КАК Статья
	|ИЗ
	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента,
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И НЕ ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаОтчетКомиссионераОПродажахДоходыИРасходыОтложенные()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА &Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ТаблицаДокумента.НаправлениеДеятельностиПродажи КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА &ИспользоватьНовуюСхемуДвижений
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.УдержатьКомиссионноеВознаграждение
	|						ТОГДА ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаВознаграждения
	|					ИНАЧЕ ТаблицаДокумента.Сумма
	|				КОНЕЦ
	|		ИНАЧЕ ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаВознаграждения
	|	КОНЕЦ КАК СуммаДоходов,
	|	0 КАК СуммаРасходов,
	|	ТаблицаДокумента.СуммаВознаграждения КАК СуммаВознаграждения
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента,
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И НЕ ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	1,
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА &Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.НаправлениеДеятельностиПродажи,
	|	0,
	|	СУММА(ТаблицаДокумента.СуммаВознаграждения),
	|	СУММА(ТаблицаДокумента.СуммаВознаграждения)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента,
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И НЕ ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|	И &ИспользоватьНовуюСхемуДвижений
	|	И НЕ ТаблицаДокумента.УдержатьКомиссионноеВознаграждение
	|	И НЕ ТаблицаДокумента.СуммаВознаграждения = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.НаправлениеДеятельностиПродажи,
	|	ТаблицаДокумента.Период,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА &Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Организация КАК Организация,
	|	СУММА(ТаблицаДокумента.Сумма) КАК СуммаКСписанию
	|ИЗ
	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента,
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И НЕ ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Статья КАК Статья
	|ИЗ
	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента,
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|ГДЕ
	|	&КассовыйМетодУчетаДоходовИРасходов
	|	И НЕ ВременнаяТаблицаШапка.ВестиУчетРасходовПоДоговорамОбслуживания
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылкаОтчетКомиссионера, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Если ПроведениеДокументовУНФ.КонтрольОстатковВыключен() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Если временные таблицы "ДвиженияЗапасыИзменение", "ДвиженияЗапасыПереданныеИзменение"
	// содержат записи, необходимо выполнить контроль реализации товаров.
	
	Если СтруктураВременныеТаблицы.ДвиженияЗапасыИзменение
		ИЛИ СтруктураВременныеТаблицы.ДвиженияЗапасыВРазрезеГТДИзменение
		ИЛИ СтруктураВременныеТаблицы.ДвиженияЗапасыПереданныеВРазрезеГТДИзменение
		ИЛИ СтруктураВременныеТаблицы.ДвиженияЗапасыПереданныеИзменение
		ИЛИ СтруктураВременныеТаблицы.ДвиженияРасчетыСПокупателямиИзменение
		ИЛИ СтруктураВременныеТаблицы.ДвиженияРасчетыСПоставщикамиИзменение
		ИЛИ СтруктураВременныеТаблицы.ДвиженияПрослеживаемыеТоварыИзменение Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДвиженияЗапасыИзменение.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиницаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.СчетУчета) КАК СчетУчетаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.Номенклатура) КАК НоменклатураПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.Характеристика) КАК ХарактеристикаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.Партия) КАК ПартияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыИзменение.ЗаказПокупателя) КАК ЗаказПокупателяПредставление,
		|	ЗапасыОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗапасыОстатки.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияЗапасыИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасы,
		|	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасы,
		|	ЕСТЬNULL(ЗапасыОстатки.СуммаОстаток, 0) КАК СуммаОстатокЗапасы
		|ИЗ
		|	ДвиженияЗапасыИзменение КАК ДвиженияЗапасыИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
		|				&МоментКонтроля,
		|				(Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В
		|					(ВЫБРАТЬ
		|						ДвиженияЗапасыИзменение.Организация КАК Организация,
		|						ДвиженияЗапасыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|						ДвиженияЗапасыИзменение.СчетУчета КАК СчетУчета,
		|						ДвиженияЗапасыИзменение.Номенклатура КАК Номенклатура,
		|						ДвиженияЗапасыИзменение.Характеристика КАК Характеристика,
		|						ДвиженияЗапасыИзменение.Партия КАК Партия,
		|						ДвиженияЗапасыИзменение.ЗаказПокупателя КАК ЗаказПокупателя
		|					ИЗ
		|						ДвиженияЗапасыИзменение КАК ДвиженияЗапасыИзменение)) КАК ЗапасыОстатки
		|		ПО ДвиженияЗапасыИзменение.Организация = ЗапасыОстатки.Организация
		|			И ДвиженияЗапасыИзменение.СтруктурнаяЕдиница = ЗапасыОстатки.СтруктурнаяЕдиница
		|			И ДвиженияЗапасыИзменение.СчетУчета = ЗапасыОстатки.СчетУчета
		|			И ДвиженияЗапасыИзменение.Номенклатура = ЗапасыОстатки.Номенклатура
		|			И ДвиженияЗапасыИзменение.Характеристика = ЗапасыОстатки.Характеристика
		|			И ДвиженияЗапасыИзменение.Партия = ЗапасыОстатки.Партия
		|			И ДвиженияЗапасыИзменение.ЗаказПокупателя = ЗапасыОстатки.ЗаказПокупателя
		|ГДЕ
		|	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) < 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияЗапасыПереданныеИзменение.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПереданныеИзменение.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПереданныеИзменение.Номенклатура) КАК НоменклатураПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПереданныеИзменение.Характеристика) КАК ХарактеристикаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПереданныеИзменение.Партия) КАК ПартияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПереданныеИзменение.Контрагент) КАК КонтрагентПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПереданныеИзменение.Договор) КАК ДоговорПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПереданныеИзменение.Заказ) КАК ЗаказПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПереданныеИзменение.ТипПриемаПередачи) КАК ТипПриемаПередачиПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗапасыПереданныеОстатки.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияЗапасыПереданныеИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыПереданныеОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасыПереданные,
		|	ЕСТЬNULL(ЗапасыПереданныеОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасыПереданные,
		|	ЕСТЬNULL(ДвиженияЗапасыПереданныеИзменение.СуммаРасчетовИзменение, 0) + ЕСТЬNULL(ЗапасыПереданныеОстатки.СуммаРасчетовОстаток, 0) КАК СуммаРасчетовЗапасыПереданные,
		|	ЕСТЬNULL(ЗапасыПереданныеОстатки.СуммаРасчетовОстаток, 0) КАК СуммаРасчетовОстатокЗапасыПереданные
		|ИЗ
		|	ДвиженияЗапасыПереданныеИзменение КАК ДвиженияЗапасыПереданныеИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыПереданные.Остатки(
		|				&МоментКонтроля,
		|				(Организация, Номенклатура, Характеристика, Партия, Контрагент, Договор, Заказ, ТипПриемаПередачи) В
		|					(ВЫБРАТЬ
		|						ДвиженияЗапасыПереданныеИзменение.Организация КАК Организация,
		|						ДвиженияЗапасыПереданныеИзменение.Номенклатура КАК Номенклатура,
		|						ДвиженияЗапасыПереданныеИзменение.Характеристика КАК Характеристика,
		|						ДвиженияЗапасыПереданныеИзменение.Партия КАК Партия,
		|						ДвиженияЗапасыПереданныеИзменение.Контрагент КАК Контрагент,
		|						ДвиженияЗапасыПереданныеИзменение.Договор КАК Договор,
		|						ДвиженияЗапасыПереданныеИзменение.Заказ КАК Заказ,
		|						ДвиженияЗапасыПереданныеИзменение.ТипПриемаПередачи КАК ТипПриемаПередачи
		|					ИЗ
		|						ДвиженияЗапасыПереданныеИзменение КАК ДвиженияЗапасыПереданныеИзменение)) КАК ЗапасыПереданныеОстатки
		|		ПО ДвиженияЗапасыПереданныеИзменение.Организация = ЗапасыПереданныеОстатки.Организация
		|			И ДвиженияЗапасыПереданныеИзменение.Номенклатура = ЗапасыПереданныеОстатки.Номенклатура
		|			И ДвиженияЗапасыПереданныеИзменение.Характеристика = ЗапасыПереданныеОстатки.Характеристика
		|			И ДвиженияЗапасыПереданныеИзменение.Партия = ЗапасыПереданныеОстатки.Партия
		|			И ДвиженияЗапасыПереданныеИзменение.Контрагент = ЗапасыПереданныеОстатки.Контрагент
		|			И ДвиженияЗапасыПереданныеИзменение.Договор = ЗапасыПереданныеОстатки.Договор
		|			И ДвиженияЗапасыПереданныеИзменение.Заказ = ЗапасыПереданныеОстатки.Заказ
		|			И ДвиженияЗапасыПереданныеИзменение.ТипПриемаПередачи = ЗапасыПереданныеОстатки.ТипПриемаПередачи
		|ГДЕ
		|	(ЕСТЬNULL(ЗапасыПереданныеОстатки.КоличествоОстаток, 0) < 0
		|			ИЛИ ЕСТЬNULL(ЗапасыПереданныеОстатки.СуммаРасчетовОстаток, 0) < 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияРасчетыСПокупателямиИзменение.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПокупателямиИзменение.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПокупателямиИзменение.Контрагент) КАК КонтрагентПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПокупателямиИзменение.Договор) КАК ДоговорПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПокупателямиИзменение.Договор.ВалютаРасчетов) КАК ВалютаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПокупателямиИзменение.Документ) КАК ДокументПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПокупателямиИзменение.Заказ) КАК ЗаказПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов) КАК ТипРасчетовПредставление,
		|	ЛОЖЬ КАК ДвиженияДенежныхДокументов,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаПриЗаписи КАК СуммаПриЗаписи,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаИзменение КАК СуммаИзменение,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалПередЗаписью КАК СуммаВалПередЗаписью,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалПриЗаписи КАК СуммаВалПриЗаписи,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалИзменение КАК СуммаВалИзменение,
		|	ВЫБОР
		|		КОГДА ДвиженияРасчетыСПокупателямиИзменение.СуммаВалПриЗаписи >= 0
		|			ТОГДА ДвиженияРасчетыСПокупателямиИзменение.СуммаВалПриЗаписи - ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0)
		|		ИНАЧЕ ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) + ДвиженияРасчетыСПокупателямиИзменение.СуммаВалПриЗаписи
		|	КОНЕЦ КАК СуммаПолученныхАвансов,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалИзменение + ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) КАК СуммаНепогашеннойЗадолженности,
		|	ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток,
		|	ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов КАК ТипРасчетов
		|ИЗ
		|	ДвиженияРасчетыСПокупателямиИзменение КАК ДвиженияРасчетыСПокупателямиИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПокупателями.Остатки(
		|				&МоментКонтроля,
		|				(Организация, Контрагент, Договор, Документ, Заказ, ТипРасчетов) В
		|					(ВЫБРАТЬ
		|						ДвиженияРасчетыСПокупателямиИзменение.Организация КАК Организация,
		|						ДвиженияРасчетыСПокупателямиИзменение.Контрагент КАК Контрагент,
		|						ДвиженияРасчетыСПокупателямиИзменение.Договор КАК Договор,
		|						ДвиженияРасчетыСПокупателямиИзменение.Документ КАК Документ,
		|						ДвиженияРасчетыСПокупателямиИзменение.Заказ КАК Заказ,
		|						ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов КАК ТипРасчетов
		|					ИЗ
		|						ДвиженияРасчетыСПокупателямиИзменение КАК ДвиженияРасчетыСПокупателямиИзменение)) КАК РасчетыСПокупателямиОстатки
		|		ПО ДвиженияРасчетыСПокупателямиИзменение.Организация = РасчетыСПокупателямиОстатки.Организация
		|			И ДвиженияРасчетыСПокупателямиИзменение.Контрагент = РасчетыСПокупателямиОстатки.Контрагент
		|			И ДвиженияРасчетыСПокупателямиИзменение.Договор = РасчетыСПокупателямиОстатки.Договор
		|			И ДвиженияРасчетыСПокупателямиИзменение.Документ = РасчетыСПокупателямиОстатки.Документ
		|			И ДвиженияРасчетыСПокупателямиИзменение.Заказ = РасчетыСПокупателямиОстатки.Заказ
		|			И ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов = РасчетыСПокупателямиОстатки.ТипРасчетов
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ЭтоВозврат
		|					И ДвиженияРасчетыСПокупателямиИзменение.Документ = &Ссылка
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|						ТОГДА ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) > 0
		|					ИНАЧЕ ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) < 0
		|				КОНЕЦ
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияЗапасыВРазрезеГТДИзменение.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.НомерГТД) КАК НомерГТДПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.Номенклатура) КАК НоменклатураПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.Характеристика) КАК ХарактеристикаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.Партия) КАК ПартияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.СтранаПроисхождения) КАК СтранаПроисхожденияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗапасыВРазрезеГТДОстатки.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияЗапасыВРазрезеГТДИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыВРазрезеГТДОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасыВРазрезеГТД,
		|	ЕСТЬNULL(ЗапасыВРазрезеГТДОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасыВРазрезеГТД
		|ИЗ
		|	ДвиженияЗапасыВРазрезеГТДИзменение КАК ДвиженияЗапасыВРазрезеГТДИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыВРазрезеГТД.Остатки(
		|				&МоментКонтроля,
		|				(Организация, НомерГТД, Номенклатура, Характеристика, Партия, СтранаПроисхождения) В
		|					(ВЫБРАТЬ
		|						ДвиженияЗапасыВРазрезеГТДИзменение.Организация КАК Организация,
		|						ДвиженияЗапасыВРазрезеГТДИзменение.НомерГТД КАК НомерГТД,
		|						ДвиженияЗапасыВРазрезеГТДИзменение.Номенклатура КАК Номенклатура,
		|						ДвиженияЗапасыВРазрезеГТДИзменение.Характеристика КАК Характеристика,
		|						ДвиженияЗапасыВРазрезеГТДИзменение.Партия КАК Партия,
		|						ДвиженияЗапасыВРазрезеГТДИзменение.СтранаПроисхождения КАК СтранаПроисхождения
		|					ИЗ
		|						ДвиженияЗапасыВРазрезеГТДИзменение КАК ДвиженияЗапасыВРазрезеГТДИзменение)) КАК ЗапасыВРазрезеГТДОстатки
		|		ПО ДвиженияЗапасыВРазрезеГТДИзменение.Организация = ЗапасыВРазрезеГТДОстатки.Организация
		|			И ДвиженияЗапасыВРазрезеГТДИзменение.НомерГТД = ЗапасыВРазрезеГТДОстатки.НомерГТД
		|			И ДвиженияЗапасыВРазрезеГТДИзменение.Номенклатура = ЗапасыВРазрезеГТДОстатки.Номенклатура
		|			И ДвиженияЗапасыВРазрезеГТДИзменение.Характеристика = ЗапасыВРазрезеГТДОстатки.Характеристика
		|			И ДвиженияЗапасыВРазрезеГТДИзменение.Партия = ЗапасыВРазрезеГТДОстатки.Партия
		|			И ДвиженияЗапасыВРазрезеГТДИзменение.СтранаПроисхождения = ЗапасыВРазрезеГТДОстатки.СтранаПроисхождения
		|ГДЕ
		|	ЕСТЬNULL(ЗапасыВРазрезеГТДОстатки.КоличествоОстаток, 0) < 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияЗапасыПереданныеВРазрезеГТДИзменение.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПереданныеВРазрезеГТДИзменение.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПереданныеВРазрезеГТДИзменение.НомерГТД) КАК НомерГТДПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПереданныеВРазрезеГТДИзменение.Номенклатура) КАК НоменклатураПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПереданныеВРазрезеГТДИзменение.Характеристика) КАК ХарактеристикаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПереданныеВРазрезеГТДИзменение.Партия) КАК ПартияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПереданныеВРазрезеГТДИзменение.СтранаПроисхождения) КАК СтранаПроисхожденияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗапасыПереданныеВРазрезеГТДОстатки.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияЗапасыПереданныеВРазрезеГТДИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыПереданныеВРазрезеГТДОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасыВРазрезеГТД,
		|	ЕСТЬNULL(ЗапасыПереданныеВРазрезеГТДОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасыВРазрезеГТД
		|ИЗ
		|	ДвиженияЗапасыПереданныеВРазрезеГТДИзменение КАК ДвиженияЗапасыПереданныеВРазрезеГТДИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыПереданныеВРазрезеГТД.Остатки(
		|				&МоментКонтроля,
		|				(Организация, НомерГТД, Номенклатура, Характеристика, Партия, СтранаПроисхождения) В
		|					(ВЫБРАТЬ
		|						ДвиженияЗапасыПереданныеВРазрезеГТДИзменение.Организация КАК Организация,
		|						ДвиженияЗапасыПереданныеВРазрезеГТДИзменение.НомерГТД КАК НомерГТД,
		|						ДвиженияЗапасыПереданныеВРазрезеГТДИзменение.Номенклатура КАК Номенклатура,
		|						ДвиженияЗапасыПереданныеВРазрезеГТДИзменение.Характеристика КАК Характеристика,
		|						ДвиженияЗапасыПереданныеВРазрезеГТДИзменение.Партия КАК Партия,
		|						ДвиженияЗапасыПереданныеВРазрезеГТДИзменение.СтранаПроисхождения КАК СтранаПроисхождения
		|					ИЗ
		|						ДвиженияЗапасыПереданныеВРазрезеГТДИзменение КАК ДвиженияЗапасыПереданныеВРазрезеГТДИзменение)) КАК ЗапасыПереданныеВРазрезеГТДОстатки
		|		ПО ДвиженияЗапасыПереданныеВРазрезеГТДИзменение.Организация = ЗапасыПереданныеВРазрезеГТДОстатки.Организация
		|			И ДвиженияЗапасыПереданныеВРазрезеГТДИзменение.НомерГТД = ЗапасыПереданныеВРазрезеГТДОстатки.НомерГТД
		|			И ДвиженияЗапасыПереданныеВРазрезеГТДИзменение.Номенклатура = ЗапасыПереданныеВРазрезеГТДОстатки.Номенклатура
		|			И ДвиженияЗапасыПереданныеВРазрезеГТДИзменение.Характеристика = ЗапасыПереданныеВРазрезеГТДОстатки.Характеристика
		|			И ДвиженияЗапасыПереданныеВРазрезеГТДИзменение.Партия = ЗапасыПереданныеВРазрезеГТДОстатки.Партия
		|			И ДвиженияЗапасыПереданныеВРазрезеГТДИзменение.СтранаПроисхождения = ЗапасыПереданныеВРазрезеГТДОстатки.СтранаПроисхождения
		|ГДЕ
		|	ЕСТЬNULL(ЗапасыПереданныеВРазрезеГТДОстатки.КоличествоОстаток, 0) < 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияПрослеживаемыеТоварыИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияПрослеживаемыеТоварыИзменение.Организация КАК ОрганизацияПредставление,
		|	ДвиженияПрослеживаемыеТоварыИзменение.РНПТ КАК РНПТПредставление,
		|	ДвиженияПрослеживаемыеТоварыИзменение.СтранаПроисхождения КАК СтранаПроисхожденияПредставление,
		|	ДвиженияПрослеживаемыеТоварыИзменение.Номенклатура КАК НоменклатураПредставление,
		|	ДвиженияПрослеживаемыеТоварыИзменение.Характеристика КАК ХарактеристикаПредставление,
		|	ДвиженияПрослеживаемыеТоварыИзменение.Партия КАК ПартияПредставление,
		|	ДвиженияПрослеживаемыеТоварыИзменение.Комиссионер КАК Комиссионер,
		|	ДвиженияПрослеживаемыеТоварыИзменение.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПредставление,
		|	ДвиженияПрослеживаемыеТоварыИзменение.Номенклатура.ТоварнаяНоменклатураВЭД.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПрослеживаемостиПредставление,
		|	ЕСТЬNULL(ДвиженияПрослеживаемыеТоварыИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ПрослеживаемыеТоварыОстатки.КоличествоОстаток, 0) КАК ОстатокКоличество,
		|	ЕСТЬNULL(ДвиженияПрослеживаемыеТоварыИзменение.КоличествоПрослеживаемостиИзменение, 0) + ЕСТЬNULL(ПрослеживаемыеТоварыОстатки.КоличествоПрослеживаемостиОстаток, 0) КАК ОстатокКоличествоПрослеживаемости,
		|	ЕСТЬNULL(ПрослеживаемыеТоварыОстатки.КоличествоОстаток, 0) КАК ОстатокКоличествоТекущий,
		|	ЕСТЬNULL(ПрослеживаемыеТоварыОстатки.КоличествоПрослеживаемостиОстаток, 0) КАК ОстатокКоличествоПрослеживаемостиТекущий
		|ИЗ
		|	ДвиженияПрослеживаемыеТоварыИзменение КАК ДвиженияПрослеживаемыеТоварыИзменение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПрослеживаемыеТовары.Остатки(&МоментКонтроля, ) КАК ПрослеживаемыеТоварыОстатки
		|		ПО ДвиженияПрослеживаемыеТоварыИзменение.Организация = ПрослеживаемыеТоварыОстатки.Организация
		|			И ДвиженияПрослеживаемыеТоварыИзменение.РНПТ = ПрослеживаемыеТоварыОстатки.РНПТ
		|			И ДвиженияПрослеживаемыеТоварыИзменение.СтранаПроисхождения = ПрослеживаемыеТоварыОстатки.СтранаПроисхождения
		|			И ДвиженияПрослеживаемыеТоварыИзменение.Номенклатура = ПрослеживаемыеТоварыОстатки.Номенклатура
		|			И ДвиженияПрослеживаемыеТоварыИзменение.Характеристика = ПрослеживаемыеТоварыОстатки.Характеристика
		|			И ДвиженияПрослеживаемыеТоварыИзменение.Партия = ПрослеживаемыеТоварыОстатки.Партия
		|			И (ЕСТЬNULL(ПрослеживаемыеТоварыОстатки.КоличествоОстаток, 0) < 0
		|				ИЛИ ЕСТЬNULL(ПрослеживаемыеТоварыОстатки.КоличествоПрослеживаемостиОстаток, 0) < 0)
		|			И ДвиженияПрослеживаемыеТоварыИзменение.Комиссионер = ПрослеживаемыеТоварыОстатки.Комиссионер
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияРасчетыСПоставщикамиИзменение.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПоставщикамиИзменение.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПоставщикамиИзменение.Контрагент) КАК КонтрагентПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПоставщикамиИзменение.Договор) КАК ДоговорПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПоставщикамиИзменение.Договор.ВалютаРасчетов) КАК ВалютаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПоставщикамиИзменение.Документ) КАК ДокументПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПоставщикамиИзменение.Заказ) КАК ЗаказПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПоставщикамиИзменение.ТипРасчетов) КАК ТипРасчетовПредставление,
		|	ЛОЖЬ КАК ДвиженияДенежныхДокументов,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаПриЗаписи КАК СуммаПриЗаписи,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаИзменение КАК СуммаИзменение,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалПередЗаписью КАК СуммаВалПередЗаписью,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалПриЗаписи КАК СуммаВалПриЗаписи,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалИзменение КАК СуммаВалИзменение,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалПриЗаписи - ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) КАК СуммаВыданныхАвансов,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалИзменение + ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) КАК СуммаНепогашеннойЗадолженности,
		|	ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток,
		|	ДвиженияРасчетыСПоставщикамиИзменение.ТипРасчетов КАК ТипРасчетов
		|ИЗ
		|	ДвиженияРасчетыСПоставщикамиИзменение КАК ДвиженияРасчетыСПоставщикамиИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками.Остатки(
		|				&МоментКонтроля,
		|				(Организация, Контрагент, Договор, Документ, Заказ, ТипРасчетов) В
		|					(ВЫБРАТЬ
		|						ДвиженияРасчетыСПоставщикамиИзменение.Организация КАК Организация,
		|						ДвиженияРасчетыСПоставщикамиИзменение.Контрагент КАК Контрагент,
		|						ДвиженияРасчетыСПоставщикамиИзменение.Договор КАК Договор,
		|						ДвиженияРасчетыСПоставщикамиИзменение.Документ КАК Документ,
		|						ДвиженияРасчетыСПоставщикамиИзменение.Заказ КАК Заказ,
		|						ДвиженияРасчетыСПоставщикамиИзменение.ТипРасчетов КАК ТипРасчетов
		|					ИЗ
		|						ДвиженияРасчетыСПоставщикамиИзменение КАК ДвиженияРасчетыСПоставщикамиИзменение)) КАК РасчетыСПоставщикамиОстатки
		|		ПО ДвиженияРасчетыСПоставщикамиИзменение.Организация = РасчетыСПоставщикамиОстатки.Организация
		|			И ДвиженияРасчетыСПоставщикамиИзменение.Контрагент = РасчетыСПоставщикамиОстатки.Контрагент
		|			И ДвиженияРасчетыСПоставщикамиИзменение.Договор = РасчетыСПоставщикамиОстатки.Договор
		|			И ДвиженияРасчетыСПоставщикамиИзменение.Документ = РасчетыСПоставщикамиОстатки.Документ
		|			И ДвиженияРасчетыСПоставщикамиИзменение.Заказ = РасчетыСПоставщикамиОстатки.Заказ
		|			И ДвиженияРасчетыСПоставщикамиИзменение.ТипРасчетов = РасчетыСПоставщикамиОстатки.ТипРасчетов
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ДвиженияРасчетыСПоставщикамиИзменение.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|				ТОГДА ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) > 0
		|			ИНАЧЕ ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) < 0
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки");
		
		ЭтоВозврат =  ?(ДокументСсылкаОтчетКомиссионера.ВидОперации = Перечисления.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах, Истина, Ложь);
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("МоментКонтроля", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
		Запрос.УстановитьПараметр("ЭтоВозврат", ЭтоВозврат);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаОтчетКомиссионера);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		Если НЕ МассивРезультатов[0].Пустой()
			ИЛИ НЕ МассивРезультатов[1].Пустой()
			ИЛИ НЕ МассивРезультатов[2].Пустой()
			ИЛИ НЕ МассивРезультатов[3].Пустой()
			ИЛИ НЕ МассивРезультатов[4].Пустой()
			ИЛИ НЕ МассивРезультатов[5].Пустой()
			ИЛИ НЕ МассивРезультатов[6].Пустой()
			Тогда
			
			ДокументОбъектОтчетКомиссионера = ДокументСсылкаОтчетКомиссионера.ПолучитьОбъект();
			
		КонецЕсли;
		
		// Отрицательный остаток учета запасов.
		Если НЕ ЭтоВозврат И НЕ МассивРезультатов[0].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[0].Выбрать();
			КонтрольОстатковУНФ.Запасы(ДокументОбъектОтчетКомиссионера, ВыборкаИзРезультатаЗапроса, Отказ);
		КонецЕсли;
		
		// Отрицательный остаток запасов переданных.
		Если НЕ ЭтоВозврат И НЕ МассивРезультатов[1].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[1].Выбрать();
			КонтрольОстатковУНФ.ЗапасыПереданные(ДокументОбъектОтчетКомиссионера, ВыборкаИзРезультатаЗапроса, Отказ);
		КонецЕсли;
		
		Если Не ЭтоВозврат Тогда
			// Отрицательный остаток по расчетам с покупателями.
			Если Не ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения И НЕ МассивРезультатов[2].Пустой() Тогда
				ВыборкаИзРезультатаЗапроса = МассивРезультатов[2].Выбрать();
				КонтрольОстатковУНФ.РасчетыСПокупателями(ДокументОбъектОтчетКомиссионера, ВыборкаИзРезультатаЗапроса, Отказ);
			КонецЕсли;
		КонецЕсли;
		
		// Отрицательный остаток по остаткам запасов в разрезе номеров ГТД.
		Если НЕ ЭтоВозврат И Константы.КонтролироватьОстаткиПоНомерамГТД.Получить()
			И НЕ МассивРезультатов[3].Пустой() Тогда
			
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[3].Выбрать();
			КонтрольОстатковУНФ.ЗапасыВРазрезеГТД(ДокументОбъектОтчетКомиссионера, ВыборкаИзРезультатаЗапроса, Отказ);
			
		КонецЕсли;
		
		Если НЕ ЭтоВозврат И НЕ МассивРезультатов[4].Пустой() Тогда
				
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[4].Выбрать();
			КонтрольОстатковУНФ.ЗапасыПереданныеВРазрезеГТД(ДокументОбъектОтчетКомиссионера, ВыборкаИзРезультатаЗапроса, Отказ);
				
		КонецЕсли;
		
		Если НЕ ЭтоВозврат И НЕ МассивРезультатов[5].Пустой() Тогда
			
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[5].Выбрать();
			
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструПрослеживаемыеТовары(
			ДокументОбъектОтчетКомиссионера, ВыборкаИзРезультатаЗапроса, Отказ);
		КонецЕсли;
		
		// Отрицательный остаток по расчетам с поставщиками.
		Если ДополнительныеСвойства.ИспользоватьНовуюСхемуДвижений И НЕ ЭтоВозврат И НЕ МассивРезультатов[6].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[6].Выбрать();
			КонтрольОстатковУНФ.РасчетыСПоставщиками(ДокументОбъектОтчетКомиссионера, ВыборкаИзРезультатаЗапроса, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьКонтроль()

// Выполняет контроль возникновения отрицательных оборотов.
//
Процедура ВыполнитьКонтрольВозвраты(ДокументСсылкаОтчетКомиссионера, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Если ПроведениеДокументовУНФ.КонтрольОстатковВыключен() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;

	ЭтоВозврат = ?(ДокументСсылкаОтчетКомиссионера.ВидОперации = Перечисления.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах, Истина, Ложь);
	Если Не ЭтоВозврат Тогда Возврат КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Продажи.Номенклатура КАК Номенклатура,
	|	Продажи.Характеристика КАК Характеристика,
	|	Продажи.Партия КАК Партия,
	|	Продажи.Контрагент КАК Контрагент,
	|	Продажи.Организация КАК Организация,
	|	Продажи.ЗаказПокупателя КАК ЗаказПокупателя,
	|	СУММА(Продажи.Количество) КАК Количество,
	|	СУММА(Продажи.Сумма) КАК Сумма,
	|	Продажи.Документ.Договор КАК ДокументДоговор,
	|	Продажи.Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения
	|ПОМЕСТИТЬ ВтОстатокОборот
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Период <= &МоментКонтроля
	|	И Продажи.Документ В
	|			(ВЫБРАТЬ
	|				ОтчетКомиссионераПокупатели.ОтчетКомиссионера КАК ОтчетКомиссионера
	|			ИЗ
	|				Документ.ОтчетКомиссионера.Покупатели КАК ОтчетКомиссионераПокупатели
	|			ГДЕ
	|				ОтчетКомиссионераПокупатели.Ссылка = &Регистратор
	|				И НЕ ОтчетКомиссионераПокупатели.ОтчетКомиссионера = ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка))
	|	И НЕ Продажи.Регистратор = &Регистратор
	|	И Продажи.Сумма <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Организация,
	|	Продажи.ЗаказПокупателя,
	|	Продажи.Характеристика,
	|	Продажи.Контрагент,
	|	Продажи.Номенклатура,
	|	Продажи.Партия,
	|	Продажи.Документ.Договор,
	|	Продажи.Номенклатура.ЕдиницаИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Продажи.Номенклатура КАК Номенклатура,
	|	Продажи.Характеристика КАК Характеристика,
	|	Продажи.Партия КАК Партия,
	|	Продажи.Контрагент КАК Контрагент,
	|	Продажи.Организация КАК Организация,
	|	Продажи.ЗаказПокупателя КАК ЗаказПокупателя,
	|	СУММА(Продажи.Количество) КАК Количество,
	|	СУММА(Продажи.Сумма) КАК Сумма,
	|	Продажи.Документ.Договор КАК ДокументДоговор,
	|	Продажи.Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения
	|ПОМЕСТИТЬ ВтОстатокОборотПоРегистратору
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Период <= &МоментКонтроля
	|	И Продажи.Регистратор = &Регистратор
	|	И Продажи.Сумма <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Организация,
	|	Продажи.ЗаказПокупателя,
	|	Продажи.Характеристика,
	|	Продажи.Контрагент,
	|	Продажи.Номенклатура,
	|	Продажи.Партия,
	|	Продажи.Документ.Договор,
	|	Продажи.Номенклатура.ЕдиницаИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗапасыПереданные.Номенклатура КАК Номенклатура,
	|	ЗапасыПереданные.Характеристика КАК Характеристика,
	|	ЗапасыПереданные.Партия КАК Партия,
	|	ЗапасыПереданные.Контрагент КАК Контрагент,
	|	ЗапасыПереданные.Заказ КАК Заказ,
	|	СУММА(ЗапасыПереданные.Количество) КАК КоличествоОстаток,
	|	СУММА(ЗапасыПереданные.СуммаРасчетов) КАК СуммаРасчетовОстаток,
	|	ЗапасыПереданные.Договор КАК Договор
	|ПОМЕСТИТЬ ЗапасыПереданныеОборотПоРегистратору
	|ИЗ
	|	РегистрНакопления.ЗапасыПереданные КАК ЗапасыПереданные
	|ГДЕ
	|	ЗапасыПереданные.Период <= &МоментКонтроля
	|	И ЗапасыПереданные.Регистратор В
	|			(ВЫБРАТЬ
	|				ОтчетКомиссионераПокупатели.ОтчетКомиссионера КАК ОтчетКомиссионера
	|			ИЗ
	|				Документ.ОтчетКомиссионера.Покупатели КАК ОтчетКомиссионераПокупатели
	|			ГДЕ
	|				ОтчетКомиссионераПокупатели.Ссылка = &Регистратор
	|				И НЕ ОтчетКомиссионераПокупатели.ОтчетКомиссионера = ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка))
	|	И НЕ ЗапасыПереданные.Регистратор = &Регистратор
	|	И НЕ ЗапасыПереданные.СуммаРасчетов = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыПереданные.Характеристика,
	|	ЗапасыПереданные.Партия,
	|	ЗапасыПереданные.Номенклатура,
	|	ЗапасыПереданные.Заказ,
	|	ЗапасыПереданные.Контрагент,
	|	ЗапасыПереданные.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвиженияЗапасыПереданныеИзменение.НомерСтроки КАК НомерСтроки,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПереданныеИзменение.Организация) КАК ОрганизацияПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПереданныеИзменение.Номенклатура) КАК НоменклатураПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПереданныеИзменение.Характеристика) КАК ХарактеристикаПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПереданныеИзменение.Партия) КАК ПартияПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПереданныеИзменение.Контрагент) КАК КонтрагентПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПереданныеИзменение.Договор) КАК ДоговорПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПереданныеИзменение.Заказ) КАК ЗаказПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыПереданныеИзменение.ТипПриемаПередачи) КАК ТипПриемаПередачиПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗапасыПереданныеОборотПоРегистратору.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
	|	ЕСТЬNULL(ЗапасыПереданныеОборотПоРегистратору.КоличествоОстаток, 0) КАК ОстатокЗапасыПереданные,
	|	ЕСТЬNULL(ДвиженияЗапасыПереданныеИзменение.КоличествоПриЗаписи, 0) + ЕСТЬNULL(ЗапасыПереданныеОборотПоРегистратору.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасыПереданные,
	|	ЕСТЬNULL(ЗапасыПереданныеОборотПоРегистратору.СуммаРасчетовОстаток, 0) КАК СуммаРасчетовЗапасыПереданные,
	|	ЕСТЬNULL(ДвиженияЗапасыПереданныеИзменение.СуммаРасчетовПриЗаписи, 0) + ЕСТЬNULL(ЗапасыПереданныеОборотПоРегистратору.СуммаРасчетовОстаток, 0) КАК СуммаРасчетовОстатокЗапасыПереданные
	|ИЗ
	|	ДвиженияЗапасыПереданныеИзменение КАК ДвиженияЗапасыПереданныеИзменение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗапасыПереданныеОборотПоРегистратору КАК ЗапасыПереданныеОборотПоРегистратору
	|		ПО ДвиженияЗапасыПереданныеИзменение.Номенклатура = ЗапасыПереданныеОборотПоРегистратору.Номенклатура
	|			И ДвиженияЗапасыПереданныеИзменение.Характеристика = ЗапасыПереданныеОборотПоРегистратору.Характеристика
	|			И ДвиженияЗапасыПереданныеИзменение.Партия = ЗапасыПереданныеОборотПоРегистратору.Партия
	|			И ДвиженияЗапасыПереданныеИзменение.Контрагент = ЗапасыПереданныеОборотПоРегистратору.Контрагент
	|			И ДвиженияЗапасыПереданныеИзменение.Договор = ЗапасыПереданныеОборотПоРегистратору.Договор
	|			И ДвиженияЗапасыПереданныеИзменение.Заказ = ЗапасыПереданныеОборотПоРегистратору.Заказ
	|ГДЕ
	|	(ЕСТЬNULL(ЕСТЬNULL(ДвиженияЗапасыПереданныеИзменение.КоличествоПриЗаписи, 0) + ЕСТЬNULL(ЗапасыПереданныеОборотПоРегистратору.КоличествоОстаток, 0), 0) < 0
	|			ИЛИ ЕСТЬNULL(ЕСТЬNULL(ДвиженияЗапасыПереданныеИзменение.СуммаРасчетовПриЗаписи, 0) + ЕСТЬNULL(ЗапасыПереданныеОборотПоРегистратору.СуммаРасчетовОстаток, 0), 0) < 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВтОстатокОборотПоРегистратору.Организация) КАК ОрганизацияПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВтОстатокОборотПоРегистратору.Номенклатура) КАК НоменклатураПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВтОстатокОборотПоРегистратору.Характеристика) КАК ХарактеристикаПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВтОстатокОборотПоРегистратору.Партия) КАК ПартияПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВтОстатокОборотПоРегистратору.Контрагент) КАК КонтрагентПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВтОстатокОборотПоРегистратору.ДокументДоговор) КАК ДоговорПредставление,
	|	ЕСТЬNULL(ВтОстатокОборот.Количество, 0) + ЕСТЬNULL(ВтОстатокОборотПоРегистратору.Количество, 0) КАК ОстатокЗапасыПереданные,
	|	ЕСТЬNULL(ВтОстатокОборот.Сумма, 0) + ЕСТЬNULL(ВтОстатокОборотПоРегистратору.Сумма, 0) КАК СуммаРасчетовЗапасыПереданные,
	|	ВтОстатокОборот.НоменклатураЕдиницаИзмерения КАК ЕдиницаИзмеренияПредставление,
	|	ЕСТЬNULL(ВтОстатокОборот.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(ВтОстатокОборот.Сумма, 0) КАК Сумма,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВтОстатокОборотПоРегистратору.ЗаказПокупателя) КАК ЗаказПредставление,
	|	ЕСТЬNULL(ВтОстатокОборотПоРегистратору.Количество, 0) КАК КоличествоИзменение,
	|	ВтОстатокОборот.Количество КАК КоличествоОборот,
	|	ВтОстатокОборотПоРегистратору.Количество КАК КоличествоОборотРег
	|ПОМЕСТИТЬ ВТОборотПродажи
	|ИЗ
	|	ВтОстатокОборотПоРегистратору КАК ВтОстатокОборотПоРегистратору
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОстатокОборот КАК ВтОстатокОборот
	|		ПО ВтОстатокОборотПоРегистратору.Номенклатура = ВтОстатокОборот.Номенклатура
	|			И ВтОстатокОборотПоРегистратору.Характеристика = ВтОстатокОборот.Характеристика
	|			И ВтОстатокОборотПоРегистратору.Партия = ВтОстатокОборот.Партия
	|			И ВтОстатокОборотПоРегистратору.Контрагент = ВтОстатокОборот.Контрагент
	|			И ВтОстатокОборотПоРегистратору.Организация = ВтОстатокОборот.Организация
	|			И ВтОстатокОборотПоРегистратору.ЗаказПокупателя = ВтОстатокОборот.ЗаказПокупателя
	|			И ВтОстатокОборотПоРегистратору.ДокументДоговор = ВтОстатокОборот.ДокументДоговор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОборотПродажи.ОрганизацияПредставление КАК ОрганизацияПредставление,
	|	ВТОборотПродажи.НоменклатураПредставление КАК НоменклатураПредставление,
	|	ВТОборотПродажи.ХарактеристикаПредставление КАК ХарактеристикаПредставление,
	|	ВТОборотПродажи.ПартияПредставление КАК ПартияПредставление,
	|	ВТОборотПродажи.КонтрагентПредставление КАК КонтрагентПредставление,
	|	ВТОборотПродажи.ДоговорПредставление КАК ДоговорПредставление,
	|	ВТОборотПродажи.ОстатокЗапасыПереданные КАК КоличествоОстатокЗапасыПереданные,
	|	ВТОборотПродажи.СуммаРасчетовЗапасыПереданные КАК СуммаРасчетовОстатокЗапасыПереданные,
	|	ВТОборотПродажи.ЕдиницаИзмеренияПредставление КАК ЕдиницаИзмеренияПредставление,
	|	"""" КАК ТипПриемаПередачиПредставление,
	|	ВТОборотПродажи.Количество КАК ОстатокЗапасыПереданные,
	|	ВТОборотПродажи.Сумма КАК СуммаРасчетовЗапасыПереданные,
	|	ВТОборотПродажи.ЗаказПредставление КАК ЗаказПредставление,
	|	ВТОборотПродажи.КоличествоИзменение КАК КоличествоИзменение,
	|	ВТОборотПродажи.КоличествоОборот КАК КоличествоОборот,
	|	ВТОборотПродажи.КоличествоОборотРег КАК КоличествоОборотРег
	|ИЗ
	|	ВТОборотПродажи КАК ВТОборотПродажи
	|ГДЕ
	|	(ЕСТЬNULL(ВТОборотПродажи.ОстатокЗапасыПереданные, 0) < 0
	|			ИЛИ ЕСТЬNULL(ВТОборотПродажи.СуммаРасчетовЗапасыПереданные, 0) < 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрослеживаемыеТовары.Организация КАК Организация,
	|	ПрослеживаемыеТовары.РНПТ КАК РНПТ,
	|	ПрослеживаемыеТовары.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ПрослеживаемыеТовары.Партия КАК Партия,
	|	ПрослеживаемыеТовары.Номенклатура КАК Номенклатура,
	|	ПрослеживаемыеТовары.Характеристика КАК Характеристика,
	|	ПрослеживаемыеТовары.Комиссионер КАК Комиссионер,
	|	СУММА(ПрослеживаемыеТовары.Количество) КАК Количество,
	|	СУММА(ПрослеживаемыеТовары.КоличествоПрослеживаемости) КАК КоличествоПрослеживаемости
	|ПОМЕСТИТЬ ПрослеживаемостьОборотПоРегистратору
	|ИЗ
	|	РегистрНакопления.ПрослеживаемыеТовары КАК ПрослеживаемыеТовары
	|ГДЕ
	|	ПрослеживаемыеТовары.Период <= &МоментКонтроля
	|	И ПрослеживаемыеТовары.Регистратор В
	|			(ВЫБРАТЬ
	|				ОтчетКомиссионераПокупатели.ОтчетКомиссионера КАК ОтчетКомиссионера
	|			ИЗ
	|				Документ.ОтчетКомиссионера.Покупатели КАК ОтчетКомиссионераПокупатели
	|			ГДЕ
	|				ОтчетКомиссионераПокупатели.Ссылка = &Регистратор
	|				И НЕ ОтчетКомиссионераПокупатели.ОтчетКомиссионера = ЗНАЧЕНИЕ(Документ.ОтчетКомиссионера.ПустаяСсылка))
	|	И НЕ ПрослеживаемыеТовары.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрослеживаемыеТовары.Партия,
	|	ПрослеживаемыеТовары.Номенклатура,
	|	ПрослеживаемыеТовары.Характеристика,
	|	ПрослеживаемыеТовары.Комиссионер,
	|	ПрослеживаемыеТовары.Организация,
	|	ПрослеживаемыеТовары.РНПТ,
	|	ПрослеживаемыеТовары.СтранаПроисхождения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвиженияПрослеживаемыеТоварыИзменение.НомерСтроки КАК НомерСтроки,
	|	ДвиженияПрослеживаемыеТоварыИзменение.Организация КАК ОрганизацияПредставление,
	|	ДвиженияПрослеживаемыеТоварыИзменение.РНПТ КАК РНПТПредставление,
	|	ДвиженияПрослеживаемыеТоварыИзменение.СтранаПроисхождения КАК СтранаПроисхожденияПредставление,
	|	ДвиженияПрослеживаемыеТоварыИзменение.Номенклатура КАК НоменклатураПредставление,
	|	ДвиженияПрослеживаемыеТоварыИзменение.Характеристика КАК ХарактеристикаПредставление,
	|	ДвиженияПрослеживаемыеТоварыИзменение.Партия КАК ПартияПредставление,
	|	ДвиженияПрослеживаемыеТоварыИзменение.Комиссионер КАК Комиссионер,
	|	ДвиженияПрослеживаемыеТоварыИзменение.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПредставление,
	|	ДвиженияПрослеживаемыеТоварыИзменение.Номенклатура.ТоварнаяНоменклатураВЭД.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПрослеживаемостиПредставление,
	|	ЕСТЬNULL(ДвиженияПрослеживаемыеТоварыИзменение.КоличествоПриЗаписи, 0) + ЕСТЬNULL(ПрослеживаемостьОборотПоРегистратору.Количество, 0) КАК ОстатокКоличество,
	|	ЕСТЬNULL(ДвиженияПрослеживаемыеТоварыИзменение.КоличествоПрослеживаемостиПриЗаписи, 0) + ЕСТЬNULL(ПрослеживаемостьОборотПоРегистратору.КоличествоПрослеживаемости, 0) КАК ОстатокКоличествоПрослеживаемости,
	|	ЕСТЬNULL(ПрослеживаемостьОборотПоРегистратору.Количество, 0) КАК ОстатокКоличествоТекущий,
	|	ЕСТЬNULL(ПрослеживаемостьОборотПоРегистратору.КоличествоПрослеживаемости, 0) КАК ОстатокКоличествоПрослеживаемостиТекущий
	|ИЗ
	|	ДвиженияПрослеживаемыеТоварыИзменение КАК ДвиженияПрослеживаемыеТоварыИзменение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПрослеживаемостьОборотПоРегистратору КАК ПрослеживаемостьОборотПоРегистратору
	|		ПО ДвиженияПрослеживаемыеТоварыИзменение.Организация = ПрослеживаемостьОборотПоРегистратору.Организация
	|			И ДвиженияПрослеживаемыеТоварыИзменение.РНПТ = ПрослеживаемостьОборотПоРегистратору.РНПТ
	|			И ДвиженияПрослеживаемыеТоварыИзменение.СтранаПроисхождения = ПрослеживаемостьОборотПоРегистратору.СтранаПроисхождения
	|			И ДвиженияПрослеживаемыеТоварыИзменение.Номенклатура = ПрослеживаемостьОборотПоРегистратору.Номенклатура
	|			И ДвиженияПрослеживаемыеТоварыИзменение.Характеристика = ПрослеживаемостьОборотПоРегистратору.Характеристика
	|			И ДвиженияПрослеживаемыеТоварыИзменение.Партия = ПрослеживаемостьОборотПоРегистратору.Партия
	|			И ДвиженияПрослеживаемыеТоварыИзменение.Комиссионер = ПрослеживаемостьОборотПоРегистратору.Комиссионер
	|ГДЕ
	|	ЕСТЬNULL(ДвиженияПрослеживаемыеТоварыИзменение.КоличествоПриЗаписи, 0) + ЕСТЬNULL(ПрослеживаемостьОборотПоРегистратору.Количество, 0) < 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвиженияРасчетыСПоставщикамиИзменение.НомерСтроки КАК НомерСтроки,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПоставщикамиИзменение.Организация) КАК ОрганизацияПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПоставщикамиИзменение.Контрагент) КАК КонтрагентПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПоставщикамиИзменение.Договор) КАК ДоговорПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПоставщикамиИзменение.Договор.ВалютаРасчетов) КАК ВалютаПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПоставщикамиИзменение.Документ) КАК ДокументПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПоставщикамиИзменение.Заказ) КАК ЗаказПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыСПоставщикамиИзменение.ТипРасчетов) КАК ТипРасчетовПредставление,
	|	ЛОЖЬ КАК ДвиженияДенежныхДокументов,
	|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью,
	|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаПриЗаписи КАК СуммаПриЗаписи,
	|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаИзменение КАК СуммаИзменение,
	|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалПередЗаписью КАК СуммаВалПередЗаписью,
	|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалПриЗаписи КАК СуммаВалПриЗаписи,
	|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалИзменение КАК СуммаВалИзменение,
	|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалПриЗаписи - ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) КАК СуммаВыданныхАвансов,
	|	ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) КАК СуммаНепогашеннойЗадолженности,
	|	ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток,
	|	ДвиженияРасчетыСПоставщикамиИзменение.ТипРасчетов КАК ТипРасчетов
	|ИЗ
	|	ДвиженияРасчетыСПоставщикамиИзменение КАК ДвиженияРасчетыСПоставщикамиИзменение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками.Остатки(
	|				&МоментКонтроля,
	|				(Организация, Контрагент, Договор, Документ, Заказ, ТипРасчетов) В
	|					(ВЫБРАТЬ
	|						ДвиженияРасчетыСПоставщикамиИзменение.Организация КАК Организация,
	|						ДвиженияРасчетыСПоставщикамиИзменение.Контрагент КАК Контрагент,
	|						ДвиженияРасчетыСПоставщикамиИзменение.Договор КАК Договор,
	|						ДвиженияРасчетыСПоставщикамиИзменение.Документ КАК Документ,
	|						ДвиженияРасчетыСПоставщикамиИзменение.Заказ КАК Заказ,
	|						ДвиженияРасчетыСПоставщикамиИзменение.ТипРасчетов КАК ТипРасчетов
	|					ИЗ
	|						ДвиженияРасчетыСПоставщикамиИзменение КАК ДвиженияРасчетыСПоставщикамиИзменение)) КАК РасчетыСПоставщикамиОстатки
	|		ПО ДвиженияРасчетыСПоставщикамиИзменение.Организация = РасчетыСПоставщикамиОстатки.Организация
	|			И ДвиженияРасчетыСПоставщикамиИзменение.Контрагент = РасчетыСПоставщикамиОстатки.Контрагент
	|			И ДвиженияРасчетыСПоставщикамиИзменение.Договор = РасчетыСПоставщикамиОстатки.Договор
	|			И ДвиженияРасчетыСПоставщикамиИзменение.Документ = РасчетыСПоставщикамиОстатки.Документ
	|			И ДвиженияРасчетыСПоставщикамиИзменение.Заказ = РасчетыСПоставщикамиОстатки.Заказ
	|			И ДвиженияРасчетыСПоставщикамиИзменение.ТипРасчетов = РасчетыСПоставщикамиОстатки.ТипРасчетов
	|ГДЕ
	|	ЕСТЬNULL(ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0), 0) < 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МоментКонтроля", КонецДня(ДокументСсылкаОтчетКомиссионера.Дата));
	Запрос.УстановитьПараметр("Регистратор", ДокументСсылкаОтчетКомиссионера);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Если НЕ МассивРезультатов[5].Пустой() Или Не МассивРезультатов[3].Пустой() Тогда
		ДокументОбъектОтчетКомиссионера = ДокументСсылкаОтчетКомиссионера.ПолучитьОбъект();
	КонецЕсли;
	
	// Отрицательный остаток оборотов по регистру Продажи.
	Если НЕ МассивРезультатов[5].Пустой() Тогда
		ВыборкаИзРезультатаЗапроса = МассивРезультатов[5].Выбрать();
		КонтрольОстатковУНФ.ЗапасыПереданные(ДокументОбъектОтчетКомиссионера, ВыборкаИзРезультатаЗапроса, Отказ);
	КонецЕсли;
	
	// Отрицательный остаток по регистру Товары переданные.
	Если НЕ МассивРезультатов[3].Пустой() Тогда
		ВыборкаИзРезультатаЗапроса = МассивРезультатов[3].Выбрать();
		КонтрольОстатковУНФ.ЗапасыПереданные(ДокументОбъектОтчетКомиссионера, ВыборкаИзРезультатаЗапроса, Отказ);
	КонецЕсли;
	
	Если НЕ МассивРезультатов[7].Пустой() Тогда
		
		ВыборкаИзРезультатаЗапроса = МассивРезультатов[7].Выбрать();
		
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструПрослеживаемыеТовары(
		ДокументОбъектОтчетКомиссионера, ВыборкаИзРезультатаЗапроса, Отказ);
		
	КонецЕсли;
	
	// Отрицательный остаток по расчетам с поставщиками.
	Если ДополнительныеСвойства.ИспользоватьНовуюСхемуДвижений И НЕ МассивРезультатов[8].Пустой() Тогда
		ВыборкаИзРезультатаЗапроса = МассивРезультатов[8].Выбрать();
		КонтрольОстатковУНФ.РасчетыСПоставщиками(ДокументОбъектОтчетКомиссионера, ВыборкаИзРезультатаЗапроса, Отказ);
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьКонтроль()

#Область ИнтерфейсПечати

Функция ДанныеДокументовРегУчет(МассивОбъектов, ИспользоватьФаксимиле, ПечатнаяФормаТолькоВРублях = Истина, Ошибки = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("НациональнаяВалюта", Константы.НациональнаяВалюта.Получить());
	Запрос.УстановитьПараметр("ПечатнаяФормаТолькоВРублях", ПечатнаяФормаТолькоВРублях);
	Запрос.УстановитьПараметр("ИспользоватьФаксимиле", ИспользоватьФаксимиле);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтчетКомиссионера.Ссылка КАК Ссылка,
	|	ОтчетКомиссионера.Дата КАК ДатаДокумента,
	|	ВЫРАЗИТЬ(ОтчетКомиссионера.Номер КАК СТРОКА(12)) КАК Номер,
	|	НЕОПРЕДЕЛЕНО КАК НомерИсправления,
	|	НЕОПРЕДЕЛЕНО КАК ДатаИсправления,
	|	НЕОПРЕДЕЛЕНО КАК ФаксимилеПустая,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСчетФактура.Продажа) КАК ВидОперации,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионера.Организация.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ОтчетКомиссионера.Организация.ГоловнаяОрганизация
	|		ИНАЧЕ ОтчетКомиссионера.Организация
	|	КОНЕЦ КАК Организация,
	|	ОтчетКомиссионера.Организация.Префикс КАК Префикс,
	|	ОтчетКомиссионера.Организация.ФайлЛоготип КАК Логотип,
	|	ОтчетКомиссионера.Организация.ФайлФаксимильнаяПечать КАК ФаксимилеПечати,
	|	ВЫБОР
	|		КОГДА &ИспользоватьФаксимиле = ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ДаНет.Нет)
	|	КОНЕЦ КАК ИспользоватьФаксимиле,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионера.Организация.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ОтчетКомиссионера.Организация.ЦифровойИндексОбособленногоПодразделения
	|		КОГДА ОтчетКомиссионера.Подразделение.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				И ОтчетКомиссионера.Подразделение.ГоловнаяОрганизация = ОтчетКомиссионера.Организация
	|			ТОГДА ОтчетКомиссионера.Подразделение.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЦифровойИндексОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионера.Организация.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ОтчетКомиссионера.Организация
	|		КОГДА ОтчетКомиссионера.Подразделение.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				И ОтчетКомиссионера.Подразделение.ГоловнаяОрганизация = ОтчетКомиссионера.Организация
	|			ТОГДА ОтчетКомиссионера.Подразделение
	|		ИНАЧЕ ОтчетКомиссионера.Организация
	|	КОНЕЦ КАК ОбособленноеПодразделениеПоставщика,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионера.Организация.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионера.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС)
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК СтатусУПД,
	|	ЛОЖЬ КАК ЭтоСводныйСчетФактура,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	ОтчетКомиссионера.Организация.БанковскийСчетПоУмолчанию КАК БанковскийСчет,
	|	ПРЕДСТАВЛЕНИЕ(ОтчетКомиссионера.Подразделение) КАК ПредставлениеПодразделения,
	|	НЕОПРЕДЕЛЕНО КАК ПредставлениеСкладаСписания,
	|	ОтчетКомиссионера.Организация КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионера.Контрагент.ГоловнойКонтрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И ОтчетКомиссионера.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ОтчетКомиссионера.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ ОтчетКомиссионера.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ОтчетКомиссионера.Контрагент КАК ОбособленноеПодразделениеПокупателя,
	|	ОтчетКомиссионера.Контрагент КАК Грузополучатель,
	|	ОтчетКомиссионера.Контрагент.БанковскийСчетПоУмолчанию КАК БанковскийСчетКонтрагента,
	|	НЕОПРЕДЕЛЕНО КАК АдресДоставки,
	|	НЕОПРЕДЕЛЕНО КАК РасшифровкаПодписиКонтрагента,
	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьНомер,
	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьДата,
	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьВыдана,
	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьЛицо,
	|	НЕОПРЕДЕЛЕНО КАК Основание,
	|	ВЫБОР
	|		КОГДА &ПечатнаяФормаТолькоВРублях = ИСТИНА
	|			ТОГДА НациональнаяВалюта.Значение
	|		ИНАЧЕ ОтчетКомиссионера.ВалютаДокумента
	|	КОНЕЦ КАК ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА &ПечатнаяФормаТолькоВРублях = ИСТИНА
	|			ТОГДА НациональнаяВалюта.Значение.НаименованиеПолное
	|		ИНАЧЕ ОтчетКомиссионера.ВалютаДокумента.НаименованиеПолное
	|	КОНЕЦ КАК ВалютаНаименование,
	|	ВЫБОР
	|		КОГДА &ПечатнаяФормаТолькоВРублях = ИСТИНА
	|			ТОГДА НациональнаяВалюта.Значение.Код
	|		ИНАЧЕ ОтчетКомиссионера.ВалютаДокумента.Код
	|	КОНЕЦ КАК ВалютаКод,
	|	ОтчетКомиссионера.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ОтчетКомиссионера.НДСВключатьВСтоимость КАК НДСВключатьВСтоимость,
	|	ОтчетКомиссионера.Курс КАК Курс,
	|	ОтчетКомиссионера.Кратность КАК Кратность,
	|	ПРЕДСТАВЛЕНИЕ(ОтчетКомиссионера.Договор) КАК ПредставлениеОснования,
	|	ОтчетКомиссионера.Договор КАК ОснованиеПечатиСсылка,
	|	НЕОПРЕДЕЛЕНО КАК ОснованиеНомер,
	|	НЕОПРЕДЕЛЕНО КАК ОснованиеДата,
	|	НЕОПРЕДЕЛЕНО КАК ТранспортнаяНакладнаяНомер,
	|	НЕОПРЕДЕЛЕНО КАК ТранспортнаяНакладнаяДата,
	|	НЕОПРЕДЕЛЕНО КАК ДолжностьРуководителя,
	|	НЕОПРЕДЕЛЕНО КАК РасшифровкаПодписиРуководителя,
	|	НЕОПРЕДЕЛЕНО КАК ФаксимилеРуководителя,
	|	НЕОПРЕДЕЛЕНО КАК РасшифровкаПодписиГлавногоБухгалтера,
	|	НЕОПРЕДЕЛЕНО КАК ФаксимилеГлавногоБухгалтера,
	|	НЕОПРЕДЕЛЕНО КАК ДолжностьКладовщика,
	|	НЕОПРЕДЕЛЕНО КАК РасшифровкаПодписиКладовщика,
	|	НЕОПРЕДЕЛЕНО КАК ФаксимилеКладовщика,
	|	0 КАК Вес,
	|	0 КАК Объем,
	|	ОтчетКомиссионера.Запасы.(
	|		НомерСтроки КАК НомерСтроки,
	|		Ссылка КАК Ссылка,
	|		Номенклатура КАК Номенклатура,
	|		НЕОПРЕДЕЛЕНО КАК Содержание,
	|		ВЫБОР
	|			КОГДА (ВЫРАЗИТЬ(ОтчетКомиссионера.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
	|				ТОГДА ОтчетКомиссионера.Запасы.Номенклатура.Наименование
	|			ИНАЧЕ ВЫРАЗИТЬ(ОтчетКомиссионера.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
	|		КОНЕЦ КАК ПредставлениеНоменклатуры,
	|		Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|		Номенклатура.Код КАК ЗапасКод,
	|		Номенклатура.Код КАК Код,
	|		Номенклатура.Артикул КАК Артикул,
	|		Характеристика КАК Характеристика,
	|		ВЫБОР
	|			КОГДА ОтчетКомиссионера.Запасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|					И ПечатьПользовательскихЕдиницИзмерения.Значение = ЗНАЧЕНИЕ(Перечисление.ПечатьПользовательскихЕдиницИзмерения.ФормироватьПечатныйДокументВПользовательскойЕдинице)
	|					И ОтчетКомиссионера.Запасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|				ТОГДА ОтчетКомиссионера.Запасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору.Наименование
	|			ИНАЧЕ ОтчетКомиссионера.Запасы.Номенклатура.ЕдиницаИзмерения.Наименование
	|		КОНЕЦ КАК ЕдиницаИзмеренияПоОКЕИ_Наименование,
	|		ВЫБОР
	|			КОГДА ОтчетКомиссионера.Запасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|					И ПечатьПользовательскихЕдиницИзмерения.Значение = ЗНАЧЕНИЕ(Перечисление.ПечатьПользовательскихЕдиницИзмерения.ФормироватьПечатныйДокументВПользовательскойЕдинице)
	|					И ОтчетКомиссионера.Запасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|				ТОГДА ОтчетКомиссионера.Запасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору.Код
	|			ИНАЧЕ ОтчетКомиссионера.Запасы.Номенклатура.ЕдиницаИзмерения.Код
	|		КОНЕЦ КАК ЕдиницаИзмеренияПоОКЕИ_Код,
	|		ВЫБОР
	|			КОГДА ОтчетКомиссионера.Запасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|					И ПечатьПользовательскихЕдиницИзмерения.Значение <> ЗНАЧЕНИЕ(Перечисление.ПечатьПользовательскихЕдиницИзмерения.ФормироватьПечатныйДокументВПользовательскойЕдинице)
	|				ТОГДА ОтчетКомиссионера.Запасы.ЕдиницаИзмерения.Коэффициент
	|			ИНАЧЕ 1
	|		КОНЕЦ КАК КоэффициентЕдиницыИзмерения,
	|		Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Количество КАК Количество,
	|		ВЫБОР
	|			КОГДА ОтчетКомиссионера.Запасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|					И ПечатьПользовательскихЕдиницИзмерения.Значение = ЗНАЧЕНИЕ(Перечисление.ПечатьПользовательскихЕдиницИзмерения.ФормироватьПечатныйДокументВПользовательскойЕдинице)
	|					И ОтчетКомиссионера.Запасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|				ТОГДА 1
	|			КОГДА ОтчетКомиссионера.Запасы.ЕдиницаИзмерения ССЫЛКА Справочник.КлассификаторЕдиницИзмерения
	|				ТОГДА 1
	|			ИНАЧЕ ОтчетКомиссионера.Запасы.ЕдиницаИзмерения.Коэффициент
	|		КОНЕЦ КАК КоличествоВОдномМесте,
	|		Количество КАК КоличествоМест,
	|		СтавкаНДС КАК СтавкаНДС,
	|		0 КАК МассаБрутто,
	|		ВЫБОР
	|			КОГДА &ПечатнаяФормаТолькоВРублях
	|				ТОГДА ВЫБОР
	|						КОГДА ОтчетКомиссионера.Ссылка.Договор.РасчетыВУсловныхЕдиницах
	|								И ОтчетКомиссионера.Ссылка.ВалютаДокумента <> &НациональнаяВалюта
	|							ТОГДА ВЫРАЗИТЬ(ОтчетКомиссионера.Запасы.Цена * ОтчетКомиссионера.Курс / ОтчетКомиссионера.Кратность КАК ЧИСЛО(15, 2))
	|						ИНАЧЕ ОтчетКомиссионера.Запасы.Цена
	|					КОНЕЦ
	|			ИНАЧЕ ОтчетКомиссионера.Запасы.Цена
	|		КОНЕЦ КАК Цена,
	|		ВЫБОР
	|			КОГДА &ПечатнаяФормаТолькоВРублях
	|				ТОГДА ВЫБОР
	|						КОГДА ОтчетКомиссионера.Ссылка.Договор.РасчетыВУсловныхЕдиницах
	|								И ОтчетКомиссионера.Ссылка.ВалютаДокумента <> &НациональнаяВалюта
	|							ТОГДА ВЫРАЗИТЬ(ОтчетКомиссионера.Запасы.Сумма * ОтчетКомиссионера.Курс / ОтчетКомиссионера.Кратность КАК ЧИСЛО(15, 2))
	|						ИНАЧЕ ОтчетКомиссионера.Запасы.Сумма
	|					КОНЕЦ
	|			ИНАЧЕ ОтчетКомиссионера.Запасы.Сумма
	|		КОНЕЦ КАК Сумма,
	|		ВЫБОР
	|			КОГДА &ПечатнаяФормаТолькоВРублях
	|				ТОГДА ВЫБОР
	|						КОГДА ОтчетКомиссионера.Ссылка.Договор.РасчетыВУсловныхЕдиницах
	|								И ОтчетКомиссионера.Ссылка.ВалютаДокумента <> &НациональнаяВалюта
	|							ТОГДА ВЫРАЗИТЬ(ОтчетКомиссионера.Запасы.СуммаНДС * ОтчетКомиссионера.Курс / ОтчетКомиссионера.Кратность КАК ЧИСЛО(15, 2))
	|						ИНАЧЕ ОтчетКомиссионера.Запасы.СуммаНДС
	|					КОНЕЦ
	|			ИНАЧЕ ОтчетКомиссионера.Запасы.СуммаНДС
	|		КОНЕЦ КАК СуммаНДС,
	|		ВЫБОР
	|			КОГДА &ПечатнаяФормаТолькоВРублях
	|				ТОГДА ВЫБОР
	|						КОГДА ОтчетКомиссионера.Ссылка.Договор.РасчетыВУсловныхЕдиницах
	|								И ОтчетКомиссионера.Ссылка.ВалютаДокумента <> &НациональнаяВалюта
	|							ТОГДА ВЫРАЗИТЬ(ОтчетКомиссионера.Запасы.Всего * ОтчетКомиссионера.Курс / ОтчетКомиссионера.Кратность КАК ЧИСЛО(15, 2))
	|						ИНАЧЕ ОтчетКомиссионера.Запасы.Всего
	|					КОНЕЦ
	|			ИНАЧЕ ОтчетКомиссионера.Запасы.Всего
	|		КОНЕЦ КАК Всего,
	|		Ссылка.Дата КАК ДатаОтгрузочногоДокумента,
	|		Ссылка.Номер КАК НомерОтгрузочногоДокумента,
	|		СтранаПроисхождения КАК СтранаСсылка,
	|		ПРЕДСТАВЛЕНИЕ(ОтчетКомиссионера.Запасы.СтранаПроисхождения) КАК СтранаПредставление,
	|		СтранаПроисхождения.Код КАК СтранаКод,
	|		НомерГТД.РегистрационныйНомер КАК ПредставлениеГТД,
	|		КлючСвязи КАК КлючСвязи,
	|		ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|		КодТНВЭД КАК КодТНВЭД,
	|		ИдентификаторСтроки КАК ИдентификаторСтроки,
	|		ВЫБОР
	|			КОГДА ОтчетКомиссионера.Запасы.ПрослеживаемыйТовар
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПрослеживаемыйТоварЧисло,
	|		ВЫБОР
	|			КОГДА ОтчетКомиссионера.Запасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|				ТОГДА ВЫБОР
	|						КОГДА ОтчетКомиссионера.Запасы.КодТНВЭД = ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|								ИЛИ ОтчетКомиссионера.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС)
	|								ИЛИ НЕ ОтчетКомиссионера.Ссылка.Контрагент.СтранаРегистрации.УчастникЕАЭС
	|							ТОГДА ОтчетКомиссионера.Запасы.Номенклатура.ТоварнаяНоменклатураВЭД.ЕдиницаИзмерения.Код
	|						ИНАЧЕ ОтчетКомиссионера.Запасы.КодТНВЭД.ЕдиницаИзмерения.Код
	|					КОНЕЦ
	|			ИНАЧЕ """"
	|		КОНЕЦ КАК КодТНВЭДЕдиницаИзмеренияКод,
	|		ВЫБОР
	|			КОГДА ОтчетКомиссионера.Запасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|				ТОГДА ВЫБОР
	|						КОГДА ОтчетКомиссионера.Запасы.КодТНВЭД = ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|								ИЛИ ОтчетКомиссионера.Запасы.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС)
	|								ИЛИ НЕ ОтчетКомиссионера.Запасы.Ссылка.Контрагент.СтранаРегистрации.УчастникЕАЭС
	|							ТОГДА ОтчетКомиссионера.Запасы.Номенклатура.ТоварнаяНоменклатураВЭД.ЕдиницаИзмерения.Наименование
	|						ИНАЧЕ ОтчетКомиссионера.Запасы.КодТНВЭД.ЕдиницаИзмерения.Наименование
	|					КОНЕЦ
	|			ИНАЧЕ """"
	|		КОНЕЦ КАК КодТНВЭДЕдиницаИзмеренияНаименование
	|	) КАК ТаблицаЗапасы,
	|	ОтчетКомиссионера.Покупатели.(
	|		Покупатель КАК Покупатель,
	|		СчетФактура КАК СчетФактура,
	|		НЕОПРЕДЕЛЕНО КАК СведенияОПокупателе,
	|		НЕОПРЕДЕЛЕНО КАК СведенияОГрузополучателе,
	|		Всего КАК Всего,
	|		КлючСвязи КАК КлючСвязи
	|	) КАК ТаблицаПокупателей,
	|	ЛОЖЬ КАК ЕстьПрослеживаемыеТовары,
	|	ОтчетКомиссионера.ВыписыватьСчетаФактурыСводно КАК ВыписыватьСчетаФактурыСводно,
	|	ОтчетКомиссионера.СведенияПрослеживаемости.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		РНПТ КАК РНПТ,
	|		Количество КАК Количество,
	|		КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|		ИдентификаторСтроки КАК ИдентификаторСтроки
	|	) КАК СведенияПрослеживаемости
	|ИЗ
	|	Документ.ОтчетКомиссионера КАК ОтчетКомиссионера,
	|	Константа.НациональнаяВалюта КАК НациональнаяВалюта,
	|	Константа.ПечатьПользовательскихЕдиницИзмерения КАК ПечатьПользовательскихЕдиницИзмерения
	|ГДЕ
	|	ОтчетКомиссионера.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтчетКомиссионера.Запасы.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетКомиссионераЗапасы.Ссылка КАК Ссылка,
	|	ОтчетКомиссионераЗапасы.НомерСтроки КАК НомерСтроки,
	|	ОтчетКомиссионераЗапасы.Номенклатура КАК Номенклатура,
	|	ОтчетКомиссионераЗапасы.Количество КАК Количество,
	|	ОтчетКомиссионераЗапасы.Характеристика КАК Характеристика,
	|	ОтчетКомиссионераЗапасы.СерииНоменклатуры КАК СерииНоменклатуры,
	|	ОтчетКомиссионераЗапасы.Цена КАК Цена,
	|	ОтчетКомиссионераЗапасы.Сумма КАК Сумма,
	|	ОтчетКомиссионераЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ОтчетКомиссионераЗапасы.СуммаНДС КАК СуммаНДС,
	|	ОтчетКомиссионераЗапасы.Всего КАК Всего,
	|	ОтчетКомиссионераЗапасы.ЦенаПередачи КАК ЦенаПередачи,
	|	ОтчетКомиссионераЗапасы.СуммаПередачи КАК СуммаПередачи,
	|	ОтчетКомиссионераЗапасы.СуммаНДСПередачи КАК СуммаНДСПередачи,
	|	ОтчетКомиссионераЗапасы.СуммаВознаграждения КАК СуммаВознаграждения,
	|	ОтчетКомиссионераЗапасы.СуммаНДСВознаграждения КАК СуммаНДСВознаграждения,
	|	ОтчетКомиссионераЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ОтчетКомиссионераЗапасы.Партия КАК Партия,
	|	ОтчетКомиссионераЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ОтчетКомиссионераЗапасы.КлючСвязи КАК КлючСвязи,
	|	ОтчетКомиссионераЗапасы.КлючСвязиСерииНоменклатуры КАК КлючСвязиСерииНоменклатуры,
	|	ОтчетКомиссионераЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ОтчетКомиссионераЗапасы.НомерГТД КАК НомерГТД,
	|	ОтчетКомиссионераЗапасы.ПрямоеСписаниеГТД КАК ПрямоеСписаниеГТД,
	|	ОтчетКомиссионераЗапасы.Себестоимость КАК Себестоимость,
	|	ОтчетКомиссионераЗапасы.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	ОтчетКомиссионераЗапасы.КодТНВЭД КАК КодТНВЭД,
	|	ОтчетКомиссионераЗапасы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионераЗапасы.ПрослеживаемыйТовар
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПрослеживаемыйТоварЧисло,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионераЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|			ТОГДА ВЫБОР
	|					КОГДА ОтчетКомиссионераЗапасы.КодТНВЭД = ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|							ИЛИ ОтчетКомиссионераЗапасы.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС)
	|							ИЛИ НЕ ОтчетКомиссионераЗапасы.Ссылка.Контрагент.СтранаРегистрации.УчастникЕАЭС
	|						ТОГДА ОтчетКомиссионераЗапасы.Номенклатура.ТоварнаяНоменклатураВЭД.ЕдиницаИзмерения.Код
	|					ИНАЧЕ ОтчетКомиссионераЗапасы.КодТНВЭД.ЕдиницаИзмерения.Код
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодТНВЭДЕдиницаИзмеренияКод,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионераЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|			ТОГДА ВЫБОР
	|					КОГДА ОтчетКомиссионераЗапасы.КодТНВЭД = ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|							ИЛИ ОтчетКомиссионераЗапасы.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС)
	|							ИЛИ НЕ ОтчетКомиссионераЗапасы.Ссылка.Контрагент.СтранаРегистрации.УчастникЕАЭС
	|						ТОГДА ОтчетКомиссионераЗапасы.Номенклатура.ТоварнаяНоменклатураВЭД.ЕдиницаИзмерения.Наименование
	|					ИНАЧЕ ОтчетКомиссионераЗапасы.КодТНВЭД.ЕдиницаИзмерения.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодТНВЭДЕдиницаИзмеренияНаименование,
	|	ОтчетКомиссионераЗапасы.Ссылка.Дата КАК ДатаОтгрузочногоДокумента,
	|	ОтчетКомиссионераЗапасы.Ссылка.Номер КАК НомерОтгрузочногоДокумента,
	|	"""" КАК Содержание,
	|	ОтчетКомиссионераЗапасы.Номенклатура.Наименование КАК ПредставлениеНоменклатуры,
	|	ОтчетКомиссионераЗапасы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ОтчетКомиссионераЗапасы.Номенклатура.Код КАК ЗапасКод,
	|	ОтчетКомиссионераЗапасы.Номенклатура.Артикул КАК Артикул,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионераЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И ОтчетКомиссионераЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ОтчетКомиссионераЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору.Наименование
	|		ИНАЧЕ ОтчетКомиссионераЗапасы.Номенклатура.ЕдиницаИзмерения.Наименование
	|	КОНЕЦ КАК ЕдиницаИзмеренияПоОКЕИ_Наименование,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионераЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И ОтчетКомиссионераЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ОтчетКомиссионераЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору.Код
	|		ИНАЧЕ ОтчетКомиссионераЗапасы.Номенклатура.ЕдиницаИзмерения.Код
	|	КОНЕЦ КАК ЕдиницаИзмеренияПоОКЕИ_Код,
	|	ОтчетКомиссионераЗапасы.СтранаПроисхождения.Наименование КАК СтранаПредставление,
	|	ОтчетКомиссионераЗапасы.СтранаПроисхождения.Код КАК СтранаКод,
	|	ОтчетКомиссионераЗапасы.НомерГТД.РегистрационныйНомер КАК ПредставлениеГТД,
	|	ОтчетКомиссионераЗапасы.СтранаПроисхождения КАК СтранаСсылка,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионераЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|			ТОГДА ОтчетКомиссионераЗапасы.ЕдиницаИзмерения.Коэффициент
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоэффициентЕдиницыИзмерения,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионераЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				И ОтчетКомиссионераЗапасы.ЕдиницаИзмерения.ЕдиницаИзмеренияПоКлассификатору <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА 1
	|		КОГДА ОтчетКомиссионераЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.КлассификаторЕдиницИзмерения
	|			ТОГДА 1
	|		ИНАЧЕ ОтчетКомиссионераЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК КоличествоВОдномМесте,
	|	ОтчетКомиссионераЗапасы.Количество КАК КоличествоМест
	|ИЗ
	|	Документ.ОтчетКомиссионера.Запасы КАК ОтчетКомиссионераЗапасы
	|ГДЕ
	|	ОтчетКомиссионераЗапасы.Ссылка В(&МассивОбъектов)";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	Результат = МассивРезультатов[0].Выгрузить();
	
	ТЗСтрок = МассивРезультатов[1].Выгрузить();
	Для Каждого ТекущаяСтрока Из Результат Цикл
		
		НайденныеСтроки = ТЗСтрок.НайтиСтроки(Новый Структура("Ссылка", ТекущаяСтрока.Ссылка));
		Если НайденныеСтроки.Количество() > 0 Тогда
			ТекущаяСтрока.ТаблицаЗапасы = ТЗСтрок.Скопировать(НайденныеСтроки);
			ТекущаяСтрока.ЕстьПрослеживаемыеТовары = (ТекущаяСтрока.ТаблицаЗапасы.Итог("ПрослеживаемыйТоварЧисло") > 0);
			Если ТекущаяСтрока.ЕстьПрослеживаемыеТовары Тогда
				ДополнитьСведениямиОПрослеживаемости(ТекущаяСтрока.СведенияПрослеживаемости, ТекущаяСтрока.ТаблицаЗапасы);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьСведениямиОПрослеживаемости(СведенияОПрослеживаемости, ТаблицаДокумента)
	
	МассивИдентифицирующихРеквизитов = Новый Массив();
	МассивИдентифицирующихРеквизитов.Добавить("ИдентификаторСтроки");
	
	ТаблицаДокумента.Колонки.Добавить("СведенияОПрослеживаемости");
	
	Для Каждого СтрокаТаблицыДокумента Из ТаблицаДокумента Цикл
		
		ТаблицаСведенийОПрослеживаемости = НовыйТаблицаСведенийОПрослеживаемости();
		
		ПараметрыОтбора = ПараметрыОтбораСтрокДляРНПТ(МассивИдентифицирующихРеквизитов, СтрокаТаблицыДокумента);
		СтрокиСРНПТ = СведенияОПрослеживаемости.НайтиСтроки(ПараметрыОтбора);
		Для Каждого НайденнаяСтрока Из СтрокиСРНПТ Цикл
			СтрокаСведенийОПрослеживаемости = ТаблицаСведенийОПрослеживаемости.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСведенийОПрослеживаемости, НайденнаяСтрока);
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ТаблицаСведенийОПрослеживаемости) Тогда
			СтрокаТаблицыДокумента.СведенияОПрослеживаемости = ТаблицаСведенийОПрослеживаемости;
		Иначе
			СтрокаТаблицыДокумента.СведенияОПрослеживаемости = Неопределено;;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПараметрыОтбораСтрокДляРНПТ(ИдентифицирующиеРеквизитыСтроки, СтрокаСчетаФактуры)
	
	СтруктураОтбора = Новый Структура;
	Для Каждого ИдентифицирующийРеквизит Из ИдентифицирующиеРеквизитыСтроки Цикл
		СтруктураОтбора.Вставить(ИдентифицирующийРеквизит,СтрокаСчетаФактуры[ИдентифицирующийРеквизит]); 
	КонецЦикла;
	
	Возврат СтруктураОтбора;
	
КонецФункции

Функция НовыйТаблицаСведенийОПрослеживаемости()
	
	ТаблицаСведенийОПрослеживаемости = Новый ТаблицаЗначений();
	ТаблицаСведенийОПрослеживаемости.Колонки.Добавить("ИдентификаторСтроки");
	ТаблицаСведенийОПрослеживаемости.Колонки.Добавить("РНПТ");
	ТаблицаСведенийОПрослеживаемости.Колонки.Добавить("Количество");
	ТаблицаСведенийОПрослеживаемости.Колонки.Добавить("КоличествоПрослеживаемости");
	
	Возврат ТаблицаСведенийОПрослеживаемости;
	
КонецФункции

Функция ДанныеПолученныхДокументовРегУчет(МассивОбъектов, ИспользоватьФаксимиле, ПечатнаяФормаТолькоВРублях = Истина, Ошибки = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ИспользоватьФаксимиле", ИспользоватьФаксимиле);
	Запрос.УстановитьПараметр("ПечатнаяФормаТолькоВРублях", ПечатнаяФормаТолькоВРублях);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтчетКомиссионера.Ссылка КАК Ссылка,
	|	НЕОПРЕДЕЛЕНО КАК ДатаДокумента,
	|	НЕОПРЕДЕЛЕНО КАК Номер,
	|	НЕОПРЕДЕЛЕНО КАК ЦифровойИндексОбособленногоПодразделения,
	|	НЕОПРЕДЕЛЕНО КАК НомерИсправления,
	|	НЕОПРЕДЕЛЕНО КАК ДатаИсправления,
	|	НЕОПРЕДЕЛЕНО КАК ФаксимилеПустая,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСчетФактура.Продажа) КАК ВидОперации,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионера.Контрагент.ГоловнойКонтрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ОтчетКомиссионера.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ ОтчетКомиссионера.Контрагент
	|	КОНЕЦ КАК Организация,
	|	ОтчетКомиссионера.Контрагент КАК ОбособленноеПодразделениеПоставщика,
	|	ОтчетКомиссионера.Контрагент КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Префикс,
	|	НЕОПРЕДЕЛЕНО КАК Логотип,
	|	НЕОПРЕДЕЛЕНО КАК ФаксимилеПечати,
	|	ВЫБОР
	|		КОГДА &ИспользоватьФаксимиле = ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ДаНет.Нет)
	|	КОНЕЦ КАК ИспользоватьФаксимиле,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионера.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.ФизическоеЛицо)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионера.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС)
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК СтатусУПД,
	|	ЛОЖЬ КАК ЭтоСводныйСчетФактура,
	|	ЛОЖЬ КАК ЭтоКорректировка,
	|	ОтчетКомиссионера.Контрагент.БанковскийСчетПоУмолчанию КАК БанковскийСчет,
	|	НЕОПРЕДЕЛЕНО КАК ПредставлениеПодразделения,
	|	НЕОПРЕДЕЛЕНО КАК ПредставлениеСкладаСписания,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионера.Организация.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ОтчетКомиссионера.Организация.ГоловнаяОрганизация
	|		ИНАЧЕ ОтчетКомиссионера.Организация
	|	КОНЕЦ КАК Контрагент,
	|	ОтчетКомиссионера.Организация КАК ОбособленноеПодразделениеПокупателя,
	|	ОтчетКомиссионера.Организация КАК Грузополучатель,
	|	ОтчетКомиссионера.Организация.БанковскийСчетПоУмолчанию КАК БанковскийСчетКонтрагента,
	|	НЕОПРЕДЕЛЕНО КАК АдресДоставки,
	|	ОтчетКомиссионера.Организация.ПодписьРуководителя.РасшифровкаПодписи КАК РасшифровкаПодписиКонтрагента,
	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьНомер,
	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьДата,
	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьВыдана,
	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьЛицо,
	|	ОтчетКомиссионера.Договор.Представление КАК Основание,
	|	ОтчетКомиссионера.Договор.Представление КАК ПредставлениеОснования,
	|	ОтчетКомиссионера.Договор КАК ОснованиеПечатиСсылка,
	|	ВЫБОР
	|		КОГДА &ПечатнаяФормаТолькоВРублях = ИСТИНА
	|			ТОГДА НациональнаяВалюта.Значение
	|		ИНАЧЕ ОтчетКомиссионера.ВалютаДокумента
	|	КОНЕЦ КАК ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА &ПечатнаяФормаТолькоВРублях = ИСТИНА
	|			ТОГДА НациональнаяВалюта.Значение.НаименованиеПолное
	|		ИНАЧЕ ОтчетКомиссионера.ВалютаДокумента.НаименованиеПолное
	|	КОНЕЦ КАК ВалютаНаименование,
	|	ВЫБОР
	|		КОГДА &ПечатнаяФормаТолькоВРублях = ИСТИНА
	|			ТОГДА НациональнаяВалюта.Значение.Код
	|		ИНАЧЕ ОтчетКомиссионера.ВалютаДокумента.Код
	|	КОНЕЦ КАК ВалютаКод,
	|	ОтчетКомиссионера.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ОтчетКомиссионера.НДСВключатьВСтоимость КАК НДСВключатьВСтоимость,
	|	ОтчетКомиссионера.Курс КАК Курс,
	|	ОтчетКомиссионера.Кратность КАК Кратность,
	|	ОтчетКомиссионера.Договор.НомерДоговора КАК ОснованиеНомер,
	|	ОтчетКомиссионера.Договор.ДатаДоговора КАК ОснованиеДата,
	|	НЕОПРЕДЕЛЕНО КАК ТранспортнаяНакладнаяНомер,
	|	НЕОПРЕДЕЛЕНО КАК ТранспортнаяНакладнаяДата,
	|	НЕОПРЕДЕЛЕНО КАК ДолжностьРуководителя,
	|	НЕОПРЕДЕЛЕНО КАК РасшифровкаПодписиРуководителя,
	|	НЕОПРЕДЕЛЕНО КАК ФаксимилеРуководителя,
	|	НЕОПРЕДЕЛЕНО КАК РасшифровкаПодписиГлавногоБухгалтера,
	|	НЕОПРЕДЕЛЕНО КАК ФаксимилеГлавногоБухгалтера,
	|	НЕОПРЕДЕЛЕНО КАК ДолжностьКладовщика,
	|	НЕОПРЕДЕЛЕНО КАК РасшифровкаПодписиКладовщика,
	|	НЕОПРЕДЕЛЕНО КАК ФаксимилеКладовщика,
	|	0 КАК Вес,
	|	0 КАК Объем,
	|	НЕОПРЕДЕЛЕНО КАК НоменклатураДоставки,
	|	НЕОПРЕДЕЛЕНО КАК ПредставлениеНоменклатурыДоставки,
	|	НЕОПРЕДЕЛЕНО КАК КодНоменклатурыДоставки,
	|	НЕОПРЕДЕЛЕНО КАК АртикулНоменклатурыДоставки,
	|	НЕОПРЕДЕЛЕНО КАК СтоимостьДоставки,
	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСДоставки,
	|	НЕОПРЕДЕЛЕНО КАК СуммаНДСДоставки,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторГосКонтракта,
	|	ОтчетКомиссионера.Запасы.(
	|		1 КАК НомерСтроки,
	|		НЕОПРЕДЕЛЕНО КАК Номенклатура,
	|		""Комиссионное вознаграждение"" КАК Содержание,
	|		НЕОПРЕДЕЛЕНО КАК ПредставлениеНоменклатуры,
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга) КАК ТипНоменклатуры,
	|		НЕОПРЕДЕЛЕНО КАК ЗапасКод,
	|		НЕОПРЕДЕЛЕНО КАК Код,
	|		НЕОПРЕДЕЛЕНО КАК Артикул,
	|		НЕОПРЕДЕЛЕНО КАК КодТНВЭД,
	|		НЕОПРЕДЕЛЕНО КАК ЕдиницаИзмеренияПоОКЕИ_Наименование,
	|		НЕОПРЕДЕЛЕНО КАК ЕдиницаИзмеренияПоОКЕИ_Код,
	|		НЕОПРЕДЕЛЕНО КАК Характеристика,
	|		НЕОПРЕДЕЛЕНО КАК ЕдиницаИзмерения,
	|		НЕОПРЕДЕЛЕНО КАК ВидУпаковки,
	|		1 КАК КоэффициентЕдиницыИзмерения,
	|		НЕОПРЕДЕЛЕНО КАК Количество,
	|		НЕОПРЕДЕЛЕНО КАК КоличествоВОдномМесте,
	|		НЕОПРЕДЕЛЕНО КАК КоличествоМест,
	|		СтавкаНДС КАК СтавкаНДС,
	|		0 КАК МассаБрутто,
	|		НЕОПРЕДЕЛЕНО КАК Цена,
	|		ВЫБОР
	|			КОГДА &ПечатнаяФормаТолькоВРублях = ИСТИНА
	|					ИЛИ ОтчетКомиссионера.Запасы.Ссылка.Договор.РасчетыВУсловныхЕдиницах = ИСТИНА
	|						И ОтчетКомиссионера.Запасы.Ссылка.ВалютаДокумента <> НациональнаяВалюта.Значение
	|				ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|							КОГДА ОтчетКомиссионера.СуммаВключаетНДС
	|								ТОГДА ОтчетКомиссионера.Запасы.СуммаВознаграждения
	|							ИНАЧЕ ОтчетКомиссионера.Запасы.СуммаВознаграждения
	|						КОНЕЦ * ОтчетКомиссионера.Курс / ОтчетКомиссионера.Кратность КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА ОтчетКомиссионера.СуммаВключаетНДС
	|							ТОГДА ОтчетКомиссионера.Запасы.СуммаВознаграждения / ((ОтчетКомиссионера.Запасы.СтавкаНДС.Ставка + 100) / 100)
	|						ИНАЧЕ ОтчетКомиссионера.Запасы.СуммаВознаграждения
	|					КОНЕЦ КАК ЧИСЛО(15, 2))
	|		КОНЕЦ КАК Сумма,
	|		ВЫБОР
	|			КОГДА &ПечатнаяФормаТолькоВРублях = ИСТИНА
	|					ИЛИ ОтчетКомиссионера.Запасы.Ссылка.Договор.РасчетыВУсловныхЕдиницах = ИСТИНА
	|						И ОтчетКомиссионера.Запасы.Ссылка.ВалютаДокумента <> НациональнаяВалюта.Значение
	|				ТОГДА ОтчетКомиссионера.Запасы.СуммаНДСВознаграждения * ОтчетКомиссионера.Курс / ОтчетКомиссионера.Кратность
	|			ИНАЧЕ ОтчетКомиссионера.Запасы.СуммаНДСВознаграждения
	|		КОНЕЦ КАК СуммаНДС,
	|		ВЫБОР
	|			КОГДА &ПечатнаяФормаТолькоВРублях = ИСТИНА
	|					ИЛИ ОтчетКомиссионера.Запасы.Ссылка.Договор.РасчетыВУсловныхЕдиницах = ИСТИНА
	|						И ОтчетКомиссионера.Запасы.Ссылка.ВалютаДокумента <> НациональнаяВалюта.Значение
	|				ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|							КОГДА ОтчетКомиссионера.СуммаВключаетНДС
	|								ТОГДА ОтчетКомиссионера.Запасы.СуммаВознаграждения
	|							ИНАЧЕ ОтчетКомиссионера.Запасы.СуммаВознаграждения + ОтчетКомиссионера.Запасы.СуммаНДСВознаграждения
	|						КОНЕЦ * ОтчетКомиссионера.Курс / ОтчетКомиссионера.Кратность КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА ОтчетКомиссионера.СуммаВключаетНДС
	|							ТОГДА ОтчетКомиссионера.Запасы.СуммаВознаграждения
	|						ИНАЧЕ ОтчетКомиссионера.Запасы.СуммаВознаграждения + ОтчетКомиссионера.Запасы.СуммаНДСВознаграждения
	|					КОНЕЦ КАК ЧИСЛО(15, 2))
	|		КОНЕЦ КАК Всего,
	|		Ссылка КАК Ссылка,
	|		Ссылка.Дата КАК ДатаОтгрузочногоДокумента,
	|		Ссылка.Номер КАК НомерОтгрузочногоДокумента,
	|		НЕОПРЕДЕЛЕНО КАК СтранаСсылка,
	|		НЕОПРЕДЕЛЕНО КАК СтранаКод,
	|		НЕОПРЕДЕЛЕНО КАК СтранаПредставление,
	|		НЕОПРЕДЕЛЕНО КАК ПредставлениеГТД
	|	) КАК ТаблицаЗапасы,
	|	ЛОЖЬ КАК ЕстьПрослеживаемыеТовары,
	|	НЕОПРЕДЕЛЕНО КАК ПлатежныеДокументы
	|ИЗ
	|	Документ.ОтчетКомиссионера КАК ОтчетКомиссионера,
	|	Константа.НациональнаяВалюта КАК НациональнаяВалюта
	|ГДЕ
	|	ОтчетКомиссионера.Ссылка В(&МассивОбъектов)";
	
	ДанныеПечати = Запрос.Выполнить().Выгрузить();
	
	ИменаКолонокТЧ =
	"НомерСтроки
	|,Ссылка
	|,Номенклатура
	|,Содержание
	|,ПредставлениеНоменклатуры
	|,ТипНоменклатуры
	|,ЗапасКод
	|,Код
	|,Артикул
	|,КодТНВЭД
	|,ЕдиницаИзмерения
	|,ЕдиницаИзмеренияПоОКЕИ_Наименование
	|,ЕдиницаИзмеренияПоОКЕИ_Код
	|,Характеристика
	|,ВидУпаковки
	|,КоэффициентЕдиницыИзмерения
	|,Количество
	|,КоличествоВОдномМесте
	|,КоличествоМест
	|,СтавкаНДС
	|,МассаБрутто
	|,ДатаОтгрузочногоДокумента
	|,НомерОтгрузочногоДокумента
	|,СтранаСсылка
	|,СтранаКод
	|,СтранаПредставление
	|,ПредставлениеГТД";
	
	Для каждого ДанныеОбъекта Из ДанныеПечати Цикл
		
		ДанныеОбъекта.ТаблицаЗапасы.Свернуть(ИменаКолонокТЧ, "Цена, Сумма, СуммаНДС, Всего");
		
	КонецЦикла;
	
	Возврат ДанныеПечати;
	
КонецФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Обработка.ПечатьСчетФактура.СчетФактураПолученный";
	КомандаПечати.Представление = НСтр("ru = 'Счет-фактура (полученный)'");;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 1;
	
	
КонецПроцедуры

#КонецОбласти

#Область РаботаССериямиНоменклатуры

// Формирует таблицу значений, содержащую данные для проведения по регистру ДвиженияСерийНоменклатуры.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаСерииНоменклатуры(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Если ДокументСсылка.СерииНоменклатуры.Количество()=0 Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерииНоменклатурыГарантии", Новый ТаблицаЗначений);
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДвиженияСерииНоменклатуры", Новый ТаблицаЗначений);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Если СтруктураДополнительныеСвойства.ВидОперации = Перечисления.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионера Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаЗапасы.Период КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ВременнаяТаблицаЗапасы.Период КАК ДатаСобытия,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииСерийНоменклатуры.Расход) КАК Операция,
		|	СерииНоменклатуры.Серия КАК Серия,
		|	ВЫБОР
		|		КОГДА СерииНоменклатуры.Количество = 0
		|			ТОГДА 1
		|		ИНАЧЕ СерииНоменклатуры.Количество
		|	КОНЕЦ КАК Количество,
		|	ВременнаяТаблицаЗапасы.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаЗапасы.Характеристика КАК Характеристика,
		|	ВременнаяТаблицаЗапасы.Организация КАК Организация,
		|	ВременнаяТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ВременнаяТаблицаЗапасы.Партия КАК Партия
		|ИЗ
		|	ВременнаяТаблицаЗапасы КАК ВременнаяТаблицаЗапасы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаСерииНоменклатуры КАК СерииНоменклатуры
		|		ПО ВременнаяТаблицаЗапасы.КлючСвязиСерииНоменклатуры = СерииНоменклатуры.КлючСвязи";
		
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаЗапасы.Период КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ВременнаяТаблицаЗапасы.Период КАК ДатаСобытия,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииСерийНоменклатуры.Приход) КАК Операция,
		|	ВременнаяТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	СерииНоменклатуры.Серия КАК Серия,
		|	ВЫБОР
		|		КОГДА СерииНоменклатуры.Количество = 0
		|			ТОГДА 1
		|		ИНАЧЕ СерииНоменклатуры.Количество
		|	КОНЕЦ КАК Количество,
		|	ВременнаяТаблицаЗапасы.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаЗапасы.Характеристика КАК Характеристика,
		|	ВременнаяТаблицаЗапасы.Партия КАК Партия,
		|	ВременнаяТаблицаЗапасы.Организация КАК Организация
		|ИЗ
		|	ВременнаяТаблицаЗапасы КАК ВременнаяТаблицаЗапасы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаСерииНоменклатуры КАК СерииНоменклатуры
		|		ПО ВременнаяТаблицаЗапасы.КлючСвязиСерииНоменклатуры = СерииНоменклатуры.КлючСвязи";
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не СтруктураДополнительныеСвойства.УчетнаяПолитика.МиграцияСерийНоменклатурыВыполнена Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерииНоменклатурыГарантии", РезультатЗапроса.Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДвиженияСерииНоменклатуры", Новый ТаблицаЗначений);
	Иначе
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДвиженияСерииНоменклатуры", РезультатЗапроса.Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерииНоменклатурыГарантии", Новый ТаблицаЗначений);
	КонецЕсли;
	
КонецПроцедуры // СформироватьТаблицаСерииНоменклатуры()

Процедура СформироватьТаблицаЗапасыВРазрезеГТД(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасыНаСкладах.НомерСтроки) КАК НомерСтроки
	|	,ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения
	|	,ТаблицаЗапасыНаСкладах.Период КАК Период
	|	,ТаблицаЗапасыНаСкладах.Организация КАК Организация
	|	,ТаблицаЗапасыНаСкладах.Номенклатура КАК Номенклатура
	|	,ТаблицаЗапасыНаСкладах.Характеристика КАК Характеристика
	|	,ТаблицаЗапасыНаСкладах.Партия КАК Партия
	|	,ТаблицаЗапасыНаСкладах.НомерГТД КАК НомерГТД
	|	,ТаблицаЗапасыНаСкладах.СтранаПроисхождения КАК СтранаПроисхождения
	|	,СУММА(ТаблицаЗапасыНаСкладах.Количество) КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасыНаСкладах
	|ГДЕ
	|	ТаблицаЗапасыНаСкладах.СтранаПроисхождения <> Значение(Справочник.СтраныМира.Россия)
	|	И ТаблицаЗапасыНаСкладах.СтранаПроисхождения <> Значение(Справочник.СтраныМира.ПустаяСсылка)
	|	И ТаблицаЗапасыНаСкладах.НомерГТД <> Значение(Справочник.НомераГТД.ПустаяСсылка)
	|	И ТаблицаЗапасыНаСкладах.ПрямоеСписаниеГТД
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасыНаСкладах.Период
	|	,ТаблицаЗапасыНаСкладах.Организация
	|	,ТаблицаЗапасыНаСкладах.Номенклатура
	|	,ТаблицаЗапасыНаСкладах.Характеристика
	|	,ТаблицаЗапасыНаСкладах.Партия
	|	,ТаблицаЗапасыНаСкладах.НомерГТД
	|	,ТаблицаЗапасыНаСкладах.СтранаПроисхождения
	|
	|;Выбрать
	|	МИНИМУМ(ТаблицаЗапасыПереданныеНаСкладах.НомерСтроки) КАК НомерСтроки
	|	,ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения
	|	,ТаблицаЗапасыПереданныеНаСкладах.Период КАК Период
	|	,ТаблицаЗапасыПереданныеНаСкладах.Организация КАК Организация
	|	,ТаблицаЗапасыПереданныеНаСкладах.Номенклатура КАК Номенклатура
	|	,ТаблицаЗапасыПереданныеНаСкладах.Характеристика КАК Характеристика
	|	,ТаблицаЗапасыПереданныеНаСкладах.Партия КАК Партия
	|	,ТаблицаЗапасыПереданныеНаСкладах.НомерГТД КАК НомерГТД
	|	,ТаблицаЗапасыПереданныеНаСкладах.СтранаПроисхождения КАК СтранаПроисхождения
	|	,СУММА(ТаблицаЗапасыПереданныеНаСкладах.Количество) КАК Количество
	|	,ТаблицаЗапасыПереданныеНаСкладах.Документ КАК ДокументПередачи
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасыПереданныеНаСкладах
	|ГДЕ
	|	ТаблицаЗапасыПереданныеНаСкладах.СтранаПроисхождения <> Значение(Справочник.СтраныМира.Россия)
	|	И ТаблицаЗапасыПереданныеНаСкладах.СтранаПроисхождения <> Значение(Справочник.СтраныМира.ПустаяСсылка)
	|	И ТаблицаЗапасыПереданныеНаСкладах.НомерГТД <> Значение(Справочник.НомераГТД.ПустаяСсылка)
	|	И НЕ ТаблицаЗапасыПереданныеНаСкладах.ПрямоеСписаниеГТД
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасыПереданныеНаСкладах.Период
	|	,ТаблицаЗапасыПереданныеНаСкладах.Организация
	|	,ТаблицаЗапасыПереданныеНаСкладах.Номенклатура
	|	,ТаблицаЗапасыПереданныеНаСкладах.Характеристика
	|	,ТаблицаЗапасыПереданныеНаСкладах.Партия
	|	,ТаблицаЗапасыПереданныеНаСкладах.НомерГТД
	|	,ТаблицаЗапасыПереданныеНаСкладах.СтранаПроисхождения
	|	,ТаблицаЗапасыПереданныеНаСкладах.Документ";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыВРазрезеГТД", РезультатЗапроса[0].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыПереданныеВРазрезеГТД", РезультатЗапроса[1].Выгрузить());
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	ДокументыУНФКлиентСервер.ПолучитьПредставлениеДокумента(Документы.ОтчетКомиссионера, Данные, Представление,
		СтандартнаяОбработка);
	
	Если Данные.Ссылка.ВидОперации = Перечисления.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионераОВозвратах Тогда
		Представление = СтрЗаменить(Представление, НСтр("ru='Отчет комиссионера'"), НСтр("ru='Отчет комиссионера о возвратах'"));
	Иначе
		Представление = СтрЗаменить(Представление, НСтр("ru='Отчет комиссионера'"), НСтр("ru='Отчет комиссионера о продажах'"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	ДокументыУНФКлиентСервер.ПолучитьПредставлениеПолейДокумента(,Поля, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаДанныхИзВнешнегоИсточника

Процедура ПоляЗагрузкиДанныхИзВнешнегоИсточника(ТаблицаПолейЗагрузки, НастройкиЗагрузкиДанных) Экспорт
	
	//
	// Для группы полей действует правило: хотя бы одно поле в группе должно быть выбрано в колонках
	//
	
	ПолноеИмяОбъектаЗаполнения = НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения;
	
	ОписаниеТиповСтрока11 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(11));
	ОписаниеТиповСтрока25 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(25));
	ОписаниеТиповСтрока30 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(30));
	ОписаниеТиповСтрока50 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50));
	ОписаниеТиповСтрока100 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100));
	ОписаниеТиповСтрока150 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(150));
	ОписаниеТиповСтрока200 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(200));
	ОписаниеТиповСтрока1000 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(1000));
	ОписаниеТиповЧисло15_2 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповЧисло15_3 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповБулево = Новый ОписаниеТипов("Булево");
	
	ЭтоЗапасы = (ПолноеИмяОбъектаЗаполнения = "Документ.ОтчетКомиссионера.ТабличнаяЧасть.Запасы");
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Штрихкод", НСтр("ru = 'Штрихкод'"), ОписаниеТиповСтрока200, ОписаниеТиповКолонка, "Номенклатура", 1, , Истина, ЭтоЗапасы);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Артикул", НСтр("ru = 'Артикул'"), ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Номенклатура", 2, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименование", НСтр("ru = 'Номенклатура (наименование)'"), ОписаниеТиповСтрока100, ОписаниеТиповКолонка, "Номенклатура", 3, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименованиеПолное",НСтр("ru = 'Номенклатура (полное наименование)'"), ОписаниеТиповСтрока1000, ОписаниеТиповКолонка, "Номенклатура", 5, , Истина);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Содержание", НСтр("ru = 'Содержание'"), ОписаниеТиповСтрока1000, ОписаниеТиповСтрока1000, , , , , НастройкиЗагрузкиДанных.СодержаниеВидимо);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "РодительКод",
		НСтр("ru = 'Код'", ОбщегоНазначения.КодОсновногоЯзыка()), 			ОписаниеТиповСтрока11, ОписаниеТиповКолонка, "Родитель", 1);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "РодительНаименование", 
		НСтр("ru = 'Группа (наименование)'", ОбщегоНазначения.КодОсновногоЯзыка()), ОписаниеТиповСтрока100, ОписаниеТиповКолонка, "Родитель", 2);	

	Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
		
		ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры");
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ХарактеристикаНаименование", НСтр("ru = 'Характеристика (наименование)'"), ОписаниеТиповСтрока150, ОписаниеТиповКолонка, "Характеристика", 1);
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ХарактеристикаАртикул", НСтр("ru = 'Характеристика (артикул)'"), ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Характеристика", 2);
		
	КонецЕсли;
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ЭтоУслуга", 
		НСтр("ru = 'Это услуга'", ОбщегоНазначения.КодОсновногоЯзыка()), ОписаниеТиповБулево, ОписаниеТиповБулево); 		
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Картинка", 
		НСтр("ru = 'Картинка'", ОбщегоНазначения.КодОсновногоЯзыка()), ОписаниеТиповСтрока1000, ОписаниеТиповСтрока1000,,,,,Ложь);   		
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.КатегорииНоменклатуры");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "КатегорияНоменклатуры", 
		НСтр("ru = 'Категория номенклатуры'", ОбщегоНазначения.КодОсновногоЯзыка()), ОписаниеТиповСтрока100, ОписаниеТиповКолонка);   
		
	ОписаниеТиповКолонка = Новый ОписаниеТипов("ПланСчетовСсылка.Управленческий");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СчетУчетаДоходов", 
		НСтр("ru = 'Счет учета доходов'"), ОписаниеТиповСтрока100, ОписаниеТиповКолонка,,,,, Ложь);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СчетУчетаЗапасов", 
		НСтр("ru = 'Счет учета запасов'"), ОписаниеТиповСтрока100, ОписаниеТиповКолонка,,,,, Ложь);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СчетУчетаЗатрат", 
		НСтр("ru = 'Счет учета затрат'"), ОписаниеТиповСтрока100, ОписаниеТиповКолонка,,,,, Ложь);

	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.НаправленияДеятельности");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НаправлениеДеятельности",
		НСтр("ru = 'Направление деятельности'", ОбщегоНазначения.КодОсновногоЯзыка()), ОписаниеТиповСтрока100, ОписаниеТиповКолонка);
		
	ОписаниеТиповКолонка = Новый ОписаниеТипов("ПеречислениеСсылка.МетодОценкиЗапасов");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "МетодОценки",
		НСтр("ru = 'Способ списания'", ОбщегоНазначения.КодОсновногоЯзыка()), ОписаниеТиповСтрока100, ОписаниеТиповКолонка);
		
	ОписаниеТиповКолонка = Новый ОписаниеТипов("ПеречислениеСсылка.СпособыПополненияЗапасов");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СпособПополнения",
		НСтр("ru = 'Способ пополнения'", ОбщегоНазначения.КодОсновногоЯзыка()), ОписаниеТиповСтрока100, ОписаниеТиповКолонка);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПартии") Тогда
		
		ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.ПартииНоменклатуры");
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Партия", НСтр("ru = 'Партия (наименование)'"), ОписаниеТиповСтрока150, ОписаниеТиповКолонка);
		
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры") Тогда
		
		ОписаниеТиповКолонка = Новый ОписаниеТипов("Булево");
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ИспользоватьСерииНоменклатуры", 
			НСтр("ru = 'Использовать Серии номенклатуры'", ОбщегоНазначения.КодОсновногоЯзыка()), ОписаниеТиповСтрока25, ОписаниеТиповКолонка);
		
		ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры");
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Серия",
			НСтр("ru = 'Серийный номер'"), ОписаниеТиповСтрока1000, ОписаниеТиповКолонка);
		
	КонецЕсли;
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Количество", НСтр("ru = 'Количество'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_3, , , Истина);
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения, СправочникСсылка.ЕдиницыИзмерения");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ЕдиницаИзмерения", НСтр("ru = 'Ед. изм.'"), ОписаниеТиповСтрока25, ОписаниеТиповКолонка, , , , , ПолучитьФункциональнуюОпцию("УчетВРазличныхЕдиницахИзмерения"));
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Цена", НСтр("ru = 'Цена'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2, , , Ложь);
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СтавкаНДС", НСтр("ru = 'Ставка НДС'"), ОписаниеТиповСтрока25, ОписаниеТиповКолонка, , , Ложь);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Сумма", НСтр("ru = 'Сумма'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2, , , Ложь);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ЦенаПередачи", НСтр("ru = 'Цена передачи'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2, , , Ложь);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СуммаПередачи", НСтр("ru = 'Сумма передачи'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2, , , Ложь);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СуммаВознаграждения", НСтр("ru = 'Сумма вознаграждения'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2, , , Ложь);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СуммаНДСВознаграждения", НСтр("ru = 'Сумма НДС вознаграждения'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2, , , Ложь);
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
	ОписаниеТиповКолонка = Новый ОписаниеТипов(МассивТипов);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Заказ", НСтр("ru = 'Заказ'"), ОписаниеТиповСтрока50, ОписаниеТиповКолонка);
	
КонецПроцедуры

Процедура ПриОпределенииОбразцовЗагрузкиДанных(НастройкиЗагрузкиДанных, УникальныйИдентификатор) Экспорт
	
	Образец_xlsx = ПолучитьМакет("ОбразецЗагрузкиДанных_xlsx");
	ОбразецЗагрузкиДанных_xlsx = ПоместитьВоВременноеХранилище(Образец_xlsx, УникальныйИдентификатор);
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_xlsx", ОбразецЗагрузкиДанных_xlsx);
	
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_mxl", "ОбразецЗагрузкиДанных_mxl");
	
	Образец_csv = ПолучитьМакет("ОбразецЗагрузкиДанных_csv");
	ОбразецЗагрузкиДанных_csv = ПоместитьВоВременноеХранилище(Образец_csv, УникальныйИдентификатор);
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_csv", ОбразецЗагрузкиДанных_csv);
	
КонецПроцедуры

Процедура СопоставитьЗагружаемыеДанныеИзВнешнегоИсточника(ПараметрыСопоставления, АдресРезультата) Экспорт
	
	ТаблицаСопоставленияДанных	= ПараметрыСопоставления.ТаблицаСопоставленияДанных;
	РазмерТаблицыДанных			= ТаблицаСопоставленияДанных.Количество();
	НастройкиЗагрузкиДанных		= ПараметрыСопоставления.НастройкиЗагрузкиДанных;
	НастройкиПоиска				= НастройкиЗагрузкиДанных.НастройкиПоиска;
	
	ТаблицаДублирующихСтрок = ЗагрузкаДанныхИзВнешнегоИсточника.ПустаяТаблицаДублирующихСтрокНоменклатуры();
	НастройкиПоиска.Вставить("ТаблицаДублирующихСтрок", ТаблицаДублирующихСтрок);
	
	ПолноеИмяОбъектаЗаполнения = НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения;
	
	// ТаблицаСопоставленияДанных - Тип ДанныеФормыКоллекция
	Для каждого СтрокаТаблицыФормы Из ТаблицаСопоставленияДанных Цикл
		
		// Номенклатура по ШтрихКоду, Артикулу, Наименованию, НаименованиеПолное
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьНоменклатуру(СтрокаТаблицыФормы, НастройкиПоиска);
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицыФормы, "КатегорияНоменклатуры_ВходящиеДанные")
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицыФормы, "КатегорияНоменклатуры") Тогда
		
			ЗначениеПоУмолчанию = Справочники.КатегорииНоменклатуры.БезКатегории;					
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьКатегориюНоменклатуры(СтрокаТаблицыФормы.КатегорияНоменклатуры, СтрокаТаблицыФормы.КатегорияНоменклатуры_ВходящиеДанные, ЗначениеПоУмолчанию);
			
		КонецЕсли;
		
		Если ПолноеИмяОбъектаЗаполнения = "Документ.ОтчетКомиссионера.ТабличнаяЧасть.Запасы" Тогда
			
			Если СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Запас Тогда
				
				СтрокаТаблицыФормы.Номенклатура = Неопределено;
				
			КонецЕсли;
			
			СтрокаТаблицыФормы.СчетУчетаЗапасов = ПланыСчетов.Управленческий.СырьеИМатериалы;
			СтрокаТаблицыФормы.СчетУчетаЗатрат = ?(ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуПроизводство"), 
				ПланыСчетов.Управленческий.НезавершенноеПроизводство, ПланыСчетов.Управленческий.КоммерческиеРасходы);
			СтрокаТаблицыФормы.СчетУчетаДоходов = ?(СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПодарочныйСертификат"), 
				ПланыСчетов.Управленческий.ПрочиеДоходы, ПланыСчетов.Управленческий.ПустаяСсылка());
				
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицыФормы, "НаправлениеДеятельности") Тогда
					
				ЗначениеПоУмолчанию = Справочники.НаправленияДеятельности.Прочее;
				ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьНаправлениеДеятельности(СтрокаТаблицыФормы.НаправлениеДеятельности, СтрокаТаблицыФормы.НаправлениеДеятельности_ВходящиеДанные, ЗначениеПоУмолчанию);
				
			КонецЕсли;
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицыФормы, "МетодОценки") Тогда
					
				ЗначениеПоУмолчанию = Перечисления.МетодОценкиЗапасов.ПоСредней;
				ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьМетодОценки(СтрокаТаблицыФормы.МетодОценки, СтрокаТаблицыФормы.МетодОценки_ВходящиеДанные, ЗначениеПоУмолчанию);
				
			КонецЕсли;
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицыФормы, "СпособПополнения") Тогда
					
				ЗначениеПоУмолчанию = Перечисления.СпособыПополненияЗапасов.Закупка;
				ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьСпособПополнения(СтрокаТаблицыФормы.СпособПополнения, СтрокаТаблицыФормы.СпособПополнения_ВходящиеДанные, ЗначениеПоУмолчанию);
				
			КонецЕсли;
			
			Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
				
				Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура) Тогда
					
					// Характеристика по Владельцу и Наименованию
					ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьХарактеристику(СтрокаТаблицыФормы);
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицыФормы, "Родитель")
				И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицыФормы, "РодительНаименование")
				И ЗначениеЗаполнено(СтрокаТаблицыФормы.РодительНаименование) Тогда
				
				ЗначениеПоУмолчанию = Справочники.Номенклатура.ПустаяСсылка();
				ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьРодителяНоменклатуры(СтрокаТаблицыФормы.Родитель, "", СтрокаТаблицыФормы.РодительНаименование, ЗначениеПоУмолчанию);
				
			КонецЕсли;
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицыФормы, "ЭтоУслуга_ВходящиеДанные") Тогда
				
				СтрокаТаблицыФормы.ЭтоУслуга = СтрокаТаблицыФормы.ЭтоУслуга_ВходящиеДанные;
				
			КонецЕсли;
			
			Если ПолучитьФункциональнуюОпцию("ИспользоватьПартии") Тогда
				
				Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура) Тогда
					
					// Партия по Владельцу и Наименованию
					ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьПартию(СтрокаТаблицыФормы.Партия, СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.Штрихкод, СтрокаТаблицыФормы.Партия_ВходящиеДанные);
					
				КонецЕсли;
				
			КонецЕсли;
			
			// Серии номенклатуры
			Если ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры") Тогда
				
				Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура) 
					И  ЗначениеЗаполнено(СтрокаТаблицыФормы.Серия_ВходящиеДанные) Тогда
					
					ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьСерия(СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.Серия, СтрокаТаблицыФормы.Серия_ВходящиеДанные);
					
				КонецЕсли;
				
			КонецЕсли;  
			
		КонецЕсли;
		
		// Количество
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Количество, СтрокаТаблицыФормы.Количество_ВходящиеДанные, 1);
		
		// ЕдиницыИзмерения по Наименованию (так же рассмотреть возможность прикрутить пользовательские ЕИ)
		ЗначениеПоУмолчанию = ?(ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура), СтрокаТаблицыФормы.Номенклатура.ЕдиницаИзмерения, Справочники.КлассификаторЕдиницИзмерения.шт);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьЕдиницыИзмерения(СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.ЕдиницаИзмерения, СтрокаТаблицыФормы.ЕдиницаИзмерения_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		// Цена
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Цена, СтрокаТаблицыФормы.Цена_ВходящиеДанные, 1);
		
		// СтавкаНДС по наименованию
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьСтавкуНДС(СтрокаТаблицыФормы.СтавкаНДС, СтрокаТаблицыФормы.СтавкаНДС_ВходящиеДанные, Неопределено);
		
		// Заказ по номеру, дате, признаку
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьЗаказ(СтрокаТаблицыФормы.Заказ, СтрокаТаблицыФормы.Заказ_ВходящиеДанные);
		
		ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения);
		
		ЗагрузкаДанныхИзВнешнегоИсточника.ПрогрессСопоставленияДанных(ТаблицаСопоставленияДанных.Индекс(СтрокаТаблицыФормы), РазмерТаблицыДанных);
		
	КонецЦикла;
	
	ТаблицаСопоставленияДанных.ЗагрузитьКолонку(ТаблицаДублирующихСтрок.ВыгрузитьКолонку("КлючСвязи"), "_КлючСвязи");
	ПоместитьВоВременноеХранилище(ТаблицаСопоставленияДанных, АдресРезультата);
	
КонецПроцедуры

Процедура ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения = "") Экспорт
	
	ИмяСлужебногоПоля = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна();
	
	НоменклатураЗаполнена = ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура);
	ЗагрузкаНоменклатурыВозможна = Ложь;
	Если НЕ НоменклатураЗаполнена Тогда
		ЗагрузкаНоменклатурыВозможна = (ЗначениеЗаполнено(СтрокаТаблицыФормы.НоменклатураНаименование) ИЛИ ЗначениеЗаполнено(СтрокаТаблицыФормы.НоменклатураНаименованиеПолное));
	КонецЕсли;
	
	Если ПолноеИмяОбъектаЗаполнения = "Документ.ОтчетКомиссионера.ТабличнаяЧасть.Запасы" Тогда
		Если НоменклатураЗаполнена Тогда
				
			СтрокаТаблицыФормы[ИмяСлужебногоПоля] = СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас
			И НЕ СтрокаТаблицыФормы.Номенклатура.ЭтоНабор // Исключая наборы
			И СтрокаТаблицыФормы.Количество <> 0;
			СтрокаТаблицыФормы._СтрокаСопоставлена = НоменклатураЗаполнена;
			
		Иначе
			
			СтрокаТаблицыФормы[ИмяСлужебногоПоля] = ЗагрузкаНоменклатурыВозможна И НЕ СтрокаТаблицыФормы.ЭтоУслуга;
			
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли