#Область СлужебныйПрограммныйИнтерфейс

Функция АдресДанныхПроверкиМаркируемойПродукцииЧекККМ(ПараметрыСканирования, Знач Объект, УникальныйИдентификатор, ВидМаркируемойПродукции) Экспорт
	
	СписокШтрихкодов = Объект.АкцизныеМарки.Выгрузить().ВыгрузитьКолонку("АкцизнаяМарка");
	ШтрихкодыМаркируемойПродукции = ИнтеграцияИСУНФ.ШтрихкодыСодержащиеВидыПродукции(
		СписокШтрихкодов,
		ВидМаркируемойПродукции);
	
	ДанныеПроверяемогоДокумента = ШтрихкодированиеИС.ВложенныеШтрихкодыУпаковок(
		ШтрихкодыМаркируемойПродукции, ПараметрыСканирования);
		
	// обработка ранее заведенных штрихкодов, содержащих в поле Серия ссылку на справочник ПартииНоменклатуры
	Для Каждого Элемент Из ДанныеПроверяемогоДокумента.МаркированныеТовары Цикл
		Если ТипЗнч(Элемент.Серия) = Тип("СправочникСсылка.ПартииНоменклатуры") Тогда
			Элемент.Серия = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаМаркируемойПродукции = ПроверкаИПодборПродукцииИСМП.ТаблицаМаркируемойПродукцииДокумента(Объект, ВидМаркируемойПродукции);
	
	Для Каждого Элемент Из ТаблицаМаркируемойПродукции Цикл
		
		Если ТипЗнч(Элемент.Серия) = Тип("СправочникСсылка.ПартииНоменклатуры") 
			Или ТипЗнч(Элемент.Серия) = Тип("СправочникСсылка.СерииНоменклатуры") И НЕ ЗначениеЗаполнено(Элемент.Серия) Тогда
			Элемент.Серия = Неопределено;
		КонецЕсли;
		
	КонецЦикла;

	ДанныеХранилища = Новый Структура("ДеревоУпаковок, МаркированныеТовары, ТаблицаМаркируемойПродукции",
		ДанныеПроверяемогоДокумента.ДеревоУпаковок,
		ДанныеПроверяемогоДокумента.МаркированныеТовары,
		ТаблицаМаркируемойПродукции);
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеХранилища, УникальныйИдентификатор);
	
КонецФункции

Функция ПолучитьСтруктурнуюЕдиницуПоУмолчанию(Документ) Экспорт
	
	ПравилаЗаполненияДляСтруктурнойЕдиницы = Новый Соответствие;
	ЗаполнениеОбъектовУНФПереопределяемый.ПриОпределенииПравилУстановкиСтруктурныхЕдиниц(
	ПравилаЗаполненияДляСтруктурнойЕдиницы);
	
	ПредопределеннаяСтруктурнаяЕдиница = ПравилаЗаполненияДляСтруктурнойЕдиницы[ТипЗнч(Документ.ПолучитьОбъект())];
	
	Возврат ПредопределеннаяСтруктурнаяЕдиница;
	
КонецФункции

#КонецОбласти