#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Оповестить("Запись_УзелПланаОбмена");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ОбменДаннымиСервер.ФормаУзлаПриЗаписиНаСервере(ТекущийОбъект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ОбменДаннымиКлиент.ФормаНастройкиПередЗакрытием(Отказ, ЭтотОбъект, ЗавершениеРаботы);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Для Каждого СтрокаДанных Из Объект.КассыККМ Цикл
		Если Объект.Организации.Количество() > 0 Тогда
			СтрокаДанных.Организация = Объект.Организации[0].Организация;
		КонецЕсли;
	КонецЦикла

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.ПравилаПолученияДанных Тогда
		ЗаполнитьНастройкиПолученияДанныхПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентВозвратаПриИзменении(Элемент)
	
	ЗаполнитьДоговорПоУмолчанию();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНастройкиПолученияДанныхПоУмолчанию()
	
	ОрганизацияТорговогоОбъекта = ?(ЗначениеЗаполнено(Объект.ТорговыйОбъект),
										ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ТорговыйОбъект, "Организация"),
										Неопределено);
										
	Если НЕ ЗначениеЗаполнено(Объект.КассаВозврата) Тогда
											
		Объект.КассаВозврата 	= ?(ЗначениеЗаполнено(ОрганизацияТорговогоОбъекта),
										ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОрганизацияТорговогоОбъекта, "КассаПоУмолчанию"),
										Неопределено)
	КонецЕсли;										
										
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		
		ОрганизацияДоговора		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор, "Организация");
		
		Если ОрганизацияДоговора <> ОрганизацияТорговогоОбъекта Тогда
			Объект.Договор		= Неопределено;
		КонецЕсли;
		
	КонецЕсли;										
									
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоговорПоУмолчанию()
	
	СписокВидовДоговора = Новый СписокЗначений;
	СписокВидовДоговора.Добавить(Перечисления.ВидыДоговоров.СПокупателем);
	
	Объект.Договор = Справочники.ДоговорыКонтрагентов.ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(Объект.КонтрагентВозврата, ОрганизацияТорговогоОбъекта, СписокВидовДоговора);
	
КонецПроцедуры

#КонецОбласти