#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// Вызывается при работе в модели сервиса для получения сведений о предопределенных вариантах отчета.
//
// Возвращаемое значение:
//  Массив из Структура:
//    * Имя           - Строка - имя варианта отчета; например, "Основной";
//    * Представление - Строка - имя варианта отчета; например, НСтр("ru = 'Динамика изменений файлов'").
//
Функция ВариантыНастроек() Экспорт 
	
	Результат = Новый Массив;
	Результат.Добавить(Новый Структура("Имя, Представление", "МониторРасчетовСПокупателями", 
		НСтр("ru = 'Монитор расчетов с покупателями'")));
	Результат.Добавить(Новый Структура("Имя, Представление", "МониторРасчетовСПоставщиками", 
		НСтр("ru = 'Монитор расчетов с поставщиками'")));
	Результат.Добавить(Новый Структура("Имя, Представление", "МониторДенежныеСредства", 
		НСтр("ru = 'Монитор денег'")));
	Результат.Добавить(Новый Структура("Имя, Представление", "МониторОбщиеПоказатели", 
		НСтр("ru = 'Монитор общих показателей бизнеса'")));
	Результат.Добавить(Новый Структура("Имя, Представление", "МониторРуководителя", 
		НСтр("ru = 'Монитор руководителя (старый)'")));
	Результат.Добавить(Новый Структура("Имя, Представление", "МониторПульсБизнеса", 
		НСтр("ru = 'Пульс бизнеса'")));
	Результат.Добавить(Новый Структура("Имя, Представление", "МониторРуководителяНовый", 
		НСтр("ru = 'Монитор руководителя (новый)'")));
	Возврат Результат;
	
КонецФункции

// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//   НастройкиОтчета - см. ВариантыОтчетов.ОписаниеОтчета.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Ложь);
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СлужебныйОтчетДобавлениеВПанельОтчетов, "МониторРасчетовСПокупателями");
	Вариант.Описание = НСтр("ru = 'Монитор отображает состояние расчетов с покупателями.'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СлужебныйОтчетДобавлениеВПанельОтчетов, "МониторРасчетовСПоставщиками");
	Вариант.Описание = НСтр("ru = 'Монитор отображает состояние расчетов с поставщиками.'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СлужебныйОтчетДобавлениеВПанельОтчетов, "МониторДенежныеСредства");
	Вариант.Описание = НСтр("ru = 'Монитор отображает динамику движения денежных средств.'");
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Деньги.Подсистемы.Деньги);
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СлужебныйОтчетДобавлениеВПанельОтчетов, "МониторОбщиеПоказатели");
	Вариант.Описание = НСтр("ru = 'Монитор отображает основные показатели состояния бизнеса.'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СлужебныйОтчетДобавлениеВПанельОтчетов, "МониторРуководителя");
	Вариант.Описание = НСтр("ru = 'Монитор отображает основные показатели состояния бизнеса.'");
	Вариант.Размещение.Вставить(Метаданные.Подсистемы.Компания.Подсистемы.Компания, "СмТакже");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СлужебныйОтчетДобавлениеВПанельОтчетов, "МониторРуководителяНовый");
	Вариант.Описание = НСтр("ru = 'Монитор отображает основные показатели состояния бизнеса.'");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СлужебныйОтчетДобавлениеВПанельОтчетов, "МониторПульсБизнеса");
	Вариант.Описание = НСтр("ru = 'Монитор отображает заданные пользователем показатели и диаграммы, характеризующие состояния бизнеса.'");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)

	Если Не Параметры.Свойство("КлючВарианта") Тогда
		ВызватьИсключение НСтр("ru = 'Служебный отчет не предназначен для непосредственного использования'");
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	Параметры.Вставить("ОткрытаНеНаНачальнойСтранице", Истина);

	ИменаФормПоКлючуВарианта = Новый Соответствие;
	ИменаФормПоКлючуВарианта["МониторРасчетовСПокупателями"] = "Обработка.УдалитьМониторыРуководителя.Форма.РасчетыСПокупателями";
	ИменаФормПоКлючуВарианта["МониторРасчетовСПоставщиками"] = "Обработка.УдалитьМониторыРуководителя.Форма.РасчетыСПоставщиками";
	ИменаФормПоКлючуВарианта["МониторДенежныеСредства"] = "Обработка.УдалитьМониторыРуководителя.Форма.ДенежныеСредства";
	ИменаФормПоКлючуВарианта["МониторОбщиеПоказатели"] = "Обработка.УдалитьМониторыРуководителя.Форма.ОбщиеПоказатели";
	ИменаФормПоКлючуВарианта["МониторРуководителя"] = "Обработка.УдалитьМониторыРуководителя.Форма";
	ИменаФормПоКлючуВарианта["МониторРуководителяНовый"] = "Обработка.УдалитьМониторыРуководителя.Форма.МониторРуководителяНовый";
	ИменаФормПоКлючуВарианта["МониторПульсБизнеса"] = "Обработка.ПульсБизнеса.Форма";

	ВыбраннаяФорма = ИменаФормПоКлючуВарианта[Параметры.КлючВарианта];

КонецПроцедуры

#КонецОбласти

#КонецЕсли