#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает ФИО по указанному физ. лицу.
// 
// Параметры:
// 	ДатаАктуальности - Дата - дата актуальности,
// 	ФизЛицо - СправочникСсылка.ФизическиеЛица - физическое лицо.
// Возвращаемое значение:
// 	Строка - Фамилия, инициалы физ. лица.
Функция ФИОФизЛица(ДатаАктуальности, ФизЛицо) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ФИОФизЛицСрезПоследних.Фамилия КАК Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя КАК Имя,
	|	ФИОФизЛицСрезПоследних.Отчество КАК Отчество
	|ИЗ
	|	РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ФизЛицо = &ФизЛицо) КАК ФИОФизЛицСрезПоследних");

	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда

		Возврат "";

	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	Возврат ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Выборка);

КонецФункции

#КонецОбласти

#КонецЕсли