#Область ПрограммныйИнтерфейс

// См. МенеджерОбменаЧерезУниверсальныйФормат.ЗаполнитьПравилаОбработкиДанных.
//
Процедура ЗаполнитьПравилаОбработкиДанных(НаправлениеОбмена, ПравилаОбработкиДанных) Экспорт
	
	МенеджерОбменаУРМКУНФ.ЗаполнитьПравилаОбработкиДанных(НаправлениеОбмена, ПравилаОбработкиДанных);
	
КонецПроцедуры

// См. МенеджерОбменаЧерезУниверсальныйФормат.ЗаполнитьПравилаКонвертацииОбъектов.
//
Процедура ЗаполнитьПравилаКонвертацииОбъектов(НаправлениеОбмена, ПравилаКонвертации) Экспорт
	
	МенеджерОбменаУРМКУНФ.ЗаполнитьПравилаКонвертацииОбъектов(НаправлениеОбмена, ПравилаКонвертации);
	
КонецПроцедуры

// См. МенеджерОбменаЧерезУниверсальныйФормат.ВыполнитьПроцедуруМодуляМенеджера.
//
Процедура ВыполнитьПроцедуруМодуляМенеджера(ИмяПроцедуры, Параметры) Экспорт
	
	МенеджерОбменаУРМКУНФ.ВыполнитьПроцедуруМодуляМенеджера(ИмяПроцедуры, Параметры);
	
КонецПроцедуры

#КонецОбласти
