
&После("ОбработкаЗаполнения")
Процедура _ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("_Продукт") Тогда
			Если ЗначениеЗаполнено(ДанныеЗаполнения._Продукт) Тогда
				_Продукт = ДанныеЗаполнения._Продукт;
				_ШаблонПечати = _Продукт.ВидВнутреннегоДокумента;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура _ПередЗаписью(Отказ)
	
	ЧитаемыеСимволы = "0123456789";
	
	АнализируемыйТекст = НомерДоговора;
	ИтоговаяСтрока = "";
	НомерСимвола = 0;
	ДлинаНомера = СтрДлина(АнализируемыйТекст);
	Для Итератор = 1 ПО ДлинаНомера Цикл
		НомерСимвола = ДлинаНомера - Итератор + 1;
        ТекущийСимвол = Сред(АнализируемыйТекст, НомерСимвола, 1); 
        // Заменяемые символы. Системный набор значений: "Символы":  
        Если Найти(ЧитаемыеСимволы, ТекущийСимвол) > 0 Тогда 
            ИтоговаяСтрока = ТекущийСимвол + ИтоговаяСтрока;
		Иначе
			Прервать;
        КонецЕсли; 
	КонецЦикла;
	
	Попытка
		_НомерЧисло = Число(ИтоговаяСтрока);
		_Префикс = Лев(АнализируемыйТекст, НомерСимвола);
	Исключение
	КонецПопытки;
	
КонецПроцедуры
