#Область ПрограммныйИнтерфейс

// Возвращает таблицу доступных типов объектов для каждого мобильного приложения 
//
// Возвращаемое значение:
//   Таблица значений  с колонками ВариантНастройки, ТипОбъекта
//       "Соответствие" объектов конкретным строковым представлениям МП.
//
// Описание:
//   Данная таблица используется для определения необходимости регистрации 
//   конкретного объекта в плане обмена ОбменСМобильнымиПриложениями
//
Функция ТаблицаТиповОбъектовДоступныеДляМобильногоПриложения()  Экспорт    
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ВариантНастройки");
	Таблица.Колонки.Добавить("ТипОбъекта");        
	
	//Справочники
	Строка = Таблица.Добавить();
	Строка.ВариантНастройки 	= "Заказы";
	Строка.ТипОбъекта 			= Тип("СправочникОбъект.Контрагенты");    
	
	Строка = Таблица.Добавить();
	Строка.ВариантНастройки 	= "Кладовщик";
	Строка.ТипОбъекта 			= Тип("СправочникОбъект.Номенклатура");
	Строка = Таблица.Добавить();
	Строка.ВариантНастройки 	= "Заказы";
	Строка.ТипОбъекта 			= Тип("СправочникОбъект.Номенклатура");    
	
	Строка = Таблица.Добавить();
	Строка.ВариантНастройки 	= "Кладовщик";
	Строка.ТипОбъекта 			= Тип("СправочникОбъект.Организации");
	
	Строка = Таблица.Добавить();
	Строка.ВариантНастройки 	= "Кладовщик";
	Строка.ТипОбъекта 			= Тип("СправочникОбъект.СтруктурныеЕдиницы");
	
	Строка = Таблица.Добавить();
	Строка.ВариантНастройки 	= "Кладовщик";
	Строка.ТипОбъекта 			= Тип("СправочникОбъект.ХарактеристикиНоменклатуры");
	
	//Документы
	Строка = Таблица.Добавить();
	Строка.ВариантНастройки 	= "Кладовщик";
	Строка.ТипОбъекта 			= Тип("ДокументОбъект.ЗаказПокупателя");
	Строка = Таблица.Добавить();
	Строка.ВариантНастройки 	= "Заказы";
	Строка.ТипОбъекта 			= Тип("ДокументОбъект.ЗаказПокупателя");    
	
	Строка = Таблица.Добавить();
	Строка.ВариантНастройки 	= "Кладовщик";
	Строка.ТипОбъекта 			= Тип("ДокументОбъект.ЗаказПоставщику");
	
	Строка = Таблица.Добавить();
	Строка.ВариантНастройки 	= "Кладовщик";
	Строка.ТипОбъекта 			= Тип("ДокументОбъект.ИнвентаризацияЗапасов");
	
	Строка = Таблица.Добавить();
	Строка.ВариантНастройки 	= "Кладовщик";
	Строка.ТипОбъекта 			= Тип("ДокументОбъект.ПеремещениеЗапасов");
	
	Строка = Таблица.Добавить();
	Строка.ВариантНастройки 	= "Кладовщик";
	Строка.ТипОбъекта 			= Тип("ДокументОбъект.ПриходнаяНакладная");
	Строка = Таблица.Добавить();
	Строка.ВариантНастройки 	= "Заказы";
	Строка.ТипОбъекта 			= Тип("ДокументОбъект.ПриходнаяНакладная");    
	
	Строка = Таблица.Добавить();
	Строка.ВариантНастройки 	= "Кладовщик";
	Строка.ТипОбъекта 			= Тип("ДокументОбъект.РасходнаяНакладная");
	
	//Регистры сведений
	Строка = Таблица.Добавить();
	Строка.ВариантНастройки 	= "Заказы";
	Строка.ТипОбъекта 			= Тип("РегистрСведенийНаборЗаписей.ЦеныНоменклатуры");
	
	Возврат Таблица;
	
КонецФункции
 
#КонецОбласти