#Область ПрограммныйИнтерфейс

// Формирует документы закрытия смены при загрузке кассовой смены из РМК
//
// Параметры:
//  Источник 		- Кассовая смена, загруженная из РМК;
//  Отказ    		- Булево - признак отказа от проведения объекта.
//  РежимПроведения - РежимПроведенияДокумента - режим проведения документа
//
Процедура ОбменУРМКЗакрытиеСменыОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если НЕ Источник.ДополнительныеСвойства.Свойство("ОтложенноеПроведение")
		ИЛИ НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.КассаККМ, "ТипКассы") = Перечисления.ТипыКассККМ.ККМED  Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.Статус = Перечисления.СтатусыКассовойСмены.Закрыта Тогда
		ИнтеграцияУРМКУНФ.ОбработатьЗакрытиеСмены(Источник);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
