// Приказ ФНС России от 29.06.2012 N ММВ-7-6/435@
// "Об утверждении Порядка и условий присвоения, применения, а также изменения идентификационного номера налогоплательщика"

#Область ПрограммныйИнтерфейс

Функция МинимальнаяДлинаИНН() Экспорт
	
	// ММВ-7-6/435@
	// 1. Структура идентификационного номера налогоплательщика (далее - ИНН) представляет собой:
	// 1) для организации - 10 цифровой код:
	// 2) для физического лица - 12 цифровой код:
	
	Возврат 10;
	
КонецФункции

Функция ЭтоИННЮридическогоЛица(ИНН) Экспорт
	
	// ММВ-7-6/435@
	// 1. Структура идентификационного номера налогоплательщика (далее - ИНН) представляет собой:
	// 1) для организации - десятизначный цифровой код:
	
	Возврат СтрДлина(ИНН) = МинимальнаяДлинаИНН();
	
КонецФункции

Функция ЭтоИННФизическогоЛица(ИНН) Экспорт
	
	// ММВ-7-6/435@
	// 1. Структура идентификационного номера налогоплательщика (далее - ИНН) представляет собой:
	// 2) для физического лица - 12 цифровой код:
	
	Возврат СтрДлина(ИНН) = МаксимальнаяДлинаИНН();
	
КонецФункции

Процедура УдалитьИзНаименованияИНН(Наименование, ИНН) Экспорт
	
	ЭлементыНаименования = СтрРазделить(Наименование, " ", Ложь);
	Если ЭлементыНаименования.Количество() < 3 Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭлементыНаименования[0] <> "ИНН" Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭлементыНаименования[1] <> ИНН 
		И Не КлиентБанкКлиентСервер.ТолькоНулиВСтроке(ЭлементыНаименования[1]) Тогда
		Возврат;
	КонецЕсли;
	
	// Удалим часть наименования, включающую первое и второе слова.
	Для ИндексСлова = 0 По 1 Цикл
		Слово = ЭлементыНаименования[ИндексСлова];
		НачалоСлова  = СтрНайти(Наименование, Слово);
		КонецСлова   = НачалоСлова + СтрДлина(Слово); // Точнее, это позиция разделителя за концом слова
		Наименование = СокрЛ(Сред(Наименование, КонецСлова + 1));// Так как слов больше 2, то заведомо не выйдем за конец строки
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МаксимальнаяДлинаИНН()
	
	// ММВ-7-6/435@
	// 1. Структура идентификационного номера налогоплательщика (далее - ИНН) представляет собой:
	// 1) для организации - десятизначный цифровой код:
	// 2) для физического лица - 12 цифровой код:
	Возврат 12;
	
КонецФункции

#КонецОбласти