#Область ПрограммныйИнтерфейс

// Обработчик события ПередНачаломРаботыСистемы
//
Процедура ПередНачаломРаботыСистемы() Экспорт
	
	ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске();
	
	Если НЕ ПараметрыРаботыКлиента.Свойство("ПараметрыЗапускаМобильногоКлиента") Тогда
		Возврат;
	КонецЕсли;
		
	ПараметрыЗапускаМобильногоКлиента = ПараметрыРаботыКлиента.ПараметрыЗапускаМобильногоКлиента;
	
	Если ПараметрыЗапускаМобильногоКлиента.ЭтоМобильныйКлиент 
		И ПараметрыЗапускаМобильногоКлиента.НужноОткрытьФормуОценкиМобильногоКлиента Тогда
		ОткрытьФорму("ОбщаяФорма.ОценитьМобильныйКлиент", Новый Структура("ПоказатьНеСпрашивать", Истина));
	КонецЕсли; 
	
	ЗначенияСчетчикаЗапусковКлиента = ПараметрыЗапускаМобильногоКлиента.ЗначенияСчетчикаЗапусковКлиента;
	Если НЕ ЗначениеЗаполнено(ЗначенияСчетчикаЗапусковКлиента) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначенияСчетчикаЗапусковКлиента.ЗапретОткрытияФормыПереходаВМК Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначенияСчетчикаЗапусковКлиента.ЭтоМобильныйБраузер Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыРаботыКлиента.Свойство("ПоказатьОкноНачалоРаботыСПрограммой")
		И ПараметрыРаботыКлиента.ПоказатьОкноНачалоРаботыСПрограммой = Истина Тогда
		Возврат;
	КонецЕсли;
	НачалоРаботыСПрограммойСервер.УстановитьИнтерфейсНачалаРаботы("ОбщаяФорма.ФормаПереходаВМобильныйКлиент");
	ОбновитьИнтерфейс();
	НачалоРаботыСПрограммойСервер.УстановитьСтандартныйИнтерфейс();
	
КонецПроцедуры

#КонецОбласти