#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	МенеджерОбъекта = Перечисления._ВидыДокументов;
	
	СтандартнаяОбработка = Ложь;

	ДанныеВыбора = Новый СписокЗначений;
	
	ЗначениеИсключения = Новый Массив;
	ЗначениеИсключения.Добавить(МенеджерОбъекта.Площадка);
	ЗначениеИсключения.Добавить(МенеджерОбъекта.Мероприятие);
	ЗначениеИсключения.Добавить(МенеджерОбъекта.Спецпроект);
	
	Для Каждого ЗначениеОбъекта Из МенеджерОбъекта Цикл
		Если ЗначениеИсключения.Найти(ЗначениеОбъекта) = Неопределено Тогда
			ДанныеВыбора.Добавить(ЗначениеОбъекта);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
