#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗапрашиватьКоличество = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("ЗапрашиватьКоличество");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)

	ИзмененныеНастройки = Новый Структура;

	Если Модифицированность Тогда

		НеобходимоОбновитьИнтерфейс = Ложь;

		ИзмененныеНастройки.Вставить("ЗапрашиватьКоличество", ЗапрашиватьКоличество);

		СохранитьНовыеНастройкиИОбновитьИнтерфейс(НеобходимоОбновитьИнтерфейс, ИзмененныеНастройки);

		Если НеобходимоОбновитьИнтерфейс Тогда

			ОбновитьИнтерфейс();

		КонецЕсли;

	КонецЕсли;

	Закрыть(ИзмененныеНастройки);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура СохранитьНовыеНастройкиИОбновитьИнтерфейс(НеобходимоОбновитьИнтерфейс, ИзмененныеНастройки)

	Для Каждого ЭлементНастройки Из ИзмененныеНастройки Цикл

		ТекущееЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки(ЭлементНастройки.Ключ);
		Если ЭлементНастройки.Значение <> ТекущееЗначениеНастройки Тогда

			НеобходимоОбновитьИнтерфейс = Истина;
			РегистрыСведений.НастройкиПользователей.Установить(ЭлементНастройки.Значение,
				ЭлементНастройки.Ключ);

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти
