
#Область ОбработчикиСобытий

Функция НалогообложениеЗаполненоВОбработкеЗаполнения(пОбъектСсылка, пОснование) Экспорт
	
	НалогообложениеЗаполненоВОбработкеЗаполнения = пОбъектСсылка.Пустая()
		И (ТипЗнч(пОснование) = Тип("ДокументСсылка.ЗаказПокупателя")
			Или ТипЗнч(пОснование) = Тип("ДокументСсылка.РасходнаяНакладная")
			ИЛИ (ТипЗнч(пОснование) = Тип("Структура")
				И пОснование.Свойство("Основание")
				И ТипЗнч(пОснование.Основание) = Тип("ДокументСсылка.ЗаказПокупателя")));
	
	Возврат НалогообложениеЗаполненоВОбработкеЗаполнения;
	
КонецФункции

#КонецОбласти
