#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ИнициализироватьСвойстваФормы();
	
	РазрешенРасширенныйРежимНастройки =
		ИнтеграцияУРМКПереопределяемый.РазрешенРасширенныйРежимНастройкиОбменаУРМК();
		
	Если Не РазрешенРасширенныйРежимНастройки Тогда
		ИспользоватьРасширенныйРежимНастройкиУРМК = 0;
		УпрощенныйРежимНастройкиУРМКПриИзмененииНаСервере();
		
	КонецЕсли;
	
	ИспользоватьРасширенныйРежимНастройкиУРМК =
		ИнтеграцияУРМКСлужебный.ИспользоватьРасширенныйРежимНастройкиУРМК();
		
	УстановитьВидимостьНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УпрощенныйРежимНастройкиУРМКПриИзменении(Элемент)
	
	УпрощенныйРежимНастройкиУРМКПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиУРМКНажатие(Элемент)
	
	ОткрытьФорму("Обработка.ПомощникНастройкиОбменаУРМК.Форма.ПомощникНастройкиОбменаДанными");
	
КонецПроцедуры

#КонецОбласти

#Область ИнициализацияФормыПриСоздании

&НаСервере
Процедура ИнициализироватьСвойстваФормы()
	
	Заголовок = НСтр("ru = 'Режим настройки обмена с 1С:РМК'");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УпрощенныйРежимНастройкиУРМКПриИзмененииНаСервере()
	
	Константы.ИспользоватьРасширенныйРежимНастройкиУРМК.Установить(ИспользоватьРасширенныйРежимНастройкиУРМК);
	
КонецПроцедуры

#КонецОбласти

#Область ОбщиеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьНаСервере()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаПереключательРасширенныйРежимНастройкиУРМК",
		"Доступность",
		РазрешенРасширенныйРежимНастройки);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаДекорацияКомментарийДоступности",
		"Видимость",
		Не РазрешенРасширенныйРежимНастройки);

	КомментарийДоступности =
		НСтр("ru = 'Выбор расширенного режима настройки недоступен, потому что:
		|- продажа по нескольким Организациям не поддерживается в 1С:РМК.'");

	Если Не РазрешенРасширенныйРежимНастройки Тогда
		Элементы.ДекорацияКомментарийДоступности.Подсказка = КомментарийДоступности;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКомментарийДоступностиНажатие(Элемент)
	
	ТекстСообщения = Элемент.Подсказка;
	ПоказатьПредупреждение(, ТекстСообщения);

КонецПроцедуры

#КонецОбласти
