
#Область ПрограммныйИнтерфейс

// См. СборСтатистикиУНФ.ОтправитьСобытиеСДопДаннымиВФоне
//
Процедура ОтправитьСобытиеСДопДаннымиВФоне(ИмяСобытия, ДопДанные) Экспорт
	
	СборСтатистикиУНФ.ОтправитьСобытиеСДопДаннымиВФоне(ИмяСобытия, ДопДанные);
	
КонецПроцедуры

// См. СборСтатистикиУНФ.ОтправитьСобытиеСДопДанными
//
Процедура ОтправитьСобытиеСДопДанными(ИмяСобытия, ДопДанные, СообщениеОбОшибке = Неопределено) Экспорт
	
	СборСтатистикиУНФ.ОтправитьСобытиеСДопДанными(ИмяСобытия, ДопДанные, СообщениеОбОшибке);
	
КонецПроцедуры

// Отправляет информацию о запуске приложения.
//
Процедура ОтправитьИнформациюОЗапускеПриложения() Экспорт
	
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	ЭтоВебКлиент = ОбщегоНазначения.ЭтоВебКлиент();
	
	ЭтоПрочийКлиент = НЕ ЭтоМобильныйКлиент И НЕ ЭтоВебКлиент;
	
	ДопДанные = "<data><ЭтоМобильныйКлиент>{ЭтоМобильныйКлиент}</ЭтоМобильныйКлиент><ЭтоВебКлиент>{ЭтоВебКлиент}</ЭтоВебКлиент><ЭтоПрочийКлиент>{ЭтоПрочийКлиент}</ЭтоПрочийКлиент></data>";
	ДопДанные = СтрЗаменить(ДопДанные, "{ЭтоМобильныйКлиент}", ЭтоМобильныйКлиент);
	ДопДанные = СтрЗаменить(ДопДанные, "{ЭтоВебКлиент}", ЭтоВебКлиент);
	ДопДанные = СтрЗаменить(ДопДанные, "{ЭтоПрочийКлиент}", ЭтоПрочийКлиент);
	
	СборСтатистикиУНФВызовСервера.ОтправитьСобытиеСДопДаннымиВФоне("Запуск приложения", ДопДанные);
	
КонецПроцедуры // ОтправитьИнформациюОЗапускеПриложения()

#КонецОбласти
