
&Вместо("СведенияОЮрФизЛице")
Функция _СведенияОЮрФизЛице(ЮрФизЛицо, ДатаПериода, ДляФизЛицаТолькоИнициалы, БанковскийСчет)
	
	Сведения = ПродолжитьВызов(ЮрФизЛицо, ДатаПериода, ДляФизЛицаТолькоИнициалы, БанковскийСчет);
	
	Если ЗначениеЗаполнено(ЮрФизЛицо) Тогда
	
		Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Организации") Тогда
			
			Сведения.Вставить("СокращенноеНаименование"		, ЮрФизЛицо._НаименованиеСокращенное);
			Сведения.Вставить("СокращенноеНаименованиеАнг"	, ЮрФизЛицо._НаименованиеСокращенноеАнг);
			Сведения.Вставить("ПолноеНаименованиеАнг"		, ЮрФизЛицо._НаименованиеПолноеАнг);
			
		ИначеЕсли ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Контрагенты") Тогда
			
			Если ПустаяСтрока(ЮрФизЛицо._НаименованиеСокращенное) Тогда
				Сведения.Вставить("СокращенноеНаименование", 	 ЮрФизЛицо.НаименованиеПолное);
			Иначе
				Сведения.Вставить("СокращенноеНаименование", 	 ЮрФизЛицо._НаименованиеСокращенное);
			КонецЕсли;
			
			Сведения.Вставить("СокращенноеНаименованиеАнг"	, ЮрФизЛицо._НаименованиеСокращенноеАнг);
			Сведения.Вставить("ПолноеНаименованиеАнг"		, ЮрФизЛицо._НаименованиеПолноеАнг);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Сведения;
	
КонецФункции
