
&НаСервере
&После("ПриСозданииНаСервере")
Процедура _ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	_ОтображениеЭлементов_ДоговорыКонтрагентов(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура _ОтображениеЭлементов_ДоговорыКонтрагентов(Форма, Отказ, СтандартнаяОбработка)
	
	// _Бартер 
	//СтруктураЭлемента = Новый Структура;
	//СтруктураЭлемента.Вставить("ИмяРодителя"			, "ПраваяКолонка");
	//СтруктураЭлемента.Вставить("ИмяСледующегоЭлемента"	, "ДоговорПодписан");
	//СтруктураЭлемента.Вставить("Вид"					, ВидПоляФормы.ПолеФлажка);
	//СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._Бартер");
	//
	//СтруктураЭлемента.Вставить("ПоложениеЗаголовка"		, ПоложениеЗаголовкаЭлементаФормы.Право);
	//
	//_ОбщегоНазначения.ВставитьЭлемент(Форма, "_Бартер", Тип("ПолеФормы"), СтруктураЭлемента);
	
	// _ШаблонПечати
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("ИмяРодителя"			, "ПраваяКолонка");
	СтруктураЭлемента.Вставить("ИмяСледующегоЭлемента"	, "ДоговорПодписан");
	СтруктураЭлемента.Вставить("Вид"					, ВидПоляФормы.ПолеВвода);
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._ШаблонПечати");
	
	СтруктураЭлемента.Вставить("ПоложениеЗаголовка"		, ПоложениеЗаголовкаЭлементаФормы.Лево);
	СтруктураЭлемента.Вставить("АвтоМаксимальнаяШирина"	, Ложь);
	СтруктураЭлемента.Вставить("МаксимальнаяШирина"		, 36);
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_ШаблонПечати", Тип("ПолеФормы"), СтруктураЭлемента);
	
	// _Домен
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("ИмяРодителя"			, "ПраваяКолонка");
	СтруктураЭлемента.Вставить("ИмяСледующегоЭлемента"	, "ДоговорПодписан");
	СтруктураЭлемента.Вставить("Вид"					, ВидПоляФормы.ПолеВвода);
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._Домен");
	
	СтруктураЭлемента.Вставить("ПоложениеЗаголовка"		, ПоложениеЗаголовкаЭлементаФормы.Лево);
	СтруктураЭлемента.Вставить("АвтоМаксимальнаяШирина"	, Ложь);
	СтруктураЭлемента.Вставить("МаксимальнаяШирина"		, 36);
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_Домен", Тип("ПолеФормы"), СтруктураЭлемента);
	
	// _Продукт
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("ИмяРодителя"			, "ПраваяКолонка");
	СтруктураЭлемента.Вставить("ИмяСледующегоЭлемента"	, "ДоговорПодписан");
	СтруктураЭлемента.Вставить("Вид"					, ВидПоляФормы.ПолеВвода);
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._Продукт");
	
	СтруктураЭлемента.Вставить("ПоложениеЗаголовка"		, ПоложениеЗаголовкаЭлементаФормы.Лево);
	СтруктураЭлемента.Вставить("АвтоМаксимальнаяШирина"	, Ложь);
	СтруктураЭлемента.Вставить("МаксимальнаяШирина"		, 36);
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_Продукт", Тип("ПолеФормы"), СтруктураЭлемента);
	
	// _ВидПредставления
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("ИмяРодителя"			, "ЛеваяКолонка");
	СтруктураЭлемента.Вставить("ИмяСледующегоЭлемента"	, "ПризнакАгента");
	СтруктураЭлемента.Вставить("Вид"					, ВидПоляФормы.ПолеВвода);
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._ВидПредставления");
	
	СтруктураЭлемента.Вставить("ПоложениеЗаголовка"		, ПоложениеЗаголовкаЭлементаФормы.Лево);
	//руктураЭлемента.Вставить("АвтоМаксимальнаяШирина"	, Ложь);
	//руктураЭлемента.Вставить("МаксимальнаяШирина"		, 28);
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_ВидПредставления", Тип("ПолеФормы"), СтруктураЭлемента);
	
	// _Подписант
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("ИмяРодителя"			, "ЛеваяКолонка");
	СтруктураЭлемента.Вставить("ИмяСледующегоЭлемента"	, "Организация");
	СтруктураЭлемента.Вставить("Вид"					, ВидПоляФормы.ПолеВвода);
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._КонтактноеЛицоПодписант");
	
	СтруктураЭлемента.Вставить("ПоложениеЗаголовка"		, ПоложениеЗаголовкаЭлементаФормы.Лево);
	//руктураЭлемента.Вставить("АвтоМаксимальнаяШирина"	, Ложь);
	//руктураЭлемента.Вставить("МаксимальнаяШирина"		, 28);
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_КонтактноеЛицоПодписант", Тип("ПолеФормы"), СтруктураЭлемента);
	
	// _Подписант
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("ИмяРодителя"			, "ЛеваяКолонка");
	СтруктураЭлемента.Вставить("ИмяСледующегоЭлемента"	, "ВидДоговора");
	СтруктураЭлемента.Вставить("Вид"					, ВидПоляФормы.ПолеВвода);
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._ПодписьРуководителя");
	
	СтруктураЭлемента.Вставить("ПоложениеЗаголовка"		, ПоложениеЗаголовкаЭлементаФормы.Лево);
	//руктураЭлемента.Вставить("АвтоМаксимальнаяШирина"	, Ложь);
	//руктураЭлемента.Вставить("МаксимальнаяШирина"		, 28);
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_ПодписьРуководителя", Тип("ПолеФормы"), СтруктураЭлемента);

	
КонецПроцедуры
