
&НаКлиенте
Процедура ЗаполнитьДаннымиAdfox(Команда)
	ЗаполнитьДаннымиAdfoxНаСервере();
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиAdfoxНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	_Площадки.Ссылка КАК Площадка,
	|	_adfox_place_СреднедневныеПоказатели.loadsTotal_average_daily КАК Показы,
	|	_adfox_place_СреднедневныеПоказатели.loadsTotal_average_weekly КАК ПоказыВНеделю
	|ИЗ
	|	РегистрСведений._adfox_place_СреднедневныеПоказатели КАК _adfox_place_СреднедневныеПоказатели
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._Площадки КАК _Площадки
	|		ПО _adfox_place_СреднедневныеПоказатели.adfox_place = _Площадки.adfox";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений._ОжидаемыеСуточныеПоказателиТрафика.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры
