
Процедура ПриСозданииНаСервере(Форма) Экспорт
	
	// БанковскиеСчета
	Если Форма.ИмяФормы = "Справочник.БанковскиеСчета.Форма.ФормаЭлемента" Тогда
		
		_ОтображениеЭлементов_БанковскиеСчета(Форма);
		
	КонецЕсли;
	
	// КонтактныеЛица
	Если Форма.ИмяФормы = "Справочник.КонтактныеЛица.Форма.ФормаЭлемента" Тогда
		
		_ОтображениеЭлементов_КонтактныеЛица(Форма);
		
	КонецЕсли;
	
	// Подписи
	Если Форма.ИмяФормы = "Справочник.Подписи.Форма.ФормаЭлемента" Тогда
		
		_ОтображениеЭлементов_Подписи(Форма);
		
	КонецЕсли;
	
	// Контрагенты
	Если Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлемента" Тогда
		
		_ОтображениеЭлементов_Контрагенты(Форма);
		
	КонецЕсли;
	
	// Организации
	Если Форма.ИмяФормы = "Справочник.Организации.Форма.ФормаЭлемента" Тогда
		
		_ОтображениеЭлементов_Организации(Форма);
		
	КонецЕсли;
	
	// Пользователи
	Если Форма.ИмяФормы = "Справочник.Пользователи.Форма.ФормаЭлемента" Тогда
		
		_ОтображениеЭлементов_Пользователи(Форма);
		
	КонецЕсли;
	
	// Пользователи
	Если Форма.ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		
		_ОтображениеЭлементов_ЗаказПокупателя(Форма);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура _ОтображениеЭлементов_ЗаказПокупателя(Форма)
	
	Форма.Элементы["ЗапасыСпецификация"].Видимость = Ложь;
	
КонецПроцедуры

Процедура _ОтображениеЭлементов_Пользователи(Форма)
	
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("ИмяРодителя"			, "ГруппаДанныеШапки");
	СтруктураЭлемента.Вставить("ИмяСледующегоЭлемента"	, "");
	СтруктураЭлемента.Вставить("Вид"					, ВидПоляФормы.ПолеВвода);
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._СтруктураПредприятия");
	
	СтруктураЭлемента.Вставить("ПоложениеЗаголовка"		, ПоложениеЗаголовкаЭлементаФормы.Лево);
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_СтруктураПредприятия", Тип("ПолеФормы"), СтруктураЭлемента);
	
КонецПроцедуры

Процедура _ОтображениеЭлементов_Организации(Форма)
	
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("ИмяРодителя"			, "СписокРеквизитов");
	СтруктураЭлемента.Вставить("ИмяСледующегоЭлемента"	, "НаименованиеПолное");
	СтруктураЭлемента.Вставить("Вид"					, ВидПоляФормы.ПолеВвода);
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._НаименованиеСокращенное");
	
	СтруктураЭлемента.Вставить("ПоложениеЗаголовка"		, ПоложениеЗаголовкаЭлементаФормы.Лево);
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_НаименованиеСокращенное", Тип("ПолеФормы"), СтруктураЭлемента);
	
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("ИмяРодителя"			, "СписокРеквизитов");
	СтруктураЭлемента.Вставить("ИмяСледующегоЭлемента"	, "НаименованиеПолное");
	СтруктураЭлемента.Вставить("Вид"					, ВидПоляФормы.ПолеВвода);
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._НаименованиеСокращенноеАнг");
	
	СтруктураЭлемента.Вставить("ПоложениеЗаголовка"		, ПоложениеЗаголовкаЭлементаФормы.Лево);
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_НаименованиеСокращенноеАнг", Тип("ПолеФормы"), СтруктураЭлемента);
	
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("ИмяРодителя"			, "СписокРеквизитов");
	СтруктураЭлемента.Вставить("ИмяСледующегоЭлемента"	, "НаименованиеПолное");
	СтруктураЭлемента.Вставить("Вид"					, ВидПоляФормы.ПолеВвода);
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._НаименованиеПолноеАнг");
	
	СтруктураЭлемента.Вставить("ПоложениеЗаголовка"		, ПоложениеЗаголовкаЭлементаФормы.Лево);
	СтруктураЭлемента.Вставить("МногострочныйРежим"		, Истина);
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_НаименованиеПолноеАнг", Тип("ПолеФормы"), СтруктураЭлемента);
	
КонецПроцедуры

Процедура _ОтображениеЭлементов_Контрагенты(Форма)
	
	ЭлементНаименованиеПолное = Форма.Элементы["НаименованиеПолное"];
	ЭлементНаименованиеПолное.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	ЭлементНаименованиеПолное.АвтоМаксимальнаяШирина	= Истина;
	ЭлементНаименованиеПолное.МаксимальнаяШирина		= 0;
	
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("ИмяРодителя"			, "Компания");
	СтруктураЭлемента.Вставить("ИмяСледующегоЭлемента"	, "НаименованиеПолное");
	СтруктураЭлемента.Вставить("Вид"					, ВидПоляФормы.ПолеВвода);
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._НаименованиеСокращенное");
	
	СтруктураЭлемента.Вставить("ПоложениеЗаголовка"		, ПоложениеЗаголовкаЭлементаФормы.Лево);
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_НаименованиеСокращенное", Тип("ПолеФормы"), СтруктураЭлемента);
	
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("ИмяРодителя"			, "Компания");
	СтруктураЭлемента.Вставить("ИмяСледующегоЭлемента"	, "НаименованиеПолное");
	СтруктураЭлемента.Вставить("Вид"					, ВидПоляФормы.ПолеВвода);
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._НаименованиеСокращенноеАнг");
	
	СтруктураЭлемента.Вставить("ПоложениеЗаголовка"		, ПоложениеЗаголовкаЭлементаФормы.Лево);
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_НаименованиеСокращенноеАнг", Тип("ПолеФормы"), СтруктураЭлемента);
	
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("ИмяРодителя"			, "Компания");
	СтруктураЭлемента.Вставить("ИмяСледующегоЭлемента"	, "Наименование");
	СтруктураЭлемента.Вставить("Вид"					, ВидПоляФормы.ПолеВвода);
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._НаименованиеПолноеАнг");
	
	СтруктураЭлемента.Вставить("ПоложениеЗаголовка"		, ПоложениеЗаголовкаЭлементаФормы.Лево);
	СтруктураЭлемента.Вставить("МногострочныйРежим"		, Истина);
	СтруктураЭлемента.Вставить("АвтоМаксимальнаяВысота"	, Ложь);
	СтруктураЭлемента.Вставить("МаксимальнаяВысота"		, 2);
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_НаименованиеПолноеАнг", Тип("ПолеФормы"), СтруктураЭлемента);
	
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("ИмяРодителя"			, "Компания");
	СтруктураЭлемента.Вставить("ИмяСледующегоЭлемента"	, "");
	СтруктураЭлемента.Вставить("Вид"					, ВидПоляФормы.ПолеВвода);
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._Партнер");
	
	СтруктураЭлемента.Вставить("ПоложениеЗаголовка"		, ПоложениеЗаголовкаЭлементаФормы.Лево);
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_Партнер", Тип("ПолеФормы"), СтруктураЭлемента);
	
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("ИмяРодителя"			, "Компания");
	СтруктураЭлемента.Вставить("ИмяСледующегоЭлемента"	, "");
	СтруктураЭлемента.Вставить("Вид"					, ВидПоляФормы.ПолеВвода);
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._Холдинг");
	
	СтруктураЭлемента.Вставить("ПоложениеЗаголовка"		, ПоложениеЗаголовкаЭлементаФормы.Лево);
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_Холдинг", Тип("ПолеФормы"), СтруктураЭлемента);
	
КонецПроцедуры

Процедура _ОтображениеЭлементов_БанковскиеСчета(Форма)
	
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("ИмяРодителя"			, "");
	СтруктураЭлемента.Вставить("ИмяСледующегоЭлемента"	, "");
	СтруктураЭлемента.Вставить("Вид"					, ВидПоляФормы.ПолеВвода);
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._ПредставлениеАнг");
	
	СтруктураЭлемента.Вставить("ПоложениеЗаголовка"		, ПоложениеЗаголовкаЭлементаФормы.Лево);
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_ПредставлениеАнг", Тип("ПолеФормы"), СтруктураЭлемента);
		
КонецПроцедуры

Процедура _ОтображениеЭлементов_Подписи(Форма)
	
	// _ГруппаРус
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("ИмяРодителя"			, "ГруппаПодписант");
	СтруктураЭлемента.Вставить("ИмяСледующегоЭлемента"	, "");
	СтруктураЭлемента.Вставить("Вид"					, ВидГруппыФормы.ОбычнаяГруппа);
	СтруктураЭлемента.Вставить("Заголовок"				, "Русское представление");
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_ГруппаРус", Тип("ГруппаФормы"), СтруктураЭлемента);
	
	// _ГруппаАнг
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("ИмяРодителя"			, "ГруппаПодписант");
	СтруктураЭлемента.Вставить("ИмяСледующегоЭлемента"	, "");
	СтруктураЭлемента.Вставить("Вид"					, ВидГруппыФормы.ОбычнаяГруппа);
	СтруктураЭлемента.Вставить("Заголовок"				, "Английское представление");
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_ГруппаАнг", Тип("ГруппаФормы"), СтруктураЭлемента);
	
	////
	ЭлементДолжность = Форма.Элементы["Должность"];
	ЭлементДолжность.Заголовок = "Должность";
	Форма.Элементы.Переместить(ЭлементДолжность, Форма.Элементы["_ГруппаРус"]);
	
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("ИмяРодителя"			, "_ГруппаРус");
	СтруктураЭлемента.Вставить("ИмяСледующегоЭлемента"	, "");
	СтруктураЭлемента.Вставить("Вид"					, ВидПоляФормы.ПолеВвода);
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._ДоговорЛицо");
	СтруктураЭлемента.Вставить("АвтоМаксимальнаяШирина"	, Ложь);
	СтруктураЭлемента.Вставить("МаксимальнаяШирина"		, 65);
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_ДоговорЛицо", Тип("ПолеФормы"), СтруктураЭлемента);
	
	//
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._ДоговорОснование");
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_ДоговорОснование", Тип("ПолеФормы"), СтруктураЭлемента);
	
	
	////
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("ИмяРодителя"			, "_ГруппаАнг");
	СтруктураЭлемента.Вставить("ИмяСледующегоЭлемента"	, "");
	СтруктураЭлемента.Вставить("Вид"					, ВидПоляФормы.ПолеВвода);
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._НаименованиеАнг");
	СтруктураЭлемента.Вставить("АвтоМаксимальнаяШирина"	, Ложь);
	СтруктураЭлемента.Вставить("МаксимальнаяШирина"		, 65);
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_НаименованиеАнг", Тип("ПолеФормы"), СтруктураЭлемента);
	
	//
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._ДолжностьАнг");
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_ДолжностьАнг", Тип("ПолеФормы"), СтруктураЭлемента);
	
	//
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._ДоговорЛицоАнг");
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_ДоговорЛицоАнг", Тип("ПолеФормы"), СтруктураЭлемента);
	
	//
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._ДоговорОснованиеАнг");
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_ДоговорОснованиеАнг", Тип("ПолеФормы"), СтруктураЭлемента);
			
КонецПроцедуры

Процедура _ОтображениеЭлементов_КонтактныеЛица(Форма)
	
	// _ГруппаРус
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("ИмяРодителя"			, "ГруппаКонтрагенты");
	СтруктураЭлемента.Вставить("ИмяСледующегоЭлемента"	, "");
	СтруктураЭлемента.Вставить("Вид"					, ВидГруппыФормы.ОбычнаяГруппа);
	СтруктураЭлемента.Вставить("Заголовок"				, "Русское представление");
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_ГруппаРус", Тип("ГруппаФормы"), СтруктураЭлемента);
	
	// _ГруппаАнг
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("ИмяРодителя"			, "ГруппаКонтрагенты");
	СтруктураЭлемента.Вставить("ИмяСледующегоЭлемента"	, "");
	СтруктураЭлемента.Вставить("Вид"					, ВидГруппыФормы.ОбычнаяГруппа);
	СтруктураЭлемента.Вставить("Заголовок"				, "Английское представление");
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_ГруппаАнг", Тип("ГруппаФормы"), СтруктураЭлемента);
	
	////
	//ЭлементДолжность = Форма.Элементы["ДолжностьПоВизитке"];
	//ЭлементДолжность.Заголовок = "Должность";
	//Форма.Элементы.Переместить(ЭлементДолжность, Форма.Элементы["_ГруппаРус"]);
	
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("ИмяРодителя"			, "_ГруппаРус");
	СтруктураЭлемента.Вставить("ИмяСледующегоЭлемента"	, "");
	СтруктураЭлемента.Вставить("Вид"					, ВидПоляФормы.ПолеВвода);
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._Должность");
	СтруктураЭлемента.Вставить("АвтоМаксимальнаяШирина"	, Ложь);
	СтруктураЭлемента.Вставить("МаксимальнаяШирина"		, 65);
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_Должность", Тип("ПолеФормы"), СтруктураЭлемента);
	
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("ИмяРодителя"			, "_ГруппаРус");
	СтруктураЭлемента.Вставить("ИмяСледующегоЭлемента"	, "");
	СтруктураЭлемента.Вставить("Вид"					, ВидПоляФормы.ПолеВвода);
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._ДоговорЛицо");
	СтруктураЭлемента.Вставить("АвтоМаксимальнаяШирина"	, Ложь);
	СтруктураЭлемента.Вставить("МаксимальнаяШирина"		, 65);
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_ДоговорЛицо", Тип("ПолеФормы"), СтруктураЭлемента);
	
	//
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._ДоговорОснование");
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_ДоговорОснование", Тип("ПолеФормы"), СтруктураЭлемента);
	
	
	////
	СтруктураЭлемента = Новый Структура;
	СтруктураЭлемента.Вставить("ИмяРодителя"			, "_ГруппаАнг");
	СтруктураЭлемента.Вставить("ИмяСледующегоЭлемента"	, "");
	СтруктураЭлемента.Вставить("Вид"					, ВидПоляФормы.ПолеВвода);
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._НаименованиеАнг");
	СтруктураЭлемента.Вставить("АвтоМаксимальнаяШирина"	, Ложь);
	СтруктураЭлемента.Вставить("МаксимальнаяШирина"		, 65);
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_НаименованиеАнг", Тип("ПолеФормы"), СтруктураЭлемента);
	
	//
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._ДолжностьАнг");
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_ДолжностьАнг", Тип("ПолеФормы"), СтруктураЭлемента);
	
	//
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._ДоговорЛицоАнг");
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_ДоговорЛицоАнг", Тип("ПолеФормы"), СтруктураЭлемента);
	
	//
	СтруктураЭлемента.Вставить("ПутьКДанным"			, "Объект._ДоговорОснованиеАнг");
	
	_ОбщегоНазначения.ВставитьЭлемент(Форма, "_ДоговорОснованиеАнг", Тип("ПолеФормы"), СтруктураЭлемента);
			
КонецПроцедуры