///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ЭтоУдаление 			= ЭтотОбъект.Количество() = 0;
	ЭтоОтменаПроведения 	= ?(ЭтотОбъект.ДополнительныеСвойства.Свойство("ОтменаПроведения"), ЭтотОбъект.ДополнительныеСвойства.ОтменаПроведения, Ложь);
	ЭтоПроведение 			= ?(ЭтотОбъект.ДополнительныеСвойства.Свойство("Проведение"), ЭтотОбъект.ДополнительныеСвойства.Проведение, Ложь);
	ЭтоПодпискаНаСобытие	= ?(ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоРаботаПодпискиНаСобытие"), ЭтотОбъект.ДополнительныеСвойства.ЭтоРаботаПодпискиНаСобытие, Ложь);
	
	Если ЭтоУдаление 
		И НЕ ЭтоОтменаПроведения 
		И НЕ ЭтоПроведение 
		И НЕ ЭтоПодпискаНаСобытие Тогда
		
		ЭтотОбъект.Прочитать();
		МассивДокументов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ЭтотОбъект.ВыгрузитьКолонку("ДокументУстановки"));
		Если МассивДокументов.Количество() > 0 Тогда			
			Отказ = ЗначениеЗаполнено(МассивДокументов[0]);
		КонецЕсли;
		ЭтотОбъект.Очистить();
		Если Отказ Тогда
			ВызватьИсключение НСтр("ru = 'Запись сформирована документом.'");
		КонецЕсли;		
		
	КонецЕсли;		
	
КонецПроцедуры
#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли