
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтрокаURL = Параметры.СтрокаURL;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитовЭлементовФормы 

&НаКлиенте
Процедура ПодтвердитьОперацию(Команда)
	
	Закрыть(СтрокаЗначениеСКартинки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьКартинкуНаСервере()
	СтрокаURL = (СтрокаURL)
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКартинку(Команда)
	ОбновитьКартинкуНаСервере();
КонецПроцедуры

#КонецОбласти
