#Область СлужебныйПрограммныйИнтерфейс

// См. ПечатьДокументовУНФ.ПроверитьВозможностьПечатиУКД
Процедура ПроверитьВозможностьПечатиУКД(ПараметрКоманды, Ошибки) Экспорт
	ПечатьДокументовУНФ.ПроверитьВозможностьПечатиУКД(ПараметрКоманды, Ошибки);
КонецПроцедуры

// Возвращаемое значение:
// 	См. ПечатьДокументовУНФ.ПодготовитьСтруктуруДанныхПечатиЭтикетокИЦенниковИзДокументов
Функция ПодготовитьСтруктуруДанныхПечатиЭтикетокИЦенниковИзДокументов(МассивДокументов, ЭтоЦенники) Экспорт
	Возврат ПечатьДокументовУНФ.ПодготовитьСтруктуруДанныхПечатиЭтикетокИЦенниковИзДокументов(МассивДокументов, ЭтоЦенники);
КонецФункции

// Устарела. Будет удалена в следующей версии программы.
// Возвращаемое значение:
// 	СправочникСсылка.ДоговорыКонтрагентов - Договор документа.
// 
Функция ДоговорДокумента(Документ) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Договор");
КонецФункции

// Возвращаемое значение:
// 	См. ПечатьДокументовУНФ.СписокМакетовСчетовФактур
Функция СписокМакетовСчетовФактур(Документ) Экспорт
	Возврат ПечатьДокументовУНФ.СписокМакетовСчетовФактур(Документ);
КонецФункции

// Возвращаемое значение:
// 	См. ПечатьДокументовУНФ.ОрганизацияИзПараметраКоманды
Функция ОрганизацияИзПараметраКоманды(ПараметрКоманды) Экспорт
	Возврат ПечатьДокументовУНФ.ОрганизацияИзПараметраКоманды(ПараметрКоманды);
КонецФункции

#КонецОбласти