#Область ПрограммныйИнтерфейс

// См. СчетаФактурыУНФ.ЗаполнитьПараметрыПечатиУКД
Процедура ЗаполнитьПараметрыПечатиУКД(ПараметрКоманды, ИсточникиПечати, СообщенияПользователю) Экспорт
	СчетаФактурыУНФ.ЗаполнитьПараметрыПечатиУКД(ПараметрКоманды, ИсточникиПечати, СообщенияПользователю);
КонецПроцедуры

// См. СчетаФактурыУНФ.ПолучитьПодчиненныйСчетФактуру
Функция ПолучитьПодчиненныйСчетФактуру(ДокументОснование, Полученный = Ложь) Экспорт
	Возврат СчетаФактурыУНФ.ПолучитьПодчиненныйСчетФактуру(ДокументОснование, Полученный);
КонецФункции

#КонецОбласти